{"title":"The Politically Incorrect Guide To Science-Tom Bethel (2005).pdf","uid":4001414,"size":57217419,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:007330e9a7638cfa4ac10b5af831825d9ef5ba0e&amp;dn=The+Politically+Incorrect+Guide+To+Science-Tom+Bethel+%282005%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xofokim","files":1,"time":1201586645,"description":"Editorial Reviews\nFrom Publishers Weekly\n&quot;If the globe is warming, is mankind responsible, or is the sun?&quot; Such a statement does not appear out of place in Bethell&amp;#039;s entertaining account of how modern science is politically motivated and in desperate need of oversight. Bethell writes in a compulsively readable style, and although he provides legitimate insight into the potential benefits of nuclear power and hormesis, some readers will be turned off when he attempts to disprove global warming and especially evolution. Throughout the book, Bethell makes questionable claims about subjects as varied as AIDS (&quot;careful U.S. studies had already shown that at least a thousand sexual contacts are needed to achieve heterosexual transmission of the virus&quot;) and extinction (&quot;It is not possible definitely to attribute any given extinction to human activity&quot;), and backs up his arguments with references to the music magazine SPIN and thriller-writer Michael Crichton. Ironically, Bethell ends up proving his own premise by producing a highly politicized account of how liberal intellectuals and unchecked government agencies have created a &quot;white-coated priesthood&quot; whose lust for grant money has driven them to produce fearsome (but in Bethell&amp;#039;s view, false) tales of ozone destruction and AIDS pandemics. In the end, this book is unlikely to sway readers who aren&amp;#039;t already in Bethell&amp;#039;s ideological camp, as any points worthy of discussion get lost in the glut of unsourced claims that populate this latest installment of &quot;The Politically Incorrect Guide&quot; series.\n\n\nBook Description\nCovers subjects spanning evolution, stem cell research, abortion, HIV/AIDS, global warming, and cloning to help you tune up your balony detector to expose the liberal, anti-religious propaganda we&amp;#039;re being fed. \n\n","torrent":{"xt":"urn:btih:007330e9a7638cfa4ac10b5af831825d9ef5ba0e","amp;dn":"The+Politically+Incorrect+Guide+To+Science-Tom+Bethel+%282005%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"007330e9a7638cfa4ac10b5af831825d9ef5ba0e","infoHashBuffer":{"type":"Buffer","data":[0,115,48,233,167,99,140,250,74,193,11,90,248,49,130,93,158,245,186,14]},"announce":[],"urlList":[]}}