{"title":"Peter Ackroyd - William Blake: A Biography (pdf)","uid":8217224,"size":17478422,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0088c4ce1371176551d9281afac4b98afe1b5c2b&amp;dn=Peter+Ackroyd+-+William+Blake%3A+A+Biography+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"pharmakate","files":-1,"time":1362366885,"description":"Peter Ackroyd - Blake: A Biography (Bantam, 1995). 400 pages + plates.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc. Quality of plates, especially the colour ones, is not great due to glare from the scanner.\n\nBiography of the great English poet, artist, and visionary anarchist.\n\n&quot;MARVELOUS . . . A first-rate biography of an extraordinary man.&quot;           \n--The Wall Street Journal\n\n&quot;SUPERB . . . Ackroyd writes with clarity and ease: His book is consistently intelligent, entertaining and affectionate. One closes its pages full of admiration for Blake and eager to study his pictures and read his poetry. . . . Ackroyd emphasizes Blake the visionary Londoner, like Turner or Dickens, and convincingly relates the poet's work to the social upheavals of his time. . . . Above all, [he] makes Blake live for the modern reader.&quot; \n--The Washington Post Book World                      \n\n&quot;LYRICAL AND ILLUMINATING . . .  Ackroyd is a masterly storyteller and interpreter of Blake's writing and art.&quot;  \n--Chicago Tribune \n\n&quot;THE WORK OF A WRITER AT THE PEAK OF HIS LITERARY POWERS . . . It is one of the great strengths of Ackroyd's writing that he reminds us that every individual life and cast of mind has a tradition behind it, a context of other lives and minds which is half forgotten or not remembered at all. As a writer, he is always letting his bucket deeper and deeper down the historical well.&quot; \n--The New Yorker\n\nReview\n\nWilliam Blake, a London hosier's son, began having mystical visions at the age of eight and came to see his life as a revelation of eternity. While eking out a living as an engraver, he offered, quite unsuccessfully, his great series of prophetic books, Songs of Innocence and Experience. For Ackroyd, biographer of both Charles Dickens and T. S. Eliot, Blake was a visionary, who long before Freud saw warfare as a form of repressed sexuality and believed there were eternal states of rage, desire and selfhood through which a man passes, keeping his soul intact. The tragedy was that he had the capacity to become a great public and religious poet, but instead turned in upon himself, gaining neither reputation nor influence in his lifetime.\n\nFrom Publishers Weekly\n\nPublished to rave reviews in England, Ackroyd's moving and luminous biography of William Blake (1757-1827) serves as an ideal point of entry into the poet and artist's visionary world. Withdrawn, secretive, detached from ordinary affairs, Blake, a London hosier's son, began having mystical visions around age eight and came to see his life as a revelation of eternity. While eking out a living as an engraver, he stripped away levels of conventional perception to create a universe of mythical figures, muses and angels, or prophets and bards who stand alone against the world. For Ackroyd, biographer of Dickens and T.S. Eliot, Blake's tragedy was that he had the capacity to become a great public and religious poet but instead turned in upon himself, gaining neither reputation nor influence in his lifetime. Combining meticulous scholarship with uncanny psychological insight, this marvelously illustrated biography (with color and b&amp;w plates of Blake's paintings, drawings and engravings) presents him as a prescient social critic who, long before Freud, saw warfare as a form of repressed sexuality, and whose prophetic epic poems offer a cogent vision of humanity's spiritual renewal.","torrent":{"xt":"urn:btih:0088c4ce1371176551d9281afac4b98afe1b5c2b","amp;dn":"Peter+Ackroyd+-+William+Blake%3A+A+Biography+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0088c4ce1371176551d9281afac4b98afe1b5c2b","infoHashBuffer":{"type":"Buffer","data":[0,136,196,206,19,113,23,101,81,217,40,26,250,196,185,138,254,27,92,43]},"announce":[],"urlList":[]}}