{"title":"The Astronauts - Rarities (1991)","uid":8402050,"size":454592609,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:00c7467ddf326a19ecc78f0de58ac6bb42e09bbf&amp;dn=The+Astronauts+-+Rarities+%281991%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":47,"time":1366723332,"description":"This is the same torrent that was uploaded to Demonoid in August 2008.\n\n\nThe Astronauts - Rarities (1991)\n &lt;a href=&quot;\nhttp://www.goofinrecords.com/uploadkuvat/levyt/BCD15556.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.goofinrecords.com/uploadkuvat/levyt/BCD15556.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nTracks have full tags (including embedded thumbnail).\nAll artwork in jpgs at 300 d.p.i. Rotated and cropped losslessly using jpegcrop. (Includes 12 page booklet.)\nAMG Bio.txt\nAMG Review.txt\nNotes.txt (which is simply these notes included in the torrent)\n\nBio from All Music:\n\nAlong with Minnesota's Trashmen, the Astronauts (from Colorado) were the premier landlocked Midwestern surf group of the '60s. They recorded numerous singles and albums and achieved vast regional popularity, but only scored one modest national hit, &quot;Baja.&quot; With little material of their own, they judiciously tapped heavyweights like Lee Hazelwood (who wrote &quot;Baja&quot;), Roger Christian, and Gary Usher, as well as covering tunes by Dick Dale and Henry Mancini. The group shone brightest on their instrumentals, which used mounds of Fender reverb and two rhythm guitars; when they sang, the results were much less successful.\n\nTaken From: &lt;a href=&quot; http://wc05.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:h9fqxqr5ldae&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://wc05.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:h9fqxqr5ldae&lt;/a&gt;\n\nAll Music Album Review:\n\nNormally, a CD like this, made up of true obscurities, wouldn't be the place that one should start listening to a group. But it's also almost impossible to listen to this collection of early tracks and vault leftovers and not feel a tremendous respect for the Astronauts, or conclude that this CD might be as good a place as any for the neophyte listener to plunge into their sound. It's all that strong. The early Palladium Records single &quot;Come Along Baby&quot; b/w &quot;Tryin' to Get to You&quot; (the latter featuring vocals by bassist Stormy Patterson) is pretty impressive, and the two dozen outtakes from their 1963-1965 RCA sessions show off a band that had several albums' worth of substantial and enjoyable surf music at their disposal, the unheard stuff every bit as good as what got released. Robert Demmon, Dennis Lindsey, and Richard Fifield could come up with as many interesting and different guitar attacks, and James Gallagher was just as adept on the drums as their opposite numbers in the Ventures; only the latter group got to release about three albums a year, whereas the Astronauts did about a third of that. What's more, as &quot;Tryin' to Get to You&quot; and &quot;Everyone but Me&quot; show, they were fairly strong in the vocal department when necessary, although &quot;My Little Beach Bunny&quot; was nothing to write home about in terms of lyrics. Their later stuff here, especially &quot;Buy Me a Round&quot; and &quot;Shame Shame Shame,&quot; has a garage punk edge that will prove a real shocker for those who only associate the group with their surf movie appearances. Their 1965-vintage rendition of &quot;Tomorrow's Gonna Be Another Day&quot; is a snarling masterpiece that runs circles around the Monkees' version, and it's followed by an instrumental adaptation of the same material that doubles the fun. Next up, in turn, are the vaguely folk-rockish &quot;The Tables Have Turned&quot; and &quot;Girls Like You&quot; with their jangly guitars and Searchers-like introductions -- and it's difficult to hold anything against any band that covers &quot;I'm Gonna Buy Me a Dog.&quot; The stuff here may all be rare or hard-to-find for lots of reasons, but not because it deserves to be. The sound is excellent, up to Bear Family's usual standard, and the annotation nicely informative and, at times, downright fun -- a lot like the music.\n\nTaken from: &lt;a href=&quot; http://wc05.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:a9fexquhldje&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://wc05.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:a9fexquhldje&lt;/a&gt;\n\nTrack List:\n\n01. Come Along Baby\n02. Tryin' To Get To You\n03. Surf Softly And Carry A Big Board\n04. The Pier\n05. Surf Party\n06. Firewater\n07. Hot-Doggin'\n08. Every One But Me\n09. Quasimoto\n10. Scotch And Guitar\n11. Surf's You Right\n12. Let's Surf Again\n13. Surfer Girl\n14. My Little Beach Bunny\n15. Around And Around\n16. Surf Softly And Carry A Big Board (dubbed)\n17. Main Title From Ride The Wild Surf\n18. Go Fight For Her\n19. Swim Little Mermaid\n20. Tomorrow's Gonna Be Another Day\n21. Razzamatazz\n22. The Tables Have Turned\n23. I'm Gonna Buy Me A Dog\n24. The La La La Song\n25. Buy Me A Round\n26. Girls Like You\n27. Count Your Mistakes\n28. Shame, Shame, Shame\n\n","torrent":{"xt":"urn:btih:00c7467ddf326a19ecc78f0de58ac6bb42e09bbf","amp;dn":"The+Astronauts+-+Rarities+%281991%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00c7467ddf326a19ecc78f0de58ac6bb42e09bbf","infoHashBuffer":{"type":"Buffer","data":[0,199,70,125,223,50,106,25,236,199,143,13,229,138,198,187,66,224,155,191]},"announce":[],"urlList":[]}}