{"title":"The Doors - Strange Days (Perception Remaster) [EAC-FLAC] [RePoP","uid":4469634,"size":270464402,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0106176e526906a0d220d6ca478b0b215dc54157&amp;dn=The+Doors+-+Strange+Days+%28Perception+Remaster%29+%5BEAC-FLAC%5D+%5BRePoP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"repopo","files":-1,"time":1225064151,"description":"*******************************************************************************\n                 The Doors - Strange Days (Perception Remaster)\n*******************************************************************************\n\nThe Doors - Strange Days (Perception Remaster)\n\n01.- Strange Days  [03:09]\n02.- You're Lost Little Girl  [03:03]\n03.- Love Me Two Times  [03:16]\n04.- Unhappy Girl  [02:00]\n05.- Horse Latitudes  [01:35]\n06.- Moonlight Drive  [03:04]\n07.- People Are Strange  [02:12]\n08.- My Eyes Have Seen You  [02:29]\n09.- I Can't See Your Face In My Mind  [03:26]\n10.- When the Music's Over  [11:00]\n11.- People Are Strange (False Starts &amp; Studio Dialogue) **  [01:58]\n12.- Love Me Two Times (Take 3) ** [03:19]\n\n** = Bonus tracks, exclusive for this release\n\nCD Ripped using Exact Audio Copy.  Converted to FLAC using dbPowerAmp.  This album is part of the &quot;Perception&quot; box set, which enclosed all six studio \nalbums from The Doors, with bonus DVDs and a enhanced audio, specifically remastered for this box.\n\n-------------------------------------------------------------------------------\nReview by Bruce Eder (allmusicguide)\n\nMany of the songs on Strange Days had been written around the same time as the ones that appeared on The Doors, and with hindsight one has the sense that the best of the batch had already been cherry picked for the debut album. For that reason, the band's second effort isn't as consistently stunning as their debut, though overall it's a very successful continuation of the themes of their classic album. Besides the hit &quot;Strange Days,&quot; highlights included the funky &quot;Moonlight Drive,&quot; the eerie &quot;You're Lost Little Girl,&quot; and the jerkily rhythmic &quot;Love Me Two Times,&quot; which gave the band a small chart single. &quot;My Eyes Have Seen You&quot; and &quot;I Can't See Your Face in My Mind&quot; are minor but pleasing entries in the group's repertoire that share a subdued Eastern psychedelic air. The 11-minute &quot;When the Music's Over&quot; would often be featured as a live showstopper, yet it also illustrated their tendency to occasionally slip into drawn-out bombast.\n\nOriginally released as part of the completed recorded works 2006 box set Perception, this deluxe edition of the Doors' 1967 sophomore album, Strange Days, is a double-disc set containing one CD featuring a newly remastered version of the album with bonus tracks and a DVD with a 5.1 Surround mix, bonus video footage and a photo gallery. Given that the Doors catalog was remastered just seven years before this box, the sonics of these 2006s remasters are noticeable but not radically different -- the kind of subtle remastering that is significant to audiophiles who know this music intimately. Similarly, the bonus tracks are not major revelations: a take of &quot;People Are Strange&quot; complete with false starts and dialogue, plus an alternate take of &quot;Love Me Two Times,&quot; while the videos contains performances of &quot;Love Me Two Times&quot; and &quot;When the Music's Over&quot; filmed in Europe in 1968. Just because these aren't big revelations doesn't mean that this deluxe edition doesn't live up to its title: this is the best-sounding, best-presented reissue of this album yet.\n\nAbout the album (from Wikipedia)\n\nThe album earned a gold record and reached No. 3 on the Billboard Hot 200, but its producer, Paul Rothchild, considered it a commercial failure, even if it was an artistic triumph. &quot;We all thought it was the best album. Significantly, it was also the one with the weakest sales. We were confident it was going to be bigger than anything The Beatles had done. But, there was no single. The record died on us.&quot; he said. Against this view, one could argue that the album still sold well, managing two top 30 hits, a top 3 placing on the US charts and a platinum certification. &quot;Strange Days&quot; certainly did nothing to derail the overall success of the Doors, as demonstrated the next year by their chart-topping Waiting for the Sun album.\n\n&quot;Strange Days&quot; partially consists of songs that did not make it onto their debut album. This album imposes an eerie, bizarre feeling, containing some of The Doors' most psychedelic songs. It includes songs such as &quot;Strange Days&quot;, &quot;People Are Strange&quot;, &quot;Love Me Two Times&quot; and &quot;When the Music's Over&quot;. The latter is an epic poem that is comparable to the famous &quot;The End&quot;.\n\nThe album also includes &quot;Moonlight Drive&quot;, which was one of the first songs written by Jim Morrison for The Doors. The song was recorded in 1965 (demo) and 1966 (intended for their first album). In 1967 a final version was recorded and released on this album.\n\nThe album was #3 in the US in 1967, and is #407 on Rolling Stone's 500 Greatest Albums of All Time. &quot;People Are Strange&quot; shot to #12 on the US chart, and &quot;Love Me Two Times&quot; followed it, going to a, for a second single, more than respectable #25, thus proving The Doors' staying power after the runaway success of their debut.\n\nThe cover photo was taken in Sniffen Court, a small residential mews in New York City. Jim Morrison refused to appear on the cover, so photographer Joel Brodsky decided to use a circus-like photograph for the cover image. However, most carnivals were out on summer tours so it was a struggle for Brodsky to find professional circus performers. The acrobats were the only ones he could find; the dwarf Lester Janus and his younger brother (not twins) Stanley Janus (who appeared on the back cover) were hired from an acting firm; the juggler was Brodsky's own assistant; the trumpet player was a taxi driver; and the strongman was a doorman at a club. On another note, the back cover depicts a robed man standing in one of the house doorways looking down at one of the dwarf brothers. This robed man was a friend of Joel Brodsky's wife. In addition to this, the original idea for the front cover was a reflection of the group in a mirror which the dwarves would carry. Jim Morrison stated that he did not want to be on the cover at all, so a poster of the band members was discretely shown on the right end of the sleeve.  A re-created music video was shot in the eighties for the title track, and featured a still of the cover photo. The dwarf, juggler and acrobat (female for the video) came to life and moved out of the photo, while the other three performers remained where they were. The circus trio then explore New York City and join various crowds. This is mixed with footage for the original music video of the song &quot;Strange Days&quot;. At the end of the video, the dwarf, juggler and acrobat move back into the photo and resume the poses that are seen on the cover photo.\n\n-------------------------------------------------------------------------------\nSTRANGE DAYS\n\n&quot;Strange Days&quot; is the leadoff title track to the Doors' second album. The band was hard-pressed to beat the huge commercial and critical success of its debut record released earlier the same year, but managed to follow with a surprisingly strong group of songs, many of them drawn from the same pool of material written around the same time as The Doors. This song combines sinuous rhythms with Jim Morrison's unique poetic visions and an unconventional arrangement that contains an instrumental chorus.\n\nRay Manzarek opens the track with a descending organ riff to which session musician Doug Lubhan adds a snaking bass line to John Densmore's tribal, tom-heavy drum beat. Guitarist Robbie Krieger coaxes light shimmering notes from his guitar as Morrison sings his quixotic brew of poetics in somber tones, his voice simultaneously overdubbed with an echoing, telephonic effect giving the song a psychedelic flavor. Morrison seems to be pondering the state of the then emerging hippie youth culture and how they are perceived by mainstream or &quot;straight&quot; society, &quot;Strange days have found us/Strange days have tracked us down/They're going to destroy/Our casual joys/We shall go on playing/Or find a new town.&quot; The end of the verse builds to a climax, the chords rising with Morrison's voice before the tension is released, Morrison letting out a &quot;Yeah!&quot; as the band pounds out a straight-ahead rhythm, Densmore's cracking snare drum and Manzarek's pulsing organ rocking out as Lubhan lets fly with a series of quick flowing bass runs during the second chorus break. The forward momentum is maintained for the final verse, Densmore staying with the straight rock groove as Morrison opens up his vocal, reaching for higher notes with increased conviction as he extols, &quot;Bodies confused/Memories misused/As we run from the day/To a strange night of stone.&quot;\n\n&quot;Strange Days&quot; still gets an occasional airing on classic rock radio, but has not proved to have the staying power of some of the other Doors hits and album tracks from Strange Days, such as &quot;Love Me Two Times&quot; and &quot;People Are Strange.&quot; \n\nYOU'RE LOST LITTLE GIRL\n\n&quot;You're Lost Little Girl&quot; is a delicately haunting ballad from the Doors' second album, Strange Days, a well-crafted song, blending a beautifully rendered vocal melody by Jim Morrison with subtly textured musical backing. The Doors display an ability to gracefully range from minimalist mood piece to light-tempered rock in their own inimitable style all within a standard three-minute pop song.\n\nBeginning with a creeping bass line and a gently chiming circular guitar riff from Robbie Krieger, singer Jim Morrison sets the tone with a somber intro vocal, beautifully crooning, &quot;You're lost little girl/You're lost little girl/You're lost/Tell me who/Are you?&quot; The drums kick in for the chorus with a light, straight beat as Morrison's vocals rise with emotion, singing, &quot;I think that you know what to do/Impossible?/Yes, but it's true,&quot; Ray Manzarek adding texture with his organ. The groove lurches into a staccato break for the third line of the chorus, the band accenting each chord in unison as Morrison draws out the line &quot;I think that you know what to do, yeah&quot; with stately conviction. Krieger contributes a delicately smooth guitar solo, milky soft notes floating above the music. The song gently builds through the last chorus, Densmore and company leaning into their instruments, Morrison repeating the chorus with increased fervor, until giving way once again to the song's haunting intro for the close. \n\nLOVE ME TWO TIMES\n\nOne of the Doors' most accessible singles, this song's shelf life was drastically cut after Jim Morrison's first controversial bust at a New Haven concert. Either way, it's a classic example of the band at their peak. Built on a bluesy and inventive Robbie Kreiger guitar riff, the song swings with an infectious, dark bounce that at once defines the band and also is radio friendly. Lyrically, it has fairly strong sexual overtones, but it's also not offensive in any way, either. Ray Manzarek's brilliant harpsichord solo is one of the recording's highlights, and it is easily one of his best solos, ever. \n\nMOONLIGHT DRIVE\n\n&quot;Moonlight Drive&quot; is one of the Doors' earliest original compositions. Ray Manzarek claims this to be one of the songs Jim Morrison sang to him when they first met on a beach in Los Angeles before the group's conception. The song was even recorded on the group's earliest demo recordings at Trans World Pacific Studios on September 2nd of 1965, before Robbie Krieger had joined the band, Manzarek doubling on keyboards and guitar. The song was also part of the group's earliest live sets, usually played in a much longer form, clocking in at over six minutes, but for some reason the song was not recorded for the group's smash hit debut album, The Doors, and did not surface until it was released as an album track on the follow-up LP, Strange Days, as well as a B-side to the &quot;Love Me Two Times&quot; single, released in November of 1967.\n\nThe studio version was shorted to a tighter three minutes and is marked by the addition of Robbie Krieger's silky slide guitar work, laying down long rising and descending notes. The music is centered on the funky, staggered jounce of Ray Manzarek's piano, supported by the slight martial tap and roll of John Densmore's snare drum. Morrison gives his rather cosmic lyrics a sensuous, inviting character as he languishes in deep tones, &quot;Let's swim to the moon/Let's climb through the tide/Penetrate the evening/That the city sleeps to hide.&quot; The band kick into the full, mid-tempo groove with a quick three-chord accent, Morrison picking up on the increase energy, his voice opening up as he reaches deeper for the notes, &quot;Surrender to the waiting worlds/That lap against our side/Nothing left open/And no time to decide/We've stepped into a river/On our moonlight drive.&quot; Krieger contributes an expertly played slide guitar solo, slinking and weeping notes emanating from his instrument, deftly playing off the vocal melody. Momentum continues to rise, the band stomping more heavily through the last verse. Morrison reaches new levels of intensity, his voice transforming into a harsh shout as he belts out the final lines, &quot;It's easy to love you/As I watch you glide/We're falling through wet forests/On our moonlight drive.&quot; As the track slowly fades, Morrison begins to ad-lib, mumbling close on the microphone, &quot;Come on, baby gonna take a little ride/Goin' down by the ocean side/Gonna get real close/Get real tight/Baby gonna drown tonight/Goin' down, down, down.&quot;\n\n\nPEOPLE ARE STRANGE\n\n&quot;People Are Strange&quot; was the first single released from the Doors' second album, Strange Days, in the autumn of 1967. The song reflects the group's fascination with the theatrical music of European cabaret, particularly Bertolt Brecht's edgy Three Penny Opera, from which the Doors would later cover &quot;Alabama Song.&quot;\n\n&quot;People Are Strange&quot; is a brief two minutes, opening with just guitar and vocals, Robbie Krieger playing a clean picked intro as Jim Morrison delicately sings a lament of the societal outcast: &quot;People are strange when you're a stranger/Faces look ugly when you're alone/Women seem wicked when you're unwanted/Streets are uneven when you're down&quot; The full band then comes in, Ray Manzarek setting the tone with his bouncing barrelhouse piano, Krieger adding short rhythmic chords to the throbbing two-note bass line. Morrison keeps the atmosphere light and spooky with a short echo effect on the vocals as he relates his tale of the outsider, the word &quot;strange&quot; most likely having various connotations, like the general disregard of &quot;hippie&quot; culture at the time or perhaps merely the hallucinatory effects of LSD: &quot;When you're strange/Faces come out of the rain/When you're strange/No one remembers your name/When you're strange.&quot; Both Krieger and Manzarek manage to squeeze in brief solos as the whole verse and chorus are repeated a second time with the whole band playing together. The song abruptly ends on a strange, off-kilter guitar chord while Morrison softly croons, &quot;When you're strange.&quot; \n\n\nWHEN THE MUSIC'S OVER\n\n&quot;When the Music's Over&quot; was one of the Doors' early live staple songs designed as a set closer in the extended epic mode of the band's more famous showstopper, &quot;The End.&quot; The song's final words are in fact &quot;the end!&quot; While &quot;The End&quot; explored various mythologies and Jim Morrison's take on the Oedipal complex, &quot;When the Music's Over&quot; combines ecological issues with Morrison's fascination with improvisational, or even confrontational, theater in an attempt to ignite action amongst the sizable youth culture movement of the 1960s.\n\nOver the course of nearly 11 minutes, the group explores various mood shifts and intuitive interaction between the band and Jim Morrison's improvisational theatrics. Straightforward beginning and end sections anchor the song's otherwise loose structure. The music is centered on the simple alternating throb of a two-note bass line, to which guitarist Robbie Krieger and keyboardist Ray Manzarek are free to play off of, adding and subtracting small themes and various runs throughout the song. The band responds to Morrison's ranting, coming down hard on select words to dramatically accent their meaning, &quot;The face in the mirror won't stop,&quot; bang, &quot;The girl in the window won't drop,&quot; boom, boom, &quot;A feast of friends -- 'Alive!' she cried/Waiting for me/Outside!&quot; After extensive solo sections, the music is stripped down to the soft pulse of Manzarek's organ bass notes, the other musicians adding various interpretations of Morrison's words with their respective instruments as Morrison laments the current state of the planet after the abuses of previous generations, &quot;What have they done to the earth?/What have they done to our fair sister?/Ravaged and plundered/And ripped her bit her/Stuck her with knives/In the side of the dawn/And tied her with fences/And dragged her down.&quot; The music explodes when Morrison finally releases the tension with a blood-curdling scream as he declares, &quot;We want the world and we want it now/Now?/Now!!!&quot; He then testifies, &quot;Persian night!/See the light!/Save us! Jesus!/Save us!&quot; as the band hammers away in a go-for-broke jam, eventually pounding out the notes in unison, much like a musical device used in the band's biggest hit, &quot;Light My Fire.&quot; The arrangement returns to the more structured part of the song as order is once again restored before a big finish, the band holding yet another dramatic pause as Morrison screams the final lines, &quot;Until the end!&quot;\n\nAlthough the Doors could be accused of overindulgent bombast, &quot;When the Music's Over&quot; taken in historical context seems an earnest attempt at breaking the traditional pop song mold by addressing the issues of the day in a noble struggle to treat music as serious art and a conveyer of true political statement.\n\n\nUNHAPPY GIRL (from wikipedia)\n\nAccording to No One Here Gets Out Alive, Ray Manzarek had to play the entire song backwards when recording it, while drummer John Densmore played backwards high-hat in order to get the sound right.\n\n\nHORSE LATITUDES (from wikipedia)\n\nThe song is a spoken word piece by Jim Morrison with the band providing frightening noises similar to a Satanic ritual as a backdrop. Morrison screams the lyrics, telling of a ship at sea forced to jettison the onboard horses to lighten their load. The words are taken from one of the first poems Jim Morrison ever wrote, inspired by a book cover he saw at a local bookstore as a child.\n\nSeveral of the references in this set of lyrics seem to be metaphors for ejaculation and the spurt of semen as they are &quot;jettisoned&quot;, i.e &quot;Currents breed tiny monsters&quot;, &quot;...Awkward instant...and the first animal is jettisoned,legs furiously pumping...&quot;\n\nKeyboardist Ray Manzarek mentions in his book Light My Fire he never believed Morrison wrote &quot;Horse Latitudes&quot; at such a young age, claiming the words were &quot;too mature&quot;.\n\n\nThis song often segued into Moonlight Drive, or vice versa, which follows it on the album.\n\n\nMOONLIGHT DRIVE (from wikipedia)\n\nAlthough it was not released as a single, like &quot;Love Me Two Times&quot; and &quot;People Are Strange&quot;, it is a favorite in The Doors canon. Though a conventional blues arrangement, &quot;Moonlight Drive&quot;'s defining feature was its slightly off-beat rhythm and, most significantly, Robbie Krieger's 'Bottle-neck' guitar which creates a slightly eerie sound.\n\nThe song is most known to fans as being one of the first written by lead singer and primary songwriter Jim Morrison. According to the Morrison biography No One Here Gets Out Alive by Jerry Hopkins and Danny Sugerman, Jim wrote it (as &quot;Moonlight Ride&quot;) during his halcyon days on a rooftop in Venice Beach, a suburb of Los Angeles, California in 1965. Later on, when he met with fellow band member Ray Manzarek, he uttered the memorable lines, &quot;Let's swim to the moon, let's climb through the tide, penetrate the evening that the city sleeps to hide.&quot; Reportedly, due to hallucinogens or otherwise, Ray was impressed. Hence, in many ways, the song &quot;Moonlight Drive&quot; helped crystallise the nexus of The Doors.\n\nThe song's meaning is open to interpretation. Jim himself (who said he 'heard' the song as part of a rock concert in his head) stated it was about reaching out into the unknown. Superficially, it concerns a 'Moonlight Drive', but is rich with symbolism and imagery. It appears to be a love song, but the last few lines during the fade out seem to imply that the drive ends with murder:\n\n&quot;Come on baby, gonna take a little ride\nDown, down by the ocean side\nGonna get real close\nGet real tight\nBaby gon' drown tonight, drown drown drown&quot;\n\nRecordings of live performances of this song reveal the certain link with death by drowning - whether murder, suicide or simply going too far. Jim sings in live performances, probably improvising, referring to &quot;fishes for your friends&quot; and &quot;pearls for your eyes&quot; painting an image of a rotten corpse lying at the bottom of the ocean.\n\nThe song was featured in the film &quot;Two-Lane Blacktop&quot;. In addition, its title is also used as the name of professional wrestler John Hennigan's corkscrew neckbreaker finishing move under his Jim Morrison-esque John Morrison character.\n\nThe song was also featured in the film Less Than Zero\n\n-------------------------------------------------------------------------------\nInfo taken from allmusicguide and wikipedia\n-------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:0106176e526906a0d220d6ca478b0b215dc54157","amp;dn":"The+Doors+-+Strange+Days+%28Perception+Remaster%29+%5BEAC-FLAC%5D+%5BRePoP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0106176e526906a0d220d6ca478b0b215dc54157","infoHashBuffer":{"type":"Buffer","data":[1,6,23,110,82,105,6,160,210,32,214,202,71,139,11,33,93,197,65,87]},"announce":[],"urlList":[]}}