{"title":"Nanocrystalline Metals and Oxides","uid":15519363,"size":9507918,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:020c38665de50e979304f3bce6b171b71204f21f&amp;dn=Nanocrystalline+Metals+and+Oxides&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1470731596,"description":"Nanocrystalline Metals and Oxides - Selected Properties and Applications - Philippe Knauth, Joop Schoonman (Kluwer, 2002).pdf\r\n\r\nNanostructured materials have at least one dimension in the nanometer range. They became a very active research area in solid state physics and chemistry in recent years with anticipated applications in various domains, including solar cells, electronics, batteries and sensors.\r\n\r\nNanocrystalline metals and oxides are dense polycrystalline solids with a mean grain size below 100 nm. This book is intended to give an overview on selected properties and applications of nanocrystalline metals and oxides by leading experts in the field. The first three chapters provide a very complete theoretical treatment of thermodynamics and atom/ion transport for nanocrystalline materials. The following chapters are experts' views on the development of experimental characterization techniques for nanocrystalline solids with emphasis on electroceramic materials.\r\n\r\nNanocrystalline Metals and Oxides is intended for a broad range of readers, foremost chemists, physicists and materials scientists. Theoretical physicists and chemists will certainly also profit from this book. The electroceramics and solid state ionics community are particularly addressed, given the main interests of the editors","torrent":{"xt":"urn:btih:020c38665de50e979304f3bce6b171b71204f21f","amp;dn":"Nanocrystalline+Metals+and+Oxides","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"020c38665de50e979304f3bce6b171b71204f21f","infoHashBuffer":{"type":"Buffer","data":[2,12,56,102,93,229,14,151,147,4,243,188,230,177,113,183,18,4,242,31]},"announce":[],"urlList":[]}}