{"title":"Antivirus for Windows Vista and Windows Xp.... the best","uid":3962761,"size":26632081,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:024396da33b0e10e03f9c8166adc827cf38d33b9&amp;dn=Antivirus+for+Windows+Vista+and+Windows+Xp....+the+best&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"stefansz","files":3,"time":1199553296,"description":"Sophos Anti-Virus is the best security solution for both Windows Vista and Windows XP Service Pack 3. \n\nAt the beginning of February 2007, following the release of Windows Vista to the general public, Sophos Anti-Virus also received the VB100 award ahead of Microsoft and McAfee. But while the February 2007 tests were focused on Windows Vista, the June rankings turn back to XP SP2.\n\n&quot;Sophos Anti-Virus for Windows XP performed impressively during the tests with its simple installation, in-depth configuration options and excellent detection rates,&quot; said John Hawes, technical consultant at Virus Bulletin. &quot;By protecting against all the in-the-wild viruses without false positives, Sophos earns itself another VB100 award.&quot;\n\nOther security developers that managed to get the VB100 award for XP SP2 are Symantec, Microsoft, Trend Micro, McAfee, GDATA, BitDefender (SOFTWIN) and Avira. The biggest names that failed the VB100 tests are Kaspersky and F-Secure. \n\nSophos beats McAfee and Symantec in an independent product review\n\nSophos outperformed Symantec and McAfee in installation and deployment, usability and management, scanning performance and effectiveness against day-zero threats. It matched Symantec and beat McAfee in basic effectiveness, and was rated the best endpoint security product in the review overall.\n\n\nSophos Anti-Virus is an anti-virus, anti-spyware and HIPS software program by Sophos plc, which is aimed primarily at corporate environments. Centralised management is performed via Sophos Enterprise Console. It is believed to be the Anti-Virus used by Gmail[1].\n\nThe SAV Interface software development toolkit allows software developers to integrate the Sophos virus detection engine in their applications in C, Perl, Python, Java, C#, .NET, VBScript or C++.\n\n\n\nDeveloper: \tSophos\nLatest release: \t7 / June, 2007\nOS: \tMicrosoft Windows, GNU/Linux, Novell NetWare, Mac OS X, VMS, FreeBSD, Solaris, AIX, HP-UX, SCO OpenServer/UnixWare and Tru64.\nGenre: \tanti-virus\nLicense: \tProprietary\nWebsite: \twww.sophos.com\n\n\nThis is a full vresion of sophos with serial to update for 30 days!!\nif wanna get more days for update make your account on  \twww.sophos.com!\nyou will never find cracked or whatever\nif you like it buy it!!\n\n\n\n\n\n\n\n\n\nFor more info visit: &lt;a href=&quot;\nhttp://www.softek.co.uk/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.softek.co.uk/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.sophos.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sophos.com/&lt;/a&gt;\n\n*ENJOY*\n","torrent":{"xt":"urn:btih:024396da33b0e10e03f9c8166adc827cf38d33b9","amp;dn":"Antivirus+for+Windows+Vista+and+Windows+Xp....+the+best","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"024396da33b0e10e03f9c8166adc827cf38d33b9","infoHashBuffer":{"type":"Buffer","data":[2,67,150,218,51,176,225,14,3,249,200,22,106,220,130,124,243,141,51,185]},"announce":[],"urlList":[]}}