{"title":"Forced - Volume II","uid":8894341,"size":42538595,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:028e59f2694bf220412f06ece6cc071611f7ca2a&amp;dn=Forced+-+Volume+II&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Baphom3t","files":5,"time":1378664621,"description":"Forced is a powerful three piece hailing from Brooklyn, NY. Playing an aggressive blend of doom, black metal and hardcore the band side steps well worn genre confines forging their own unique approach to extreme music. The band's lyrics draw from obscure realms of philosophical, social and political thought, matching their overall sonic aesthetic with a thoughtful, but just as crushing, overall worldview. Intense, purposeful, and unrelenting.\n\nForced is:\nScott Brown - Vocals/Guitar\nDave Friedrich - Bass/Vocals\nMike Hegarty - Drums\n\nReview:\nI missed these guys the last time they came through my town and I've been kicking my self in the ass ever since. Their first release called Accursed Share was sick as all fuck, but listening to Volume II makes me kick myself harder than before. Volume II is drenched with a blackend sludgetastic hardcore feel that gives one that warm fuzzy feeling inside. The band has grown into their own with this release proving they are a force to be reckoned with. Solid riffage and the right amount of skull smashing. The blackened feel blasts through the album and the hardcore intensity is prevelant in every song. They have a way of mixing black, sludge and hardcore unlike any other band which is Forced upon the listener in a bombardment of audio ear rapage.\nThis is a release not to be missed.\n\nReview by Uploader\n","torrent":{"xt":"urn:btih:028e59f2694bf220412f06ece6cc071611f7ca2a","amp;dn":"Forced+-+Volume+II","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"028e59f2694bf220412f06ece6cc071611f7ca2a","infoHashBuffer":{"type":"Buffer","data":[2,142,89,242,105,75,242,32,65,47,6,236,230,204,7,22,17,247,202,42]},"announce":[],"urlList":[]}}