{"title":"Girl Culture - What it means to be a Girl in Society","uid":4112776,"size":4360033,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:02eb29e0d52a351cc91ac2f7429aa10e97b96399&amp;dn=Girl+Culture+-+What+it+means+to+be+a+Girl+in+Society&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Intelligence","files":1,"time":1207151593,"description":"Claudia A. Mitchell, Jacqueline Reid-Walsh - Girl Culture\n\n[IMG]http://img225.imageshack.us/img225/3608/515x333zrqljpgorigiu7.jpg[/IMG] \n\nNever before has so much popular culture been produced about what it means to be a girl in today&amp;#039;s society. From the first appearance of Nancy Drew in 1930, to Seventeen magazine in 1944 to the emergence of Bratz dolls in 2001, girl culture has been increasingly linked to popular culture and an escalating of commodities directed towards girls of all ages. Editors Claudia A. Mitchell and Jacqueline Reid-Walsh investigate the increasingly complex relationships, struggles, obsessions, and idols of American tween and teen girls who are growing up faster today than ever before. From pre-school to high school and beyond, Girl Culture tackles numerous hot-button issues, including the recent barrage of advertising geared toward very young girls emphasizing sexuality and extreme thinness. Nothing is off-limits: body image, peer pressure, cliques, gangs, and plastic surgery are among the over 250 in-depth entries highlighted. Comprehensive in its coverage of the twenty and twenty-first century trendsetters, fashion, literature, film, in-group rituals and hot-button issues that shape--and are shaped by--girl culture, this two-volume resource offers a wealth of information to help students, educators, and interested readers better understand the ongoing interplay between girls and mainstream culture. Entries include: BLAnorexia BLBarbie BLBeauty Pageants BLBikini BLBody Modification BLBlogging BLCheerleading BLChick Lit BLGirl Bands BLGirls and Hip Hop BLgURL.com BLHello Kitty BLJennifer Lopez BLLolita BLMadonna BLPretty in Pink BLProm BLReviving Ophelia BLRiot Grrrls BLSweet Sixteen BLWonder Woman Features: BLContains over 250 entries written by interdisciplinary scholars, practitioners, and young women themselves. BLEmphasizes multiculturalism BLServes as a unique reference for students of American history and culture BLAn extensive bibliography of print and electronic sources BLEnhanced by numerous illustrations\n","torrent":{"xt":"urn:btih:02eb29e0d52a351cc91ac2f7429aa10e97b96399","amp;dn":"Girl+Culture+-+What+it+means+to+be+a+Girl+in+Society","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02eb29e0d52a351cc91ac2f7429aa10e97b96399","infoHashBuffer":{"type":"Buffer","data":[2,235,41,224,213,42,53,28,201,26,194,247,66,154,161,14,151,185,99,153]},"announce":[],"urlList":[]}}