{"title":"Age of Civilizations FULL v1.153 APK","uid":13107333,"size":95484120,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:030a66a2aa689ef3cecd94c189275820049d2a2d&amp;dn=Age+of+Civilizations+FULL+v1.153+APK+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tiropitaki","files":4,"time":1451345165,"description":"Including separated apks for Europe, Americas and Asia\r\n\r\n• Maps:\r\n- Earth | [342 Provinces]\r\n- Kepler-22b | [404 Provinces]\r\n\r\n• Orders are submitted before each round. The number of orders you can submit during each round is limited by your Movement Points for that round.\r\n• After orders are submitted, civilizations execute actions in turn order, which is randomized at the start of each round.\r\n\r\n• Map\r\n- The capital is the most important province in a civilization. If you lose your capital for 3 turns, your civilization will no longer exist. If you capture another civilization’s capital, you obtain all of its provinces. Capitals have a defensive bonus: +15% and an offensive bonus: +15%. Capitals have all buildings already constructed.\r\n- Transparent provinces are neutral. Provinces with color belong to other civilizations.\r\n- You can scale the map. To go back to the standard scale, double tap the map. If scale is other than standard on minimap you can see '!' in top right.\r\n- Use the Economy and Population buttons to view each province’s Economy and Population values. Use the diplomacy button to view each province’s owner and engage in diplomacy (see Orders- Diplomacy View).\r\n\r\n• Treasury\r\n- Money is added to your treasury through income tax, which is based off your civilization’s total population and economy. Money is subracted from your treasury for military upkeep, which is based off your amount of military units (units at sea have a higher upkeep than units on land).\r\n\r\n• Orders - Normal View\r\n- Move: move units from one province to another. You can move between provinces you control or attack another civilization’s province.\r\n- Recruit: recruit units from the selected province. This costs money and is limited by the population of the province. Recruiting from a province reduces its population.\r\n- Build: construct a building in the selected province (see Building Types). This costs money.\r\n- Disband: remove units from the selected province. This decreases military upkeep.\r\n- Vassal: creates a vassal state with another civilization.\r\n- Annex: brings a vassal state back under your full control.\r\n\r\n• Orders - Diplomacy View\r\n- War: declare war on a civilization.\r\n- Peace: submit a peace offer to a civilization. If accepted, your civilizations will no longer be at war.\r\n- Pact: submit a pact offer to a civilization. If accepted, the civilizations cannot attack each other for five rounds. This can be canceled through a War order one round in advance.\r\n- Alliance: submit an alliance offer to a civilization. If accepted, that civilization will aid you in your military efforts. Use the War order to let allies know who your targets are.\r\n- Kick: end an alliance with a civilization.\r\n- Support: give money to a civilization.\r\n\r\n• Building Types\r\n- Fort: gives a province a defense bonus.\r\n- Watch tower: allows you to see army numbers in neighboring provinces.\r\n- Port: allows units to move into the sea. Units at sea can move back onto any land province, even if it doesn’t have a port.\r\n\r\n• 186 Civilizations\r\n• Vassals\r\n• Offline and Online achievements\r\n• Offline and Online Hall of Fame\r\n• Google Play Game Services leaderboards and achievements!\r\n• Random placment\r\n• Random fill\r\n• Random games\r\n\r\n• Scenarios:\r\n- Modern world\r\n- Modern world Full\r\n- World war I\r\n- World war I Full\r\n- World war II\r\n- World war II Full\r\n- Custom scenarios!\r\n\r\n• Three different types of fog of war:\r\n- Off\r\n- Standard\r\n- Full\r\n\r\n• Tutorial\r\n\r\n• Available languages\r\n- English\r\n- Deutsch\r\n- Polish\r\n- Russian\r\n- 中文 \r\n\r\nWhat's in this version : (Updated : Dec 23, 2015)\r\n•\tProvince names\r\n•\tNew scenario: World War II - 1942 made with a fan, Jim K.\r\n•\tNew: Sandbox mode\r\n•\tNew: Borders\r\n•\tNew: Colour of Civilization\r\n•\tNew: Army view instead of Economy view\r\n•\tNew language: Português\r\n•\tNew language: Čeština\r\n•\tScale of achievements\r\n•\tNew language: Nederlands\r\n•\tNew language: العربية\r\n•\tNew language: Italiano\r\n•\tUser can select Civilization in the Random Game mode.\r\n•\tNew: Random Game -&gt; Civilization\r\n•\tNew language: 日本語\r\n•\tNew language: Français\r\n•\tAI improvements: Diplomacy\r\n•\tNew language: 한국어\r\n•\tNew:Landscape mode\r\n\r\nRequired Android O/S : 2.3+","torrent":{"xt":"urn:btih:030a66a2aa689ef3cecd94c189275820049d2a2d","amp;dn":"Age+of+Civilizations+FULL+v1.153+APK+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"030a66a2aa689ef3cecd94c189275820049d2a2d","infoHashBuffer":{"type":"Buffer","data":[3,10,102,162,170,104,158,243,206,205,148,193,137,39,88,32,4,157,42,45]},"announce":[],"urlList":[]}}