{"title":"Astral Dynamics - A New Approach To Out-Of-Body Experiences","uid":4145029,"size":3621331,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:05065ae99004b6c55de404ee4cd15efaf4c11e2d&amp;dn=Astral+Dynamics+-+A+New+Approach+To+Out-Of-Body+Experiences&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Theli93","files":6,"time":1208690489,"description":"Robert Bruce has enjoyed spontaneous out-of-body experiences since childhood. As an adult, he learned how to project himself into the astral realm at will. He combines his experiences and more than twenty-five years of research in his newest book, Astral Dynamics: A NEW Approach to Out-of-Body Experience. NEW is capitalized because it stands for New Energy Ways, a technique for raising energy that Bruce developed. Projecting oneself from one\\\\\\&amp;#039;s body requires high energy levels, and Bruce devotes significant portions of the book to energy skills. He emphasizes that persons who project themselves do not leave behind an \\\\\\&quot;empty body\\\\\\&quot; that can be harmed. Instead, \\\\\\&quot;one full copy of thinking mind and memory--conscious and subconscious--stays at all times within the bounds of the physical body. . .this original or master copy never leaves the bounds of the physical body while it still lives.\\\\\\&quot; Nevertheless, it is important to prepare oneself first and establish a good foundation for safety before attempting an out-of-body projection. Bruce provides very detailed instructions for each step. Although most projectors have positive experiences, occasionally something negative can happen. He describes all these potential problems and how to overcome them. He also describes all the wonderful things that projectors can see while out of their bodies. Projectors can pass through solid objects, like walls. They can travel to the house next door or to galaxies beyond this one. They can search the Akashic Records. Advanced projectors can visit the spirit worlds. There doesn\\\\\\&amp;#039;t seem to be any limit on where projectors can go or what they can do. Bruce says that \\\\\\&quot;consciously projecting out of body is nowhere as difficult as commonly believed. It is simply a matter of deeply relaxing the physical body, clearing the mind, then triggering the projection reflex with an exit technique.\\\\\\&quot; He describes all the skills needed and provides exercises for developing those skills. After that, it\\\\\\&amp;#039;s simply a matter of practicing until you\\\\\\&amp;#039;re successful. He says his primary goal is \\\\\\&quot;to create a user-friendly, readable and useful tutorial, guide, and reference work for all who aspire to travel out of their bodies.\\\\\\&quot; Readers of Astral Dynamics will find that his book easily meets that goal. \n","torrent":{"xt":"urn:btih:05065ae99004b6c55de404ee4cd15efaf4c11e2d","amp;dn":"Astral+Dynamics+-+A+New+Approach+To+Out-Of-Body+Experiences","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05065ae99004b6c55de404ee4cd15efaf4c11e2d","infoHashBuffer":{"type":"Buffer","data":[5,6,90,233,144,4,182,197,93,228,4,238,76,209,94,250,244,193,30,45]},"announce":[],"urlList":[]}}