{"title":"Tamed Teens #5 (2008) - anal, DP, rough sex","uid":4482953,"size":1477491285,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:0580d317b6f56dcd2d94a1a7309f245a945a30de&amp;dn=Tamed+Teens+%235+%282008%29+-+anal%2C+DP%2C+rough+sex&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"phaedrae","files":102,"time":1225646593,"description":"Tamed.Teens.5.XviD-SWE6RUS\n\n\n\n\n\nscreens CD1 &amp; CD2 + DVD-covers:\n &lt;a href=&quot;\nhttp://pixxx.blogbugs.org/4112959/Tamed-Teens-5---screens-CD1-CD2.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://pixxx.blogbugs.org/4112959/Tamed-Teens-5---screens-CD1-CD2.html&lt;/a&gt;\n\n\n\n\n\n\nStarring:\nCarla Cox, Leanna Sweet, Nataly, Angelina Love, Kyara, Megane, Petra Pearl\n\n\nMale cast:\nFrank Gun, James Brossman, Lauro Giotto, Mike Angelo, Mugur, Titus Steel, Nick Lang, \n\n\nStory :\nRaul Cristian&amp;#039;s all-sex, distinctively shot, all-European productions have cornered a segment of the male-dominant fan base that likes to see heavily-styled bitches from Eastern Europe getting erotically abused by the Cruel Media stable of big, beefy-cocked bastards. In Raul&amp;#039;s words,these guys are the &quot;best terminators,&quot; muscular studs who completely take over their scenes, and are only matched by a parade of exceptionally beautiful sluts who surrender their asses, their personal space and their dignity for your masturbational pleasure. This edition of Tamed Teens Destiny are two ravenhaired slatterns who start off with some kissing, which arouses Lauro Giotto and Mugur to jam their veiny dicks down the girls&amp;#039; throats. The bitches get slapped and pounded, and later lick the boys&amp;#039; cum from each other&amp;#039;s face. Curly blonde Petra Pearl is a slim submissive who gets put through the Tamed Teens wringer; brutally face fucked by Nick Lang and Lauro, she has her asscheeks spanked glowing red and her pussy beaten down by hard cocks and fierce fingerbanging, and Petra drinks their goo with a satisfied smile. Last, barely-legal Hungarian blonde Kyara is sporting pigtails and a straw hat. Mugur and Titus molest her cute bubble butt outdoors and move inside for some blowjob, anal and d.p. action. The agreeable young lass happily swallows two loads of creamy man juice. is almost all about 2-guys-on-1-girl action --  these girls are so hot it takes two men to do the taming! \n(The one exception&amp;#039;s a nasty foursome in which the males and females are evenly matched.) First, busty blonde Megane takes on James Brossman and Frank Gun in a slappingly rough scene that goes from anal to double penetration and ends up with two cumloads in the lady&amp;#039;s mouth. Nataly is blackhaired young&amp;#039;un in a cute skimpy outfit who teases Raul and his camera until he empties a bottle of water on her head and calls in Mike Angelo and Mugur for some harder discipline. \nShe mounts one cock and gives deepthroat to the other, and endures spitting and double-vag penetration before accepting an oral sperm treat. Pigtailed blonde Carla Cox is dressed in pink pornwear as she gets slapped and mauled by Mike and Titus Steel. Their hands make Carla&amp;#039;s pussy crazy wet, and they fuck her ass and double-penetrate her, then shoot off into her mouth. Leanna Sweet and Tamed Teens 5 contains six full sex scenes plus a bonus threeway/d.p./face fuck with blonde Angelina Love.\n\n\nGenre:  \t Anal, Double Penetration, Oral (Cumshots), Young Girls, SexSex, European, Gonzo (Crazy), Japanese Review, Nice Ass, Pretty Face, Slim,Slender, Beautiful Breast, Beautiful Pussy\n\n\n\nSWE6RUS Finest XviD\nCrew presents\nTamed Teens 5\nCompany  Evil Angel\nStreet Date  Oct 27, 2008\nSource  DVD\nSound  176 kb/s (88/ch, stereo) VBR \nBitrate  909 kb/s\nResolution  576x320\nGenre  Teen Over 18\nRuntime  178 min\n\n\n\nMore uploads: &lt;a href=&quot;\nhttp://thepiratebay.se/user/phaedrae&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/phaedrae&lt;/a&gt;\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n.","torrent":{"xt":"urn:btih:0580d317b6f56dcd2d94a1a7309f245a945a30de","amp;dn":"Tamed+Teens+%235+%282008%29+-+anal%2C+DP%2C+rough+sex","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0580d317b6f56dcd2d94a1a7309f245a945a30de","infoHashBuffer":{"type":"Buffer","data":[5,128,211,23,182,245,109,205,45,148,161,167,48,159,36,90,148,90,48,222]},"announce":[],"urlList":[]}}