{"title":"Techno-Fix - Why technology wont save us or the enviroment (Joyc","uid":8013962,"size":3631486,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:05a2617d7227bacc30fec09bfa2d8e60d19e4a7f&amp;dn=Techno-Fix+-+Why+technology+wont+save+us+or+the+enviroment+%28Joyc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"artfanty","files":-1,"time":1358064277,"description":"Torrent contains PUB and PDF\n\n\n=================Book Description===================\n\nTechno-Fix questions a primary paradigm of our age: that advanced technology will extricate us from an ever increasing load of social, environmental, and economic ills. Techno-Fix shows why negative unintended consequences of science and technology are inherently unavoidable and unpredictable, why counter-technologies, techno-fixes, and efficiency improvements do not offer lasting solutions, and why modern technology, in the presence of continued economic growth, does not promote sustainability but instead hastens collapse.\n\nThe authors explore the reasons for the uncritical acceptance of new technologies; show that technological optimism is based on ignorance and that increasing consumerism and materialism, which have been facilitated by science and technology, have failed to increase happiness. The common belief that technological change is inevitable is questioned, the myth of the value-neutrality of technology is exposed and the ethics of the technological imperative: &quot;what can be done should be done&quot; is challenged. Techno-Fix asserts that science and technology, as currently practiced, cannot solve the many serious problems we face and that a paradigm shift is needed to reorient science and technology in a more socially responsible and environmentally sustainable direction.\n\nThe authors of Techno-Fix are inside observers of the technological scene.  Educated and experienced in science and engineering, the authors deliver a highly readable, insightful and powerful critique of modern technology.\n\nThe readers of Techno-Fix will learn a number of inconvenient truths about science and technology, topics that are rarely, if ever, covered in the media or discussed among professionals. Readers will be challenged to re-examine their current worldview, their paradigms and assumptions about the so-called promises of modern technology. But they will also feel empowered and inspired by the fact that most problems confronting humanity have inherently simple, low-tech solutions.\n\nWho should read Techno-Fix? Anyone concerned about the effects of technology on society and the environment; anyone teaching or studying science, engineering, medicine, or related disciplines; anyone intending to create a better future.\n\nTechno-Fix has been endorsed by Richard Heinberg, Bill McKibben, David Suzuki, William Rees, and many other important figures in the environmental and academic community. ","torrent":{"xt":"urn:btih:05a2617d7227bacc30fec09bfa2d8e60d19e4a7f","amp;dn":"Techno-Fix+-+Why+technology+wont+save+us+or+the+enviroment+%28Joyc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05a2617d7227bacc30fec09bfa2d8e60d19e4a7f","infoHashBuffer":{"type":"Buffer","data":[5,162,97,125,114,39,186,204,48,254,192,155,250,45,142,96,209,158,74,127]},"announce":[],"urlList":[]}}