{"title":"Steady Move Pro plug-in-for-adobe priemier pro","uid":4745603,"size":5636974,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:063b8738e7b9e506c566df0ee4a1496c60b9ca0b&amp;dn=Steady+Move+Pro+plug-in-for-adobe+priemier+pro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BLACKTROY","files":1,"time":1235861133,"description":"How many times has your once-in-a-lifetime shot proved to be unwatchable at home because of camera shake? Now 2d3 comes to the rescue with SteadyMove. Using state of the art vision science techniques, the Emmy award winning development team at 2d3 have created a simple to use plug-in which produces remarkable results.\n\nSteadyMove works by studying the images to calculate the relative camera movement from one frame to the next, it then uses this to remove unwanted movement. A number of controls allow the user to specify how much movement to remove, and how smooth the final result is.\n\nHave you tried taking a hand held shot whilst walking down the street? It's hard! With SteadyMove you can adjust the controls to just take out the shake from your hand, but leave in the bounce of your step. Alternatively you can increase the smoothness control to remove the step movement too, so that the shot looks like it was shot on a professional dolly!\n\nSteadymovePRO is available as a plug-in for editing and compositing systems and software including Adobe Premiere Pro, Premiere Elements, After Effects and Discreet Combustion platforms.\n\nPlease note that SteadyMove is not compatible with Premiere Pro CS3 and remains untested in CS4\n \n\n\nSERIAL INSIDE FOLDER","torrent":{"xt":"urn:btih:063b8738e7b9e506c566df0ee4a1496c60b9ca0b","amp;dn":"Steady+Move+Pro+plug-in-for-adobe+priemier+pro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"063b8738e7b9e506c566df0ee4a1496c60b9ca0b","infoHashBuffer":{"type":"Buffer","data":[6,59,135,56,231,185,229,6,197,102,223,14,228,161,73,108,96,185,202,11]},"announce":[],"urlList":[]}}