{"title":"In.Performance.at.the.White.House.Memphis.Soul.2013.HR.HDTV.x264","uid":8408453,"size":800477446,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:080c3f038ff98a8395fb8f86d73bb1b09dc2a0d0&amp;dn=In.Performance.at.the.White.House.Memphis.Soul.2013.HR.HDTV.x264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"duranie","files":1,"time":1366856212,"description":"Barack and Michelle Obama paid tribute to Memphis soul yesterday in the latest iteration of &quot;In Performance at the White House&quot;, celebrating the Tennessee city that brought blacks and whites together through music despite segregation and racism in the 1960s. &quot;These songs get us on the dance floor,&quot; Obama said. &quot;They get stuck in our heads. We go back over them again and again. And they've played an important part in our history.&quot;\n\nAccording to the The Associated Press, Obama noted how black and whites blended soul, gospel and R&amp;B to &quot;bridge those divides, to create a little harmony with harmony.&quot; The president mentioned Booker T. Jones and Steve Cropper for their role in forming one of Memphis' first integrated bands. &quot;They weren't allowed to go to school together. They weren't always allowed to travel or eat together,&quot; said Obama. &quot;But no one could stop them from playing music together.&quot;\n\n&quot;The sound of Soulsville, U.S.A., a music that, at its core, is about the pain of being alone, the power of human connection and the importance of treating each other right,&quot; he continued. &quot;After all, this is the music that asked us to try a little tenderness. It's the music that put 'Mr. Big Stuff' in his place. And it's the music that challenged us to accept new ways of thinking with four timeless words: 'Can you dig it?'&quot;\n\nPerformers included Sam Moore of the duo Sam and Dave and American Idol Season 11 finalist Joshua Ledet taking on &quot;Soul Man,&quot; and Justin Timberlake and Cropper joining together for a rendition of Otis Redding's &quot;(Sittin' On) the Dock of the Bay.&quot; Alabama Shakes, Ben Harper, Cyndi Lauper, Charlie Musselwhite, Mavis Staples, Queen Latifah and William Bell also performed, with Latifah serving as host and Jones as bandleader. Al Green was set to perform but withdrew at the last minute after suffering a back injury.\n\nMichelle Obama also hosted a special workshop before the tribute show for students from 16 schools and organizations in Virginia, California, Memphis, New York City, Maryland, Florida and Washington D.C. The students were able to ask questions of Moore, Staples, Timberlake, Musselwhite and Harper, and got some history lessons from the first lady. Highlighting Memphis as the birthplace of Elvis Presley's rock &amp; roll and B.B. King's blues, Michelle Obama stressed the importance of the city's music. &quot;While you can hear both of those influences in Memphis soul, this music has a style and a story uniquely its own,&quot; she said.\n\nPBS will air the Memphis Soul &quot;In Performance at the White House&quot; concert on April 16th.\n\n\n","torrent":{"xt":"urn:btih:080c3f038ff98a8395fb8f86d73bb1b09dc2a0d0","amp;dn":"In.Performance.at.the.White.House.Memphis.Soul.2013.HR.HDTV.x264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"080c3f038ff98a8395fb8f86d73bb1b09dc2a0d0","infoHashBuffer":{"type":"Buffer","data":[8,12,63,3,143,249,138,131,149,251,143,134,215,59,177,176,157,194,160,208]},"announce":[],"urlList":[]}}