{"title":"Infringement Nation: Copyright Reform and the Law/Norm Gap","uid":4295814,"size":175626,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:09f5e664fa2366704d28754945e8ba4a0eaf86ad&amp;dn=Infringement+Nation%3A+Copyright+Reform+and+the+Law%2FNorm+Gap&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"keiron80","files":1,"time":1216081002,"description":"How often do you violate copyright without ever using P2P sharing for copyrighted works?   John Tehranian, University of Utah, wrote a paper asking just this question.\n\nWhat he found is stunning.  In America, just by going about your daily life - doing things we all do - from getting a tattoo to sending an email and uploading a picture, normal day-to-day things we all do every day, an average person would be liable for 4.544 BILLION dollars in damages under existing laws!\n\nExcerpt:\n&quot;By the end of the day, John has infringed the copyrights of twenty emails, three legal articles, an architectural rendering, a poem, five photographs, an animated character, a musical composition, a painting, and fifty notes and drawings. All told, he has committed at least eighty-three acts of infringement and faces liability in the amount of $12.45 million (to say nothing of potential criminal charges).50 There is nothing particularly extraordinary about John&amp;#039;s activities. Yet if copyright holders were inclined to enforce their rights to the maximum extent allowed by law, he would be indisputably liable for a mind-boggling $4.544 billion in potential damages each year. And, surprisingly, he has not even committed a single act of infringement through P2P file sharing.&quot;\n\nThe gap between the law and societal norms is massive, and they are trying to make it even more restrictive, and have with things like the DMCA, Canada&amp;#039;s proposed Bill C-61, and other legislation in the works or recently implemented around the world.\n\nThis is backwards - laws are supposed to reflect society, not the other way around, at least in a democracy.   In a dictatorship, the people are ruled by the law, in a democracy, the laws reflect the people&amp;#039;s will. \n\nDid you know - you&amp;#039;re probably a Copyright Criminal?\n\nThis 15 Page essay exposes the gap between the norm and the law and is meticulously documented and academic, not idle speculation.\n\nWell worth reading.  An eye-opener.","torrent":{"xt":"urn:btih:09f5e664fa2366704d28754945e8ba4a0eaf86ad","amp;dn":"Infringement+Nation%3A+Copyright+Reform+and+the+Law%2FNorm+Gap","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09f5e664fa2366704d28754945e8ba4a0eaf86ad","infoHashBuffer":{"type":"Buffer","data":[9,245,230,100,250,35,102,112,77,40,117,73,69,232,186,74,14,175,134,173]},"announce":[],"urlList":[]}}