{"title":"Bob Marley And The Wailers - Legend (1984) WMA320","uid":6042764,"size":220833325,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:0a37cb69144559ae53f937e62510c3ee582e0b75&amp;dn=Bob+Marley+And+The+Wailers+-+Legend+%281984%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1292431571,"description":"I grew up in Jamaica and as a teenager I can recall seeing the posters at the bus stop advertising an upcoming concert... and The Wailers were headliners. But I never truly listened to Bob untill the Live album came out. \nI remember sitting in my room one Saturday listening to the horse races on the radio, and in betweem each race the DJ would play No Woman No Cry. The words were haunting.. &quot;And I remember when we used to sit... In a Government Yard in trenchtown...&quot; The vouce and lyrics seemed magical... so simple yet so beautiful. That was about 30 years ago and I have been a fan ever since. Bob's music spoke to me personally, as it did to people all around te world. As it will speak to you once you play this album. But don't stop there... buy more... listen to songs like Concrete Jungle; Talking Blues, and Roots Rock Reggae. In fact let your next album be the Live at the London Lyceum and you will get a flavour for the infectious Bob. \n\nIf you have a Jamaican friend have him/her explain the lyrics (if needed). But regardless, just enjoy the music. Enjoy it with fans from Africa, Europe, Canada and now the USA. I saw Bob once in Tampa and was amazed at the 'good old boys' in Cowboy hats and bandanas that screamed for Bob and sang his songs. I knew then that Bob's music was truly intended for the world to love.\n\nWhen Bob died I heard the news over BBC radio. I was 20+ years old then but I cried. I had lost a good friend. Then I reached for my records and played Rastaman Chant, and cried some more when Bob sang... &quot;One bright morning when my work is over I will fly away home.&quot;, the background containing soulful conga drumming. But as the song ended I felt better.. bob's music made me feel better. Fly on BOB. And you my friend... listen to the Music on Legend and experience an upliftment... fly with Bob. Enjoy Legend! But remember there is more great Marley music awaiting you. \n\nby ROY TATUM\n\nTRACKLIST:\n\n01 - Is This Love.wma                                                           \n02 - No Woman No Cry (Live).wma                                                 \n03 - Could You Be Loved.wma                                                     \n04 - Three Little Birds.wma                                                     \n05 - Buffalo Soldier.wma                                                        \n06 - Get Up Stand Up.wma                                                        \n07 - Stir It Up.wma                                                             \n08 - Easy Skanking.wma                                                          \n09 - One Love  People Get Ready.wma                                             \n10 - I Shot The Sheriff.wma                                                     \n11 - Waiting In Vain.wma                                                        \n12 - Redemption Song.wma                                                        \n13 - Satisfy My Soul.wma                                                        \n14 - Exodus.wma                                                                 \n15 - Jamming.wma                                                                \n16 - Punky Reggae Party.wma  \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:0a37cb69144559ae53f937e62510c3ee582e0b75","amp;dn":"Bob+Marley+And+The+Wailers+-+Legend+%281984%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a37cb69144559ae53f937e62510c3ee582e0b75","infoHashBuffer":{"type":"Buffer","data":[10,55,203,105,20,69,89,174,83,249,55,230,37,16,195,238,88,46,11,117]},"announce":[],"urlList":[]}}