{"title":"NBA Elite 11 [PS3]","uid":6591626,"size":4575071279,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:0aaadacd1d8ed32d318f2453515fa74f045ebd21&amp;dn=NBA+Elite+11+%5BPS3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thenoobish","files":-1,"time":1312850228,"description":"Language: English\n\nEA changes the game with NBA Elite, a reinvented brand of basketball that aims to revolutionize how gamers take to the court. The game introduces several significant gameplay changes that center around user control. 'Hands-On Control' scheme allows for one-to-one responsiveness of a player's movement and actions on the court, as opposed to traditional predetermined animations that require users to wait while a scenario played out before making the next move. Hands-on Control applies to everything within a player's offensive and defensive arsenal, including: dribble moves, dunks, drives to the basket, fadeaways, mid-air adjustments, blocks, steals and more.\n\nThe real-time physics system in NBA Elite 11 allows each player on the court to move independently of one another, removing the two-man interactions that have long taken the user control out of basketball simulation videogames. In addition, a skill-based shooting system requires accurate user input, based on a player's position on the court, versus the randomly generated dice rolls that have driven shooting in basketball videogames in the past.\n\nThe game also comes bundled with a one-time download code for a customized version of the 2010 edition of NBA Jam, created as a bonus for NBA Elite buyers and featuring high-definition visuals.","torrent":{"xt":"urn:btih:0aaadacd1d8ed32d318f2453515fa74f045ebd21","amp;dn":"NBA+Elite+11+%5BPS3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0aaadacd1d8ed32d318f2453515fa74f045ebd21","infoHashBuffer":{"type":"Buffer","data":[10,170,218,205,29,142,211,45,49,143,36,83,81,95,167,79,4,94,189,33]},"announce":[],"urlList":[]}}