{"title":"Skye's Legacy 03 - Besieged - Bertrice Small.epub","uid":9501323,"size":406201,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0b29d844de593c53b72752273679ab239ff3bab8&amp;dn=Skye%27s+Legacy+03+-+Besieged+-+Bertrice+Small.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"taylorman","files":1,"time":1390236102,"description":"Skye's Legacy continues... With her fiery red hair and proud beauty, Lady Fortune Lindley has no lack of suitors. William Devers is an ideal match--wealthy, well-favored, and eager to have this free-spirited creature as his wife. But it's William's disinherited brother, Kieran--ruggedly handsome and dangerous as sin--who sets Fortune's senses reeling. Caught between the desires of two very different brothers, Fortune ignites both passion and revenge, and discovers a destiny that tests her will to claim a new land, and the one man she will love forever..... &quot;Only someone of Ms. Small's caliber could create such a marvelous sensual read...Besieged does just what the very best of historical romance should do: educate, stimulate, and arouse.&quot; Bertrice Small is the bestselling author of many award-winning historical romances, including her Skye O'Malley series. A New York Times, USA TODAY, and Publishers Weekly bestselling author, she has over fifteen million books in print and has also contributed to the bestselling Brava anthologies, Captivated and Fascinated. She lives with her husband in Southhold, New York.","torrent":{"xt":"urn:btih:0b29d844de593c53b72752273679ab239ff3bab8","amp;dn":"Skye%27s+Legacy+03+-+Besieged+-+Bertrice+Small.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b29d844de593c53b72752273679ab239ff3bab8","infoHashBuffer":{"type":"Buffer","data":[11,41,216,68,222,89,60,83,183,39,82,39,54,121,171,35,159,243,186,184]},"announce":[],"urlList":[]}}