{"title":"Street Waif On Hot Offer In Asian Slum","uid":12112004,"size":1022984016,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:0b8947f4f9ece04b7568bae3a775ce6029af911e&amp;dn=Street+Waif+On+Hot+Offer+In+Asian+Slum&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"sarah.jensen","files":1,"time":1436599023,"description":"On a hot night, Christina, dressed in tiny little shorts, waits on the street till she gets picked up. Dressed for sex and nightlife, Christina loves her life. She only wakes up at sunset, quickly washes, or often not, and puts on as revealing a set of clothes as she can. Then she sets out from her slum and mingles with the tourists among the hot smells of the evening. Street food, street stalls selling clothes and dim street lighting, she is her own street vendor. Sex on offer, for the gratification of any tourist. More importantly, for her own gratification. Christina loves sex, loves going down, loves cock up her sweet pink meat. She loves sex with random foreign men. Life is easy, a different guy each day. Sometimes two or three. She does not understand why some guys want a quicky. She will fuck for as long as you want. When you have finished, don't throw her away, just leave her conveniently back on a crowded street, and she will disappear, with a loving wave and a kind smile, all on high definition video","torrent":{"xt":"urn:btih:0b8947f4f9ece04b7568bae3a775ce6029af911e","amp;dn":"Street+Waif+On+Hot+Offer+In+Asian+Slum","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b8947f4f9ece04b7568bae3a775ce6029af911e","infoHashBuffer":{"type":"Buffer","data":[11,137,71,244,249,236,224,75,117,104,186,227,167,117,206,96,41,175,145,30]},"announce":[],"urlList":[]}}