{"title":"Jack Campbell - The Lost Fleet","uid":8461447,"size":1132762874,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0c60a5e3a9f20675e9ec74d825eceb73585a9a99&amp;dn=Jack+Campbell+-+The+Lost+Fleet&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SmakDaddy","files":24,"time":1368241630,"description":"This is the complete 'Lost Flee' series of 6 books, a space opera by Jack Campbell.\n\nFrom Wikipedia :\nThe Lost Fleet is a military science fiction series written by John G. Hemry under the pen name Jack Campbell. The series is set one-hundred-plus years into an interstellar war between two different human cultures, the Alliance and the Syndics. The protagonist of the story is discovered floating in a suspended animation escape pod one hundred years after he made a &quot;heroic last stand&quot; against an enemy fleet. In his absence, he has been made into a renowned hero in the Alliance, but his legend and actions are used to justify poor tactics and decisions. Awakened after being discovered during a secret mission that turns out to be an enemy trap, he is suddenly dropped into the role of fleet commander and expected to live up to the legend that has grown around him.\n\nThere are 6 aubiobooks in this series, but if you enjoy these, tyhere are 2 incomplete spinoffs, 'Beyond the Frontier' (3 books, 1 unreleased), and 'The Lost Stars' (2 books, 1 unreleased). The final books in both are due out this year.\n\nOn an unrelated note, it is great to see Demonoid reborn as d2, and hopefully they get a tracker online very soon!\n\nI'll put the 'downloaded from d2.vu' text file in this torrent as a show of support :D","torrent":{"xt":"urn:btih:0c60a5e3a9f20675e9ec74d825eceb73585a9a99","amp;dn":"Jack+Campbell+-+The+Lost+Fleet","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c60a5e3a9f20675e9ec74d825eceb73585a9a99","infoHashBuffer":{"type":"Buffer","data":[12,96,165,227,169,242,6,117,233,236,116,216,37,236,235,115,88,90,154,153]},"announce":[],"urlList":[]}}