{"title":"mIRC v7.27 + Patch.rar","uid":7752330,"size":1938983,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0c86042c262633da3bd07c436b2644fa2d0929a6&amp;dn=mIRC+v7.27+%2B+Patch.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Swegin8r","files":1,"time":1350997966,"description":"Includes the mIRC v7.27 installation package, a patch and a text file containing instructions.\n\nInstall as usual. Use the provided patch then enter any name and serial combination to register the program. Done! Enjoy!\n\n\n-----------------------------------------------------------------------------------\n\n\nmIRC is a full featured Internet Relay Chat client for Windows that can be used to communicate, share, play or work with others on IRC networks around the world, either in multi-user group conferences or in one-to-one private discussions.\n\nIt has a clean, practical interface that is highly configurable and supports features such as buddy lists, file transfers, multi-server connections, IPv6, SSL encryption, proxy support, UTF-8 display, UPnP, customizable sounds, spoken messages, tray notifications, message logging, and more.\n\nmIRC also has a powerful scripting language that can be used both to automate mIRC and to create applications that perform a wide range of functions from network communications to playing games.\n\nmIRC has been in development for over a decade and is constantly being improved and updated with new technologies.\n\n-----------------------------------------------------------------------------------\n\nWHY UPGRADE?\n\n-A &quot;Mark As Read&quot; option has been added to the treebar, switchbar, toolbar and MDI popup menus to allow you to clear all flashing/highlighted windows.\n-The $hfind() identifier has been extended to allow results to be saved to a @window listbox or passed to a command.\n-An SSL connection issue has been fixed that prevented mIRC from connecting to servers with certificates that used unrecognized date formats.\n-A hotlink display issue has been fixed that caused text to flicker when hovering the mouse over a link.\n-SSL support for Subject Alternative Names (SAN) has been added when verifying whether a certificate is valid for the connection.\n-A number of issues with the reload logs feature have been fixed, including incorrect line indentation and missing lines at the end of a log in some situations.\n-An issue with the split long messages feature has been fixed which occurred when handling color formats in some contexts.\n-An Address Book bug that prevented removal of an existing timed unignore has been fixed.\n-The way incremental search works in channel nickname listboxes has been changed so that it behaves more like Windows explorer.\n-The /localinfo -p option has been changed to use a random UPnP port outside the first 1056 services port range as some routers block these ports.\n-An $inellipse() bug caused by a compiler optimization issue has been fixed.\n-Other changes and bug fixes.","torrent":{"xt":"urn:btih:0c86042c262633da3bd07c436b2644fa2d0929a6","amp;dn":"mIRC+v7.27+%2B+Patch.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c86042c262633da3bd07c436b2644fa2d0929a6","infoHashBuffer":{"type":"Buffer","data":[12,134,4,44,38,38,51,218,59,208,124,67,107,38,68,250,45,9,41,166]},"announce":[],"urlList":[]}}