{"title":"Campbell et al - Systemic Work With Organizations (1994).pdf","uid":4119427,"size":9866568,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0d8c149da2b40f646d01721148fb4ce1342ae8d7&amp;dn=Campbell+et+al+-+Systemic+Work+With+Organizations+%281994%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"slingshop","files":1,"time":1207475991,"description":"Campbell, David\nSystemic Work with Organizations: A New Model for Managers and Change Agents (1994). (Systemic Thinking &amp; Practice Series)\n\nEDITORS&amp;#039; FORE WORD\nOne of the unique features of this book is the fact that\nthe three authors, from very diverse backgrounds, have\ncome together at this particular time to create a conjoint\napproach to work with organizations. From psychology and commerce\nand engineering they have reached a common commitment\nto a new way of understanding organizations. They are transposing\nsystemic thinking from its origins in the therapeutic and\nacademic world of the social sciences to the hard-edged world of\norganizational life. For years it has seemed eminently logical to\nthink of organizations as systems, but no one has devised a method\nfor using these ideas to bring about change. Because the authors are\namongst only a handful who are applying these new ideas as\nconsultants to a range of public and private sector organizations,\nthey are preoccupied with the problem of understanding and\nevaluating their own work: &quot;What works in which situation ...\nand what doesn&amp;#039;t work . . . and why?&quot; Their aim is to gather their\nexperiences together into a methodology that will enable other\npractitioners to use these ideas.\nWhy should this book be appropriate at this particular time? As\neditors we believe that the ideas in the book mirror the increasing\ncomplexity of life today and the need to acknowledge an increasing\nrange of views and opinions about any issue. The days of simple\nstructures and easy explanations are gone, and practitioners need\ntools to help them make sense of this emerging diversity. We see\nsystemic thinking?and its application called constructionist consultancy ?\nas just such tools.\nWe are also aware that this book introduces this Series to a\nnew market. It aspires to create new ground?between the social\nscientists and organization change agents?where new thinking\ncan be applied to old problems and where old ways of thinking\ncan be challenged with new techniques. The authors wrote with a\nnew audience in mind because they believe that increasingly\ncomplicated organizational problems require a different kind of\npractitioner than has existed before. They have tried to make the\nbook and its ideas as accessible and concise as possible, knowing\nfull well that some people find the language of systems thinking\nvery strange, and that managers and consultants do not have time\nto wade through lengthy tomes to garner fresh ideas.\nWe hope familiar readers will find systemic ideas placed in new\ncontexts; for those of you coming to this field for the first time,\nwelcome!\n\nDavid Campbell\nRos Draper\n\nLondon\nOctober 1994","torrent":{"xt":"urn:btih:0d8c149da2b40f646d01721148fb4ce1342ae8d7","amp;dn":"Campbell+et+al+-+Systemic+Work+With+Organizations+%281994%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d8c149da2b40f646d01721148fb4ce1342ae8d7","infoHashBuffer":{"type":"Buffer","data":[13,140,20,157,162,180,15,100,109,1,114,17,72,251,76,225,52,42,232,215]},"announce":[],"urlList":[]}}