{"title":"Distance (Build 4122)","uid":13155723,"size":789049795,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0d9c0d0330cf04de7913bcd48d9609465d827199&amp;dn=Distance+%28Build+4122%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1452099907,"description":"\nAbout This Game\r\nDistance is a survival racing game that combines the intense action of arcade racing with the exploration of an atmospheric world. You control a unique car that allows you to boost, jump, rotate, and even fly through a chaotic and twisted city. The world has a mysterious history, and as you explore you'll be able to uncover pieces of its past.\r\n\r\nThe roads are treacherous and unpredictable with obstacles around every corner. Instead of doing laps on a loop, you'll be trying to survive to the end in the quickest time. Since your car has several abilities, it allows you to not only drive fast on the track but also upside down and on buildings and walls! You can also fly to discover new shortcuts and paths. You'll be able to take on the roads alone, or in multiplayer with your friends!\r\n\r\nThe game is a spiritual successor to the multi-award winning game Nitronic Rush, created by ourselves and 5 others at DigiPen Institute of Technology. It was widely praised for its innovative mechanics, visual style, audio design, and atmosphere.\r\nKey Features\r\n\r\n    Adventure: A single player experience which unveils a short story about this world's mysterious past.\r\n    Multiplayer: Online, LAN, and Split-Screen play in modes such as Sprint, Reverse Tag, Stunt, and others.\r\n    Trackmogrify: Random track generation with seed modifiers.\r\n    VR: Experimental Oculus DK2 integration.\r\n    Level editor: Use a powerful level editor to create levels from within the game and share them with players around the world.\r\n    Original soundtrack: New music from the composer behind award-winning games like Nitronic Rush, Solace, and The Fourth Wall. Listen to a preview here","torrent":{"xt":"urn:btih:0d9c0d0330cf04de7913bcd48d9609465d827199","amp;dn":"Distance+%28Build+4122%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d9c0d0330cf04de7913bcd48d9609465d827199","infoHashBuffer":{"type":"Buffer","data":[13,156,13,3,48,207,4,222,121,19,188,212,141,150,9,70,93,130,113,153]},"announce":[],"urlList":[]}}