{"title":"Canadas.Handyman.Challenge.S03E03.Toronto.HDTV.x264-CLDD","uid":9572999,"size":488036414,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0ecdcccffdd3f895e8fef05f431106593dff1e84&amp;dn=Canadas.Handyman.Challenge.S03E03.Toronto.HDTV.x264-CLDD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"duranie","files":1,"time":1391656482,"description":"Canadas.Handyman.Challenge.S03E03.Toronto.HDTV.x264-CLDD.mp4\n\n\nAirdate: February 4, 2014\n\n\nIn this episode, Host Jenn and Judges, Scott, Paul and Bryan travel to Toronto where they are greeted by a huge crowd of handy contestants who &quot;pitch&quot; their pre-made plywood projects. The Judges select the ten best projects. Their first challenge for the Top Ten is to create a free-standing water tower in order for the judges to hoist a bucket full of water. The four tallest towers move on to next round, three are eliminated. They have two hours. The remaining seven contestants must create a stylish, functioning hanging bean bag chair that all three judges could sit on. They have two hours to complete their challenge and another three contestants will be eliminated. The remaining four are declared the Toronto finalists.\n\n\n-----------------------------------------------------------------------\n\n\n\nABOUT THE SHOW:\n\nCanada's Handyman Challenge returns for a third season with more creative and resourceful challenges than ever before. This season HGTV Canada's biggest stars Bryan Baeumler (Leave It To Bryan, House of Bryan), Scott McGillivray (Income Property) and Paul Lafrance (Decked Out, Disater Decks) are on a nationwide search stopping in Calgary, Winnipeg, Toronto and Halifax to find Canada's top amateur handyman talent. Along with host Jennifer Robertson, the all-star judging panel will challenge contestants like never before as they whittle down the competition. With bragging rights on the line, the contestant that best handles the pressure and staves off elimination will walk away with the $25,000 prize.\n","torrent":{"xt":"urn:btih:0ecdcccffdd3f895e8fef05f431106593dff1e84","amp;dn":"Canadas.Handyman.Challenge.S03E03.Toronto.HDTV.x264-CLDD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ecdcccffdd3f895e8fef05f431106593dff1e84","infoHashBuffer":{"type":"Buffer","data":[14,205,204,207,253,211,248,149,232,254,240,95,67,17,6,89,61,255,30,132]},"announce":[],"urlList":[]}}