{"title":"Stray Cats - The Best Of [EAC-FLAC] [RePoPo]","uid":4938891,"size":411802757,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0ef4e49747e1e9911e30e48b81f12839557f71a8&amp;dn=Stray+Cats+-+The+Best+Of+%5BEAC-FLAC%5D+%5BRePoPo%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"repopo","files":-1,"time":1244375863,"description":"*******************************************************************************\n                           Stray Cats - The Best Of\n*******************************************************************************\n\n01. Stray Cat Strut    [0:03:17.13]\n02. Rock This Town    [0:02:40.27]\n03. Rebels Rule    [0:03:28.05]\n04. Built For Speed    [0:02:55.58]\n05. Little Miss Prissy    [0:03:02.45]\n06. Too Hip Gotta Go    [0:02:35.70]\n07. My One Desire    [0:02:58.02]\n08. I Won't Stand In Your Way    [0:03:30.40]\n09. C'mon Everybody (Live)    [0:03:54.60]\n10. Fishnet Stockings    [0:02:27.10]\n11. Runaway Boys    [0:03:01.05]\n12. (She's) Sexy And 17    [0:03:15.05]\n13. Baby Blue Eyes    [0:02:49.73]\n14. Jeannie, Jeannie, Jeannie    [0:02:21.00]\n15. You Don't Believe Me    [0:02:58.07]\n16. Ubangi Stomp    [0:03:14.20]\n17. Double Talkin' Baby    [0:03:05.15]\n18. Storm The Embassy    [0:04:08.08]\n19. Rumble In Brighton    [0:03:15.25]\n20. Gonna Ball    [0:03:16.20]\n\n\nPlease note that this edition includes the exact same track listing as the 1991 \nBack to the Alley: Best of the Stray Cats, therefore I've enclosed both sets of \ncovers.\n\n-------------------------------------------------------------------------------\n\n\nBiography\tby Steve Huey\n\nThe key group of the early-'80s rockabilly revival, the Stray Cats scored \nseveral big hits on both sides of the Atlantic thanks to a striking visual style \ntailor-made for the early days of MTV, as well as genuine musical chops that \nevoked the best players of rockabilly's original heyday. The Stray Cats were \nformed by guitarist/vocalist Brian Setzer in the Long Island town of Massapequa, \nNY, in 1979. At first, Setzer played rockabilly covers in a band called the Tom \nCats with his drumming brother Gary and bassist Bob Beecher; however, Setzer \nsoon abandoned that group to join up with newly rechristened school friends Lee \nRocker (born Leon Drucker) and Slim Jim Phantom (born James McDonnell). However, \ntheir retro '50s look and sound didn't go over well around Long Island, and in \nthe summer of 1980 the group headed to England, where a rockabilly revival \nmovement was just beginning to emerge.\n\nAfter one of their gigs in London, the Stray Cats met producer Dave Edmunds, \nwell known as a roots rock enthusiast for his work with Rockpile and as a solo \nartist. Edmunds offered to work with the group, and they entered the studio to \nrecord their self-titled debut album, released in England in 1981 on Arista. \nThey were popular right out of the box, scoring three straight hits that year \nwith &quot;Runaway Boys,&quot; &quot;Rock This Town,&quot; and &quot;Stray Cat Strut.&quot; The follow-up, \nGonna Ball, wasn't as well received, and stung by the negative reviews, the \nStray Cats decided to return to the States and make a go of it. They signed with \nEMI America and in 1982 released their U.S. debut, Built for Speed, which \ncompiled the highlights from their two British LPs. Helped by extensive airplay \non MTV at the height of the anything-goes new wave era, &quot;Rock This Town&quot; and \n&quot;Stray Cat Strut&quot; both hit the American Top Ten, over a year after their British \nchart peaks. As a result, Built for Speed was a left-field smash, and the Stray \nCats were seen as avatars of retro style. Their second American album, Rant n' \nRave With the Stray Cats, appeared in 1983 and produced another Top Ten hit in \n&quot;(She's) Sexy + 17,&quot; as well as a minor Top 40 entry in the doo wop-styled \nballad &quot;I Won't Stand in Your Way.&quot;\n\nPersonality conflicts began to emerge in the ways the individual members handled \ntheir newfound success; Phantom married actress (and former Rod Stewart \nparamour) Britt Ekland, while Setzer made guest appearances with stars like Bob \nDylan and Stevie Nicks and became the concert guitarist for Robert Plant's \nHoneydrippers side project. In late 1984, Setzer broke up the band amid much bad \nblood. Rocker and Phantom immediately teamed up with guitarist Earl Slick and \nrecorded an album as Phantom, Rocker &amp; Slick, while Setzer waited a couple of \nyears before releasing his roots rock solo debut, The Knife Feels Like Justice. \nBy 1986, fences had apparently been mended enough for the Stray Cats to \nreconvene in Los Angeles and record the covers-heavy Rock Therapy, which didn't \nsell that well. The trio returned to their respective post-Stray Cats projects, \nwhich both released albums that performed disappointingly. In 1989, they \nreunited once again for the album Blast Off, which was accompanied by a tour \nwith Stevie Ray Vaughan. No longer with EMI, the Cats entered the studio with \nNile Rodgers for the lackluster Let's Go Faster, issued by Liberation in 1990. \n1992's Dave Edmunds-produced Choo Choo Hot Fish also attracted little attention, \nand after another covers album, Original Cool, the group called it quits again. \nThey have since reunited periodically for live performances. Setzer, of course, \nwent on to spearhead the '90s swing revival with his Brian Setzer Orchestra, \nwhich performed classic big band swing and jump blues tunes, as well as Setzer \noriginals. \n\n\n\n-------------------------------------------------------------------------------\n\n\nExact Audio Copy V0.99 prebeta 4 from 23. January 2008\n\nEAC extraction logfile from 6. June 2009, 19:39\n\nStray Cats / The Best of Stray Cats\n\nUsed drive  : HL-DT-STDVD-RAM GSA-H55N   Adapter: 0  ID: 0\n\nRead mode               : Secure\nUtilize accurate stream : Yes\nDefeat audio cache      : Yes\nMake use of C2 pointers : No\n\nRead offset correction                      : 102\nOverread into Lead-In and Lead-Out          : No\nFill up missing offset samples with silence : Yes\nDelete leading and trailing silent blocks   : No\nNull samples used in CRC calculations       : Yes\nUsed interface                              : Installed external ASPI interface\nGap handling                                : Not detected, thus appended to \nprevious track\n\nUsed output format              : User Defined Encoder\nSelected bitrate                : 1024 kBit/s\nQuality                         : High\nAdd ID3 tag                     : Yes\nCommand line compressor         : F:Archivos de programaExact Audio \nCopyFLACFLAC.EXE\nAdditional command line options : -6 -V -T &quot;ARTIST=%a&quot; -T &quot;TITLE=%t&quot; -T \n&quot;ALBUM=%g&quot; -T &quot;DATE=%y&quot; -T &quot;TRACKNUMBER=%n&quot; -T &quot;GENRE=%m&quot; -T &quot;COMMENT=%e&quot; %s -o \n%d\n\n\n-------------------------------------------------------------------------------\n                      IMPORTANT: PLEASE READ (A REQUEST)\n-------------------------------------------------------------------------------\n\nIt's usual to post comments only to attack a torrent which doesn't work in your \nconfiguration.  It's normal, after a few hours/days downloading and expecting a\nrelease, to feel deceived if it doesn't work properly, and expressing this is\nlegitimate.\n\nI've often found one comment (negative) on a movie/CD downloaded by 2000+ \npeople, and since that single negative feedback, people simply stop downloading \nand therefore, sharing.  But a few times it was due not to the torrent itself, \nbut to some issues on the downloader side (not updated codecs, misused \ntools...), and that's unfair for the person who took the time to share it for\nfree.\n\nIF YOU FIND THIS RELEASE DESERVES TO BE RECOMMENDED TO OTHERS, HELP BY DROPPING \nA LINE AFTER YOU'VE CHECKED IT.  This way, You'll help in keeping the torrent \nalive, almost as much as keeping it in your HDD until a 1:1 ratio is\nreached.\n\nThanks\n\n-------------------------------------------------------------------------------\n-------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:0ef4e49747e1e9911e30e48b81f12839557f71a8","amp;dn":"Stray+Cats+-+The+Best+Of+%5BEAC-FLAC%5D+%5BRePoPo%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ef4e49747e1e9911e30e48b81f12839557f71a8","infoHashBuffer":{"type":"Buffer","data":[14,244,228,151,71,225,233,145,30,48,228,139,129,241,40,57,85,127,113,168]},"announce":[],"urlList":[]}}