{"title":"Rush.Hour.Trilogy","uid":8764553,"size":2149002755,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:0f5bcb96bb49076f857552c5817ac5b10d660ff9&amp;dn=Rush.Hour.Trilogy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Trini_Kid","files":-1,"time":1375305428,"description":"This TORRENT consists of Rush Hour 1, 2 &amp; 3\n\n\n\nRush Hour 1\n\nStoryline-\n\nCultures clash and tempers flares as the two cops named Detective Inspector Lee a Hong Kong Detective and Detective James Carter FBI, a big-mouthed work-alone Los Angeles cop who are from different worlds discovers one thing in common: they can't stand each other. With time running out, they must join forces to catch the criminals and save the eleven-year-old Chinese girl of the Chinese consul named Soo Yung.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0120812/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0120812/&lt;/a&gt;\n\n\n\nRush Hour 2\n\nStoryline-\n\nIt's vacation time for Detective James Carter and he finds himself alongside Detective Lee in Hong Kong wishing for more excitement. While Carter wants to party and meet the ladies, Lee is out to track down a Triad gang lord who may be responsible for killing two men at the American Embassy. Things get complicated as the pair stumble onto a counterfeiting plot by L.A. crime boss Steven Reign and Triad Ricky Tan, an ex-cop who played a mysterious part in the death of Det. Lee's father. Throw in a power struggle between Tan and the gorgeous but dangerous Hu Li and the boys are soon up to their necks in fist fights and life-threatening situations. A trip back to the U.S. may provide the answers about the bombing, the counterfeiting, and the true allegiance of sexy customs agent Isabella. Then again, it may turn up more excitement than Carter was looking for during his vacation.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0266915/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0266915/&lt;/a&gt;\n\n\n\nRush Hour 3\n\nStoryline-\n\nAfter an attempted assassination on Ambassador Han, Inspector Lee and Detective Carter are back in action as they head to Paris to protect a French woman with knowledge of the Triads' secret leaders. Lee also holds secret meetings with a United Nations authority, but his personal struggles with a Chinese criminal mastermind named Kenji, which reveals that it's Lee's long-lost...brother. But their race will take them across the city, from the depths of the Paris underground to the breathtaking heights of the Eiffel Tower, as they fight to outrun the world's most deadly criminals and save the day.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0293564/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0293564/&lt;/a&gt;\n\n\n\n\n\n\n\nENJOY!!\n\n\n-Trini_Kid\n \n\n\n\n\n","torrent":{"xt":"urn:btih:0f5bcb96bb49076f857552c5817ac5b10d660ff9","amp;dn":"Rush.Hour.Trilogy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f5bcb96bb49076f857552c5817ac5b10d660ff9","infoHashBuffer":{"type":"Buffer","data":[15,91,203,150,187,73,7,111,133,117,82,197,129,122,197,177,13,102,15,249]},"announce":[],"urlList":[]}}