{"title":"Emission Tomography - The Fundamentals of PET and SPECT","uid":14535046,"size":18453988,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:10adb80eedc4a6de8dd7718bd91c90480ededfad&amp;dn=Emission+Tomography+-+The+Fundamentals+of+PET+and+SPECT&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1462487561,"description":"Emission Tomography - The Fundamentals of PET and SPECT - Miles N. Wernick, John N. Aarsvold (AP, 2004).pdf\r\n\r\nPET and SPECT are two of today’s most important medical-imaging methods, providing images that reveal subtle information about physiological processes in humans and animals. Emission Tomography: The Fundamentals of PET and SPECT explains the physics and engineering principles of these important functional-imaging methods. The technology of emission tomography is covered in detail, including historical origins, scientific and mathematical foundations, imaging systems and their components, image reconstruction and analysis, simulation techniques, and clinical and laboratory applications. The book describes the state of the art of emission tomography, including all facets of conventional SPECT and PET, as well as contemporary topics such as iterative image reconstruction, small-animal imaging, and PET/CT systems. This book is intended as a textbook and reference resource for graduate students, researchers, medical physicists, biomedical engineers, and professional engineers and physicists in the medical-imaging industry. Thorough tutorials of fundamental and advanced topics are presented by dozens of the leading researchers in PET and SPECT. SPECT has long been a mainstay of clinical imaging, and PET is now one of the world’s fastest growing medical imaging techniques, owing to its dramatic contributions to cancer imaging and other applications. Emission Tomography: The Fundamentals of PET and SPECT is an essential resource for understanding the technology of SPECT and PET, the most widely used forms of molecular imaging","torrent":{"xt":"urn:btih:10adb80eedc4a6de8dd7718bd91c90480ededfad","amp;dn":"Emission+Tomography+-+The+Fundamentals+of+PET+and+SPECT","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10adb80eedc4a6de8dd7718bd91c90480ededfad","infoHashBuffer":{"type":"Buffer","data":[16,173,184,14,237,196,166,222,141,215,113,139,217,28,144,72,14,222,223,173]},"announce":[],"urlList":[]}}