{"title":"Rob Roy (1995) 720p HD (moviesbyrizzo) - 2,2GB multisubs ","uid":6520454,"size":2368773486,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:10d49ae382e6c2827dce76c42ee9f51873cb0b4d&amp;dn=Rob+Roy+%281995%29+720p+HD+%28moviesbyrizzo%29+-+2%2C2GB+multisubs+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"moviesbyrizzo","files":-1,"time":1309972771,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0114287/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0114287/&lt;/a&gt;\n\n2.2GB 720p DivX HD video with 1280 x 544 resolution at 2000 bitrate\nall the booming fullness of 256k audio included \n\nConverted from an 8GB version found on the net. We looked for additionally\nan found subtitles in SRT format for the following language offerings included\nhere for you:\n\nCroatian Danish Dutch Finnish French Portuguese romanian Serbian Spanish\nSwedish and an English template is included for any languages not already posted\n\n\nSet in the Scottish highlands it is an interesting movie about a code of conduct,\na code of honour that goes to regimentalize and civlize a mindset that seeks a \nsense of order and predictablity amidst much evil and wickdedness that such nice \nfolk (played by Liam Neeson and Jessica Lange in the plot of the movie)would have \nto confront and negotiate through as treacherous conditions would no doubt see \nthem devoured by circumstances. All societies have come though something similar \nin the way of a period of having to calm the waters so that a real sense of \ngoodness replaces the rules of engagement that are otherwise based on the morality \nof self interest and basic survival alone. nevertheless that is something and it \ncertainly beats being altogether at the vagaries of a completely uncivilized \nsetting where no sense of quid pro quo is recognized as intelligible by those on \nthe stage.\n\n\nIt was heartbreaking to see Liam Neeson's character suffer as much as he does in \nthis movie with what befalls his family in what is barbaric cruelty (He has a \nheavy burden that is cruelly and with obvious malice, inflicted upon him that is \nonly cathartically set right after great turmoil. Oh well, all is well that ends \nwell as they say. This is a movie for fans of Jessica Lange and for those that \nenjoy the banter of discourse of what is civil engagement in what Hobbes would \nrefer to a &quot;state of nature&quot; nonetheless.\n\n\nWe hope you will seed this movie if you have an interest in the material as \ncommitted fans are always welcome to help spread the mercies of edification and \ngeneral education that comes from a more generous access to culture and it is in \nthat spirit that we make available yet another great movie for you, as all have \nhad great seeding support so far after efforts have been expended. thank you all \nfor being so good with this, it shows a good sense of community mindedness and \nwithout that we would be on barren soil no matter where we operate from, into our \nconstituent areas etc.\n\n\nWhen asked to define what &quot;honour&quot; is (by his children in this tale)\nLiam's character says it is such a quality that requires as well that true\nmen who possess this quality are rightly protective of womenfolk as is deserved\naccording to their kind natures as a so created being. Are you folks all listening\nout there today, huh! (equally???) This is certaionly in contrast to the sort\nof &quot;men&quot; who say they dont recognize men and women differently using\nanatomical comparisons even, perhaps (towards the beginning of the movie)\n\nMichael Rizzo Chessman\nmoviesbyrizzo\n\nnote: mature content","torrent":{"xt":"urn:btih:10d49ae382e6c2827dce76c42ee9f51873cb0b4d","amp;dn":"Rob+Roy+%281995%29+720p+HD+%28moviesbyrizzo%29+-+2%2C2GB+multisubs+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10d49ae382e6c2827dce76c42ee9f51873cb0b4d","infoHashBuffer":{"type":"Buffer","data":[16,212,154,227,130,230,194,130,125,206,118,196,46,233,245,24,115,203,11,77]},"announce":[],"urlList":[]}}