{"title":"The Beatles - Hey Bulldog [original promo].VOB","uid":9932171,"size":112830464,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:11fbd2ae736a14b8fc03a21d1083b335d41e2051&amp;dn=The+Beatles+-+Hey+Bulldog+%5Boriginal+promo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1397117049,"description":"The Beatles - Hey Bulldog [original promo].VOB\n\n\nHQ very rare promo music video from a promo DVD. &quot;Hey Bulldog&quot; is a song by the Beatles which first appeared on the Yellow Submarine soundtrack album in 1969. Written primarily by John Lennon (credited to Lennon &amp; McCartney), and finished in the studio by Lennon and McCartney, the song was recorded during the filming of the &quot;Lady Madonna&quot; promotional video, and like &quot;Lady Madonna&quot; is one of the few Beatles' songs to revolve around a piano riff.\n\nA few days before the recording session, Paul McCartney had played drums on a Paul Jones rocker called &quot;The Dog Presides,&quot; which had featured barking sound effects. During the Beatles recording, McCartney started to bark without warning. The next lines, initially written as &quot;Hey bullfrog&quot; by Lennon, were changed mid-song to &quot;Hey bulldog&quot;, which would become the song's title.\n\nGeoff Emerick, the Beatles' engineer, would subsequently claim this was the last song the band recorded that featured a team dynamic with enthusiasm from every member. He also praised the performance in his book Here, There, Everywhere, saying &quot;Paul's bass line was probably the most inventive of any he'd done since Pepper, and it was really well played. Harrison's solo was sparkling, too--one of the few times that he nailed it right away. His amp was turned up really loud, and he used one of his new fuzz boxes, which made his guitar absolutely scream.&quot; When the group reconvened in the studio in May 1968 for the The Beatles sessions, their group cohesion had already been undermined by the business, artistic, and personal differences that would culminate in their eventual break-up.\n\nMcCartney spoke fondly of &quot;Hey Bulldog&quot; in 1994:  &quot;I remember (it) as being one of John's songs and I helped him finish it off in the studio, but it's mainly his vibe. There's a little rap at the end between John and I, we went into a crazy little thing at the end. We always tried to make every song different because we figured, 'Why write something like the last one? We've done that.' We were on a ladder so there was never any sense of stepping down a rung, or even staying on the same rung, it was better to move one rung ahead&quot;.\n\nDuring these sessions, a film crew photographed the Beatles recording the song. It was one of the few times they allowed themselves to be extensively filmed while recording at EMI's Abbey Road studios, for a promotional film to be released during their scheduled four-month retreat to India (which was later edited together as a promotional film for the single &quot;Lady Madonna&quot;).\n\nThe Beatles were an English rock band formed in Liverpool in 1960. They became the most commercially successful and critically acclaimed act in the rock music era. The group's best-known lineup consisted of John Lennon, Paul McCartney, George Harrison, and Ringo Starr. Rooted in skiffle and 1950s rock and roll, the Beatles later utilized several genres, ranging from pop ballads to psychedelic rock, often incorporating classical and other elements in innovative ways. In the early 1960s, their enormous popularity first emerged as &quot;Beatlemania&quot;, but as their songwriting grew in sophistication, they came to be perceived by many fans and cultural observers as an embodiment of the ideals shared by the era's sociocultural revolutions. \n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Hey_Bulldog&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Hey_Bulldog&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/mANAdAAfh&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/mANAdAAfh&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 4000kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 448kbps\n   Duration: 00:03:20\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.3\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:11fbd2ae736a14b8fc03a21d1083b335d41e2051","amp;dn":"The+Beatles+-+Hey+Bulldog+%5Boriginal+promo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11fbd2ae736a14b8fc03a21d1083b335d41e2051","infoHashBuffer":{"type":"Buffer","data":[17,251,210,174,115,106,20,184,252,3,162,29,16,131,179,53,212,30,32,81]},"announce":[],"urlList":[]}}