{"title":"MAN ON FIRE (Eng DTS; 5.1; 2.0 - subs Eng Dutch).ISO","uid":5286276,"size":8065503232,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:122353b59244d3f2fdc21985f160223a89e44e49&amp;dn=MAN+ON+FIRE+%28Eng+DTS%3B+5.1%3B+2.0+-+subs+Eng+Dutch%29.ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rocking_cat","files":-1,"time":1263736857,"description":"Audio....: DTS 5.1-ch English\n           AC3 5.1-ch English\n           AC3 2-ch English\nSubs.....: Dutch\n           English\nMenu.....: Yes\nExtras...: Yes\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0328107/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0328107/&lt;/a&gt;\n\n\nMan on Fire is a 2004 US film drama based on a novel by A. J. Quinnell. The film was directed by Tony Scott and starred Denzel Washington. The film received mixed reviews but was a commercial success.\n\n\nPlot:\nIn Mexico City, criminal gangs are kidnapping rich people and their families for the lucrative ransom money. On the advice of his lawyer, Mexican businessman Samuel Ramos, like other men of wealth, hires a bodyguard to protect his nine-year-old daughter Lupita &quot;Pita&quot; Ramos and to be able to renew the family's ransom insurance.\n\nThe head of an executive security firm, Paul Rayburn, suggests that Ramos hire Rayburn's old CIA colleague John Creasy. Ramos is impressed with Creasy's rÃƒÂ©sumÃƒÂ©, which includes a variety of counterinsurgency and counter-terrorism activities. Creasy, however, has since become disillusioned and uninterested in life. He is burned out from all the death and horror and has taken to alcoholism to ease the burden.\n\nCreasy is not interested in bodyguard work but needs a job. His initial impatience slowly fades as he finds himself opening up to the child. He replaces her parents in their absence, giving her advice and coming to her swimming lessons and competitions. He helps her overcome her fear of starting guns, turning it into an eagerness to move at the sound of one. Pita gives Creasy an emblem of St. Jude, the patron saint of lost causes, saying she bought it for him with her own money.\n\nShortly after delivering her to a piano audition, Creasy notices a suspicious vehicle driving past and a pair of police cars blocking off the street. As Pita emerges from the building and freezes, Creasy pulls his gun and fires a shot into the air, similar to a starting gun, startling the child into running away. During the ensuing gun battle, four of the attackers are fatally shot, including two corrupt police officers. The battle leaves Creasy wounded and unconscious, allowing the surviving kidnappers to grab the child.\n\nThe leader of the kidnapping ring, known only as &quot;The Voice,&quot; demands a dead drop ransom of ten million dollars in exchange for Pita. The drop goes badly, the kidnappers are ambushed by a corrupt police gang called &quot;La Hermandad&quot; and the money is stolen. &quot;The Voice&quot; notifies Pita's parents that their child will not be returned.\n\nCreasy recovers and returns to Pita's home to promise her mother Lisa that he will kill everyone who was involved in, or profited from, this crime. He buys a variety of guns, explosives, and a rocket-propelled grenade launcher. Starting with a licence plate number, he uses the weaponry to kill a number of corrupt Mexican police officers and high-ranking law enforcement officials who were involved in the kidnapping.\n\nCreasy kidnaps and tortures several &quot;La Hermandad&quot; members, forcing them to reveal the names of the people involved in the kidnapping ring. Eventually, he learns that Ramos, with his lawyer Jordan Kalfus, set up the kidnapping of his own daughter in order to get the insurance money. Creasy finds Kalfus decapitated. He goes to inform Lisa and confront her husband, who commits suicide with a gun provided by Creasy.\n\nThanks to a newspaper article that reveals The Voice's identity as Daniel SÃƒÂ¡nchez, Creasy shows up at his apartment, and fights his way inside. Although wounded by the gunfire, he gains the upper hand and captures SÃƒÂ¡nchez's brother and ex-wife. He then calls SÃƒÂ¡nchez and, using a sawed-off shotgun, blows four of his brother's fingers off, threatening his life.\n\nTo save his brother, SÃƒÂ¡nchez reveals that Pita is alive and offers to exchange her for his brother and for Creasy himself. Lisa is instructed to meet Creasy at a remote rural area to make the exchange. Pita excitedly embraces Creasy, then runs to her mother. Creasy is taken to a car, but as he looks upon the PopocatÃƒÂ©petl volcano he succumbs to his wounds, dropping the emblem of St. Jude that Pita gave him.\n\nAn epilogue reveals that SÃƒÂ¡nchez was killed during a police raid that same day, his location discovered by special operations police who were following Creasy's actions.\n\nCast:\nDenzel Washington.................... John W. Creasy \nDakota Fanning....................... Lupita Martin Ramos, &quot;Pita&quot; \nMarc Anthony......................... Samuel Ramos \nRadha Mitchell....................... Lisa Martin Ramos \nChristopher Walken................... Paul Rayburn \nGiancarlo Giannini................... Miguel Manzano \nRachel Ticotin....................... Mariana Garcia Guerrero \nJesÃƒÂºs Ochoa.......................... Victor Fuentes \nMickey Rourke........................ Jordan Kalfus \nAngelina PelÃƒÂ¡ez...................... Sister Anna \nRoberto Sosa......................... Daniel Rosas Sanchez a.k.a &quot;The Voice&quot; \nGero Camilo.......................... Aurelio Rosas Sanchez \nMario Zaragoza....................... Jorge Ramirez \n","torrent":{"xt":"urn:btih:122353b59244d3f2fdc21985f160223a89e44e49","amp;dn":"MAN+ON+FIRE+%28Eng+DTS%3B+5.1%3B+2.0+-+subs+Eng+Dutch%29.ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"122353b59244d3f2fdc21985f160223a89e44e49","infoHashBuffer":{"type":"Buffer","data":[18,35,83,181,146,68,211,242,253,194,25,133,241,96,34,58,137,228,78,73]},"announce":[],"urlList":[]}}