{"title":"BT - Never Gonna Come Back Down (CDM) (2001) (Electronic) (192kb","uid":3384712,"size":56990903,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:12966eef6a06478d38fc61afd779a5834d0ade90&amp;dn=BT+-+Never+Gonna+Come+Back+Down+%28CDM%29+%282001%29+%28Electronic%29+%28192kb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"D_H_A","files":1,"time":1127037417,"description":"BT - Biography\t\tby John Bush\n\nHis concept of epic house inspired by the classical training he received from an early age, Brian Transeau revitalized the British dance community in the mid-'90s and provided a point of entry for later dream house merchants like Robert Miles, Sash!, and BBE (though Transeau had, for the most part, left the style behind by the time of its pop success during 1997-1998). After his debut album appeared in late 1995 (as BT), Transeau hit the dance charts when his remix of Tori Amos' &quot;Blue Skies&quot; became one of the most-played American club tracks of the following year. Though he attempted to leave dream house behind on second album ESCM, Transeau continued to do well with club-goers and critics in Britain as well as America.\n\nBorn and raised in Washington, D.C., Transeau was playing piano from the age of two and began his classical training while only 13. Even while he was studying string arrangement and orchestration, Transeau listened to Depeche Mode and Yes. He attended Berklee School of Music in Boston for one year but then dropped out and moved to Los Angeles; he was soon back in Washington, D.C., where he hooked up with longtime friend Ali Shirazinia's new Deep Dish production team. He had already played synthesizer for albums by Salt-N-Pepa and Tyler Collins before debuting on Deep Dish Records with two 1993 singles, &quot;A Moment of Truth&quot; and &quot;Relativity.&quot;\n\nThe tracks became club hits in Britain, routinely played by super DJs like Sasha and Paul Oakenfold for their epic, symphonic qualities, which worked well as a sort of climax at clubs like Cream and Ministry of Sound. Signed to Oakenfold's Perfecto Records, BT continued his success with 1995 singles like &quot;Embracing the Future&quot; and &quot;Loving You More,&quot; and did remix work for Mike Oldfield, Seal, and Billie Ray Martin. His debut album, Ima, was a hit with British audiences, though Transeau's name remained largely unheard in his native land.\n\nOne 1996 remix largely changed that. Transeau's reworking of &quot;Blue Skies&quot; by Tori Amos became a massive club hit in America and Great Britain. By 1997, England received a wave of pop hits in the same line pioneered by Transeau; dubbed dream house, artists like Robert Miles and Sash! typified the approach with a wash of new age or prog-influenced synthesizers and a chugging beat indebted to trance. Transeau himself attempted to distance himself from the style with his 1998 album follow-up, ESCM. Movement in Still Life followed in mid-2000. He marked time between albums with high-profile production work, including chart hits from Britney Spears (&quot;I'm Not a Girl, Not Yet a Woman&quot;) and *NSYNC (&quot;Pop&quot;), while a career retrospective entitled 10 Years in the Life was released in 2002. Emotional Technology, which featured collaborations with JC Chasez, Charmed actress Rose McGowan, and guitarist Richard Fortus, appeared in 2003. BT was also moving beyond his own musical sphere during this time by venturing into film. His score Music from and Inspired by the Film Monster was released in spring 2004. \n\n\nBT - Never Gonna Come Back Down (CDM) (2001) (192kbps) + front cover\n\nOriginal version of this track you can hear in GONE IN 60 MINUTES movie. You may find this track also as MOVEMENT IN STILL LIFE on UK version of MOVEMENT IN STILL LIFE album.\n\n01. Never Gonna Come Back Down (Hybrids Breaktek Mix)\t 7:48\n02. Never Gonna Come Back Down (Hybrids Echoplex Dub)\t 8:41\n03. Never Gonna Come Back Down (Timo Maas Mix)\t\t 8:03\n04. Never Gonna Come Back Down (Eric Kupper Mix)\t 8:41\n05. Never Gonna Come Back Down (Paul DeCarli Mix)\t 6:34\n\nTOTAL TIME\t\t\t\t\t\t39:47","torrent":{"xt":"urn:btih:12966eef6a06478d38fc61afd779a5834d0ade90","amp;dn":"BT+-+Never+Gonna+Come+Back+Down+%28CDM%29+%282001%29+%28Electronic%29+%28192kb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12966eef6a06478d38fc61afd779a5834d0ade90","infoHashBuffer":{"type":"Buffer","data":[18,150,110,239,106,6,71,141,56,252,97,175,215,121,165,131,77,10,222,144]},"announce":[],"urlList":[]}}