{"title":"Rado - Aethro-Kinematics - The Reinstatement of Common Sense - A","uid":3494282,"size":3207084,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:12d6c9e0e48266eba1d32affc2246e4296e5e807&amp;dn=Rado+-+Aethro-Kinematics+-+The+Reinstatement+of+Common+Sense+-+A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1149938629,"description":"This is Steven Rado&amp;#039;s breakthrough book Aethro-Kinematics - The Reinstatement of Common Sense - An Alternate Solution to the Problems of Modern Theoretical Physics (1994) where he presents an alternative theory for resolving the perplexities of modern mathematical physics and cosmology by reinstatement of common sense and classical logic. A dissident alternative to contemporary theoretical physics using common sense physics for resolving modern mathematical paradoxes and thus providing the simple physics of the third millennium. A book which explains the old concept of aether in a simple yet still scientific way. It presents an alternative view on the polarization of light and again brings to life the Faraday&amp;#039;s and Maxwell&amp;#039;s gaseous model of aether which then successfully explains the action-at-a-distance phenomena as the fluidic pressure of all-prevading aether. In general a different perspective on just about all physical phenomena with an emphasis on determining their true cause and without the use of highly complex theories which are usually useless for a common reader. This fascinating book brings to life the old concepts of natural philosophy which were forgotten by &quot;modern&quot; physics but are absolutely necessary to explain the true causes of the workings of nature. 530 pages, many pictures. A must read from everyone.\n\nMore info: http://www.aethro-kinematics.com\n","torrent":{"xt":"urn:btih:12d6c9e0e48266eba1d32affc2246e4296e5e807","amp;dn":"Rado+-+Aethro-Kinematics+-+The+Reinstatement+of+Common+Sense+-+A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12d6c9e0e48266eba1d32affc2246e4296e5e807","infoHashBuffer":{"type":"Buffer","data":[18,214,201,224,228,130,102,235,161,211,42,255,194,36,110,66,150,229,232,7]},"announce":[],"urlList":[]}}