{"title":"TMS - Political Theory - The Classic Texts and Their Continuing","uid":6587528,"size":102563224,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:14260b4853f8ad518e213eba3b8f275a1307b9b6&amp;dn=TMS+-+Political+Theory+-+The+Classic+Texts+and+Their+Continuing+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":15,"time":1312671855,"description":"\nPolitical Theory: The Classic Texts and Their Continuing Relevance\nby Joshua Kaplan\n\nFormat: MP3\nBitrate: 32 Kbps\n\nThis exciting course introduces vital works of political theory from history's greatest minds. The theorists we will study wanted very badly to reach their readers, to make them think about their world differently. As you learn about luminaries such as Plato, Thucydides, and Hobbes, you may see connections between their times and our own. Professor Kaplan's goal is to make these works accessible without distorting or oversimplifying them. As you will see, the study of political theory is an enjoyable, gratifying, and challenging subject that will reward the effort you put into thinking about it many times over.\n\nPolitical theory helps us to think about who we are, where we are coming from, and where we are going. At the same time, theory does not tell us what to do, but can help us to act with purpose and vision. It helps us to step back and get perspective on our problems and on who we really are. Here, you'll investigate how the language of political theory conveys its meaning. This course is not a substitute for reading the texts, but it can help you to overcome some of the obstacles that these texts present. It is not easy to pick up a book by Aristotle or Hobbes and figure it out on your own. We all need some help in understanding the world, and that is the starting point for political theory itself. As you embark on this adventure, you are taking part in a community that comes from specific times and places, but transcends them. These great works can speak to us today, wherever we are. Political theory does this better than many other subjects, in part because the theorist wants us to look around and think about the specifics of the world around us, but also to lift our heads and see farther than we normally do. By the conclusion of this course, you will see a dramatic difference in your ability to understand what you read or watch in the news.\n\nJoshua Kaplan has taught at the University of Notre Dame since 1987. He graduated from the University of California at Santa Cruz and earned a master's degree from the University of Chicago, schools renowned for two very different approaches to political theory. He teaches courses in political theory, constitutional law, and American politics and is the Political Science Department's associate director of undergraduate studies. He has been awarded Notre Dame's Kaneb Award for Excellence in Teaching.\n\n14 Lectures\n30 minutes/lecture\n\n1 How Political Theory Means\n2 Plato 1\n3 Plato 2 - The Republic\n4 Thucydides 1\n5 Thucydides 2\n6 Aristotle\n7 Machiavelli\n8 Thomas Hobbes - Leviathan\n9 Jean-Jacques Rousseau - On the Social Contract\n10 The Federalist Papers\n11 Alexis de Tocqueville 1\n12 Alexis de Tocqueville 2\n13 Karl Marx: The Communist Manifesto\n14 Game Theory \n","torrent":{"xt":"urn:btih:14260b4853f8ad518e213eba3b8f275a1307b9b6","amp;dn":"TMS+-+Political+Theory+-+The+Classic+Texts+and+Their+Continuing+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14260b4853f8ad518e213eba3b8f275a1307b9b6","infoHashBuffer":{"type":"Buffer","data":[20,38,11,72,83,248,173,81,142,33,62,186,59,143,39,90,19,7,185,182]},"announce":[],"urlList":[]}}