{"title":"Cecile Chaminade - The Complete Piano Music  (3 CDs)","uid":6089605,"size":720988422,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1469918e07e4223eccb76687fcdcc216a5b2cc2f&amp;dn=Cecile+Chaminade+-+The+Complete+Piano+Music++%283+CDs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rosie1966","files":25,"time":1294492181,"description":"When CÃƒÂ©cile Chaminade reached the pinnacle of her fame as a composer in\nthe early 1900s, she scaled heights few woman had ever reached. \nHer 1908 tour of the United States was hailed in a Washington Post article entitled: \n&quot;Mme. Chaminade, Greatest Woman Composer, Who Is Now Visiting America, Tells Of Her Dreams&quot;.\nChaminade was feted by kings, queens, and heads of governments.\nAmong her many honors, she received the Diamond Jubilee Medal in England from Queen Victoria, \nthe Chefekat from the Sultan of Constantinople, and France's highest award, the Chevalier of\nthe Legion of Honor. In the United States as many as 200 Chaminade Clubs sprang up, yet she died in relative obscurity in 1944.\nLess than forty years later an article appeared in her hometown magazine, Le Vesinet, entitled &quot;Who was CÃƒÂ©cile Chaminade?&quot;\nToday few musicians, professional or amateur, could answer that question.\nUpon reopening the pages into the life of one of the most fascinating women in the annals of music history, \none cannot help but recall these lines from the poem &quot;Ozymandias&quot;, by Percy Bysshe Shelley:\n\nAnd on the pedestal these words appear:\n&quot;My name is Ozymandias, the king of kings: \nLook on my works, ye mighty, and despair!&quot;\nNothing besides remains. Round the decay \nOf that colossal wreck, boundless and bare\nThe lone and level sands stretch far away.\n\nCÃƒÂ©ile Chaminade was born on August 8, 1857, in Paris, although she listed her birth year as 1861. \nHer family was upper-middle class and her father, Hippolyte, was the Paris branch manager\nof a British insurance firm. Both parents were amateur musicians -- her father, a violinist, and her mother, a pianist --,\nwho taught Chaminade the piano.\n\nBefore she was three, little CÃƒÂ©cile was found in her bed singing the Andante of one of Beethoven's sonatas for piano\nand violin that her parents were fond of playing. She wrote her first composition when she was seven and as a child\nwas introduced to many important musical figures in her parents' country home at Le Vesinet.\n&quot;One evening,&quot; she recalled, &quot;I was called to the drawing room and introduced to a stout, swarthy gentleman\nwho made me play all the compositions I knew. My childish compositions amused him very much, and he submitted\nme to such a musical examination .... When I had finished, the gentleman said to my father, \n'She undoubtedly has the gift. Give her all the opportunity for coming to the front, and she cannot fail, \nbut, above all, do not bore her.'&quot; The gentleman was Georges Bizet.\n\nBesides Bizet, Chaminade was encouraged by the composer Benjamin Godard while tutored privately \nby Felix Le Couppey in piano, Martin Marsick in violin and Augustin Savard in theory.\nAlthough Le Couppey recommended that she study at the Paris Conservatoire, the idea ran contrary \nto her father's sense of female decorum. At sixteen, Chaminade began to work seriously, composing a trio, opus 11, \nand training herself by &quot;writing whole scores over again&quot; -- producing her own versions of Gounod's Faust \nand Meyerbeer's Huguenots. At the same time she continued her general education -- on which her father insisted --.\n\nIn 1875, Chaminade attended the disastrous premiere of Bizet's Carmen.\nThis experience may have affected her own opera career, for in 1882, she directed and mounted \na private version of her opera-comique, La SÃƒÂ©villane, which was never staged, perhaps because of the\ndread instilled in her by the Carmen debacle. In 1880, at age eighteen, Chaminade\npresented her first recital, at the Salle Erard, devoted solely to her compositions.\nThe programming became the model for future concerts on tour.\n&quot;Ambroise Thomas [composer] was among the audience&quot;, she remembered.\n&quot;When he had heard some of my works, he said aloud: 'It is not a woman who composed these, it's a man!&quot;.\n\nThe 1880s ushered in a period of creativity and expansion into larger forms, \nincluding her first work for piano and orchestra, ConcertstÃƒÂ¼ck; her first symphony, Les Amazones; \nand her first ballet, CallirhoÃƒÂ«. A piano arrangement of the Scarf Dance from this ballet reportedly sold over a million copies.\nIn 1886 Chaminade's younger sister, Louise Henriette, became engaged to the pianist and composer \nMoritz Moszkowski, completing, as Chaminade wrote, &quot;the circle of musicians who were\non intimate terms at our home&quot;. However their father Hippolyte could not abide her marriage to both \na German and a Jew and broke off all ties with Louise.\n\nHippolyte's unexpected death the following year created severe financial pressures, \ncausing Chaminade to shift her artistic direction away from composing in the larger forms toward \nthe more commercially viable piano solos and songs. She was also spurred into a career\nas a concert pianist. Chaminade considered the piano &quot;the first of instruments&quot;. \n&quot;It is the one which forms the ear best, it is the most complete instrument; it is also the only\none that can be a reduction of the orchestra&quot;, she observed during an interview\nthat appeared in The Strand Musical Magazine.\n\nIn the early 1890s, Chaminade became internationally known as a pianist and composer. \nShe toured the Continent and from 1892, appearing annually in England, \nwhere she was received at Windsor Castle by Queen Victoria.\nShe was in demand for performances of her ConcertstÃƒÂ¼ck with orchestra \nand recitals of her piano pieces and songs. Audiences encountered a brunette,\nalthough... &quot;not very dark; her eyes are very large, round and brown, with that absent-minded \nlook in them so peculiar to artists; her hair...she wears short and curled; \nher underlip is rather large and protruding, and her chin very short. \nShe is of medium height and good build; her hands, however, are very delicate-looking\nthings, and when she plays you wonder where the strength comes from .... &quot;.\n\nIn the following decade Chaminade's popularity spread to the United States,\nwhere numerous Chaminade clubs formed, and leading publications including\nLadies&quot; Home Journal and The Etude featured her. Twice, \nshe was commissioned to compose piano works for publication in the Ladies&quot; Home Journal:\nFebruary 1906, New Debutante Waltz; November 1908, Rosemary: A Pastel.\n\nThe French composer was especially famous for her songs \n-- settings of romantic poetry to lyric themes gracefully supported by fluent, tasteful, \nfinely blended harmonies. Her songs were performed by opera singers Lillian Nordica, \nEmma CalvÃƒÂ©, and Nellie Melba with Chaminade at the piano.\n\n&quot;When I complete a work I am reluctant to have it published immediately,\npreferring to keep it hidden in a drawer...until I come across it again and find that I have confidence in it&quot;, \nshe observed in a conversation. &quot;If...it continues to please me I send it to the publisher&quot;.\nTo her family's surprise, on August 29, 1901, Chaminade married Louis Mathieu Carbonel, \na music publisher from Marseilles who was twenty years her senior. Prior to the marriage she\ninsisted on an agreement which stipulated that each person reside in his or her former home, \n(she at Le Vesinet, near Paris, and he in Marseilles), and although he could visit her periodically\nand accompany her on tours, there would be no sexual relations.\n\n\nIn the fall of 1908, Chaminade embarked on a highly successful United States tour \nthat began and ended in New York's Carnegie Hall. \nChaminade was greeted with a luncheon at the French Embassy, \nand received the next day at the White House by President and Mrs. Theodore Roosevelt. \nTo honor the French composer, the American violinist Maud Powell announced that her Trio \nwould perform Chaminade's piano trios during their 1908-09 United States tour.\n\nDuring the tour Chaminade was asked to speak about contemporary composers \nand while she praised Camille Saint-SaÃƒÂ«ns, she was less glowing about Debussy: \n&quot;Debussy, of course, depends very heavily on his orchestra for his effects, \nand his music is to my ears, well, ...insincere.&quot;\nChaminade's failure to embrace the rising waves of Impressionism \nwhich ultimately revolutionized the course of music history, washing away the genteel\ntide of &quot;La Belle Epoque,&quot; ultimately doomed her own compositions. \nHer professional decline was mirrored by a series of personal disasters \nbeginning in 1912 with the death of her mother, who had been her lifelong companion.\nChaminade, who had previously embraced mysticism, attended seances to summon her mother's spirit.\n\nDuring the mid-1920s Chaminade moved to Monte Carlo where she was\ndiagnosed with severe decalcification of her left foot. Two years later, \nthe composer's foot was amputated, but Chaminade, at 72, her spirit indomitable,\nrefused a wheelchair and became an invalid. At that time, in 1928, \nher last composition was published. For her 80th birthday in 1939 Chaminade \nreceived several thousand letters written at the urging of The Etude magazine. \n\nChaminade's life was ultimately a paradox. Although her music was\npraised for its &quot;feminine&quot; charm and grace, she herself stepped far outside the\nfeminine role dictated by her era in her career, her unique marriage, and her role\nas savvy businesswoman, &amp; with her prescient sense of the momentous changes\nawaiting women\n\nChaminade died on April 13, 1944, at the age of 86. \nIronically, given the multitude of solo piano works and songs\nshe wrote, the piece most known today is the Concertino for Flute, \nwhich is known to virtually all flutists. Time Magazine reported her death, \nironically ridiculing the art of the World's once most famous woman composer:\n\n&quot;In Monte Carlo last week death came to the most famous woman composer who ever lived .... \n[S] he died in comparative obscurity. The era that her fragile, saccharine little piano pieces.., \nrepresented had long since closed. Hers had been the age of rubber plants, \nstereoscopic views, and parlor trances .... &quot;.\n\nShelley's Ozymandias suggests that one never knows how the sands of Time will shift. \nAs they shifted for Georges Bizet, burying the critics who pilloried Carmen, \nperhaps the sands will shift once again for CÃƒÂ©cile Chaminade in the not too distant future.","torrent":{"xt":"urn:btih:1469918e07e4223eccb76687fcdcc216a5b2cc2f","amp;dn":"Cecile+Chaminade+-+The+Complete+Piano+Music++%283+CDs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1469918e07e4223eccb76687fcdcc216a5b2cc2f","infoHashBuffer":{"type":"Buffer","data":[20,105,145,142,7,228,34,62,204,183,102,135,252,220,194,22,165,178,204,47]},"announce":[],"urlList":[]}}