{"title":"La Maison en Petit Cubes","uid":4737932,"size":224462068,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:14d74a70e32fa405289f5e6d64bacd850d0d4f16&amp;dn=La+Maison+en+Petit+Cubes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jilaiaa","files":1,"time":1235403241,"description":"Like last year, I went to a special showing of the Oscar-nominated animated short films. However, unlike last year, in addition to the nominees, several &quot;commended films&quot; were also shown. In this review I'll make my predictions, though if it's anything like last year's choices, I'll probably once again pick the wrong shorts as my favorite for the award.\n\nThe film features an old man living alone in a town that has become submerged. His answer to the slowly rising water is to keep building on to his original home--like placing cubes on top of cubes to keep out the water. When he loses his favorite pipe, he dons scuba gear to retrieve it. As he descends and sees the earlier levels of his home (now submerged) he relives in his mind his life and loves. It's all very sweet and sentimental.\n\nI saw this film with a friend and he liked how the scuba diving was a great plot device. He loved the metaphorical aspects of the film. As for me, I wondered if perhaps there was actually a secondary reason for the submerged homes--to draw attention to global warming. He didn't see it and perhaps I am just reading this into the film, though I still suspect the film is trying to preach to the audience about this supposed threat.\n\nThe story was slow but very sweet--accentuated by a nice hand-drawn look and the gauze filter used to enhance the print along with evocative music. Oddly, while the film maker is apparently Japanese, the title is French and the art work doesn't really look Asian-inspired at all.\n","torrent":{"xt":"urn:btih:14d74a70e32fa405289f5e6d64bacd850d0d4f16","amp;dn":"La+Maison+en+Petit+Cubes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14d74a70e32fa405289f5e6d64bacd850d0d4f16","infoHashBuffer":{"type":"Buffer","data":[20,215,74,112,227,47,164,5,40,159,94,109,100,186,205,133,13,13,79,22]},"announce":[],"urlList":[]}}