{"title":"Welty, Eudora - La hija del optimista.pdf","uid":6840711,"size":864596,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:15b98f40eb53767e688ed967dbb5d45afaad1865&amp;dn=Welty%2C+Eudora+-+La+hija+del+optimista.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"L3ct0r","files":1,"time":1322154666,"description":"ÃƒÂ­tulo: La hija del optimista (1972) \nAutor: Eudora Welty\nEditorial: Impedimenta, 2009\nPÃƒÂ¡ginas: 232 p.\nISBN: 9788493711054\n\nUna historia profundamente humana, escrita de un modo tan sutil y evocador que parece un cuento de hadas.\n\n \n\nA pesar de tratarse de mi primera incursiÃƒÂ³n en la obra de Eudora Welty, tengo que reconocer que tenÃƒÂ­a grandes expectativas cuando comencÃƒÂ© a leer La hija del optimista.    Por decirlo de algÃƒÂºn modo, estaba buscando a una discÃƒÂ­pula de William Faulkner, con quien a menudo se la compara; alguien que formase parte de la tradiciÃƒÂ³n narrativa del sur de los Estados Unidos, con sus dramas tortuosos poblados de personajes atormentados y, en muchas ocasiones, grotescos. TratÃƒÂ¡ndose ademÃƒÂ¡s de una novela galardonada con el premio Pulitzer, el listÃƒÂ³n no podÃƒÂ­a estar mÃƒÂ¡s alto.\n\nComo suele suceder en estos casos, La hija del optimista no era lo que yo esperaba, pero su lectura, en lugar de suponer una decepciÃƒÂ³n, ha resultado ser un feliz hallazgo.  Porque aunque es cierto que el universo literario de esta autora forma parte de ese sur que tenemos en mente, con sus tradiciones y sus conflictos, no cabe duda de que Eudora Welty habla con voz propia, una voz sutil, mÃƒÂ¡gica y muy original.\n\nLaurel, una viuda de mediana edad, viaja desde Chicago, donde reside y trabaja, hasta su Mississippi natal para acompaÃƒÂ±ar a su padre, el juez McKelva, ya retirado, mientras se recupera de la operaciÃƒÂ³n quirÃƒÂºrgica a la que va a ser sometido.  AllÃƒÂ­ va a conocer a la nueva esposa de su padre, una arribista mÃƒÂ¡s joven que la propia Laurel, al tiempo que se enfrenta a la posibilidad de perder al ÃƒÂºltimo miembro vivo de su familia y, con ÃƒÂ©l, el ÃƒÂºnico vÃƒÂ­nculo que le une a su pasado.\n\n ","torrent":{"xt":"urn:btih:15b98f40eb53767e688ed967dbb5d45afaad1865","amp;dn":"Welty%2C+Eudora+-+La+hija+del+optimista.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15b98f40eb53767e688ed967dbb5d45afaad1865","infoHashBuffer":{"type":"Buffer","data":[21,185,143,64,235,83,118,126,104,142,217,103,219,181,212,90,250,173,24,101]},"announce":[],"urlList":[]}}