{"title":"Actual Window Manager 7.1 Final + patch","uid":7421064,"size":7056263,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:17c1f3143dac376198c874d03eeaae9d729497a2&amp;dn=Actual+Window+Manager+7.1+Final+%2B+patch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mrriser007","files":-1,"time":1341669818,"description":"Actual Window Manager - a software package of more than 50 innovative tools for the organization of desktop Windows, which increases the usability and performance with any application Windows. With Actual Window Manager you can organize the work environment for easy, quick and efficient execution of your tasks without being distracted by routine manipulation of the windows.\n\nAfter installing and running Actual Window Manager running in the background, providing:\n- Automatic execution of a wide range of activities over the windows, such as: minimize on startup / deactivation, launch at startup, shut down at startup, change the position / size when running, fix the position / size, change the priority of the startup / deactivation, and many others;\n- Fast access to hidden features of the system (&quot;Close the window to the notification area&quot;, &quot;Window always on&quot;, &quot;translucent window&quot;, etc.) through the additional title bar buttons or extra points in the system menu of the window;\n- Support for the mechanism of virtual desktops;\n- Additional funds for working with multiple monitors: emulating the Taskbar, click the &quot;Start&quot; and task switcher for each monitor, fast moving windows between monitors, the rapid deployment of a window on all monitors;\n- And much more!\n\nThe more windows you are able to control both, the better your work. In this situation, Actual Window Manager - an indispensable tool!\n","torrent":{"xt":"urn:btih:17c1f3143dac376198c874d03eeaae9d729497a2","amp;dn":"Actual+Window+Manager+7.1+Final+%2B+patch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17c1f3143dac376198c874d03eeaae9d729497a2","infoHashBuffer":{"type":"Buffer","data":[23,193,243,20,61,172,55,97,152,200,116,208,62,234,174,157,114,148,151,162]},"announce":[],"urlList":[]}}