{"title":"FS2004 Alphasim XB-70 Valkyrie (Second Attempt)","uid":3736201,"size":45118805,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:182452dfd0f303bf0de7510bff70e49799dac13a&amp;dn=FS2004+Alphasim+XB-70+Valkyrie+%28Second+Attempt%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"gdavej","files":1,"time":1183926385,"description":"The North Americal XB-70 Valkyrie ! A technological tour de force of epic proportions, the legend of the XB-70 Valkyrie very nearly surpasses the performance of this extraordinary aircraft. The AlphaSim take on this classic provides first and foremost straight-from-the-manual flight dynamics and fuel usage - like our SR-71, the Valkyrie is aimed at those who relish a technical challenge in their flightsim world. The authenticity of the flight model is matched by the carefully-crafted exterior model which follows all the unusual shapes and curves precisely. The real \\&amp;#039;tour de force\\&amp;#039; of the model has to be the panel and cockpit - every gauge is represented and pretty much every knob and switch. All text descriptions are from the actual XB-70 manual. The Valkyrie\\&amp;#039;s oddities are reproduced in the sim - the canards with animated trailing edges, the dramatic folding wingtips, the animated nose visor and the complex gear retraction sequence. The six animated afterburner nozzles blare out the deafening roar of the soundset and spew flames and smoke thanks to some amazing effects. Canard and wingroots both provide nice vapour trails under the right circumstances and a large cloud of custom tyre smoke lets you know you have arrived back on terra firma. One for the technical-minded and history buff alike ! For FS2004/FSX only. Filesize 44MB (FS9), 50MB (FSX).\n\nDownloaded from EMule\n\n","torrent":{"xt":"urn:btih:182452dfd0f303bf0de7510bff70e49799dac13a","amp;dn":"FS2004+Alphasim+XB-70+Valkyrie+%28Second+Attempt%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"182452dfd0f303bf0de7510bff70e49799dac13a","infoHashBuffer":{"type":"Buffer","data":[24,36,82,223,208,243,3,191,13,231,81,11,255,112,228,151,153,218,193,58]},"announce":[],"urlList":[]}}