{"title":"La storia in giallo 156 - Martin Lutero [Mp3 Ita] [TNTvillage]","uid":6716807,"size":67993518,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:188d045232a57deedad099536a1b4bec53489521&amp;dn=La+storia+in+giallo+156+-+Martin+Lutero+%5BMp3+Ita%5D+%5BTNTvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"darayava","files":1,"time":1317589111,"description":"La storia in giallo 156 - Martin Lutero [Mp3 Ita] [TNTvillage]\n\nLA STORIA IN GIALLO\n\nLa Storia in giallo  ÃƒÂ¨ un programma in onda su radio3 scritto e condotto da Antonella Ferrera, con la regia di Francesco Pannofino, regia del dibattito di Manuel de Lucia, musiche originali di Alessandro Molinari, assistenza tecnica di Fiore Liborio, cura di Diana Vinci.\nRedazione: Carlo Dellonte e Roberto Ritondale Paola Veneto\nDa poco ha subito il mutamento nel nome diventando: Cuore di Tenebra\n\nLa storia e le storie di personaggi celebri, le vicende tragiche o misteriose che hanno segnato I loro destini e a volte quelli di molti altri. Uomini della politica o del malaffare, uomini di fede o vissuti nel peccato, personalitÃƒÂ  borderline, mitomani o geni maledetti. Le devianze e I turbamenti di grandi artisti di tutti I tempi che hanno riversato nella loro opera la fatica o la follia del vivere.\nLa Storia in Giallo li racconta come in un film, attraverso le voci dei migliori doppiatori italiani. Dopo lo sceneggiato che catapulta l'ascoltatore al centro di una storia, segue l'intervista ad un personaggio della cultura che ne spiega e racconta dinamiche, curiositÃƒÂ  e risvolti inediti.\n\nLa storia in giallo - in onda il 18/03/2006\n\nMARTIN LUTERO\n\n\nNato in Germania nel novembre del 1483, spinto da una forte vocazione, Martin Lutero entrÃƒÂ² nel convento agostiniano di Ertfurt nel 1505. Pochi anni dopo, venne trasferito a Wittenberg, dove pubblicÃƒÂ² le sue proverbiali 95 tesi contro la vendita delle indulgenze. Dichiarato eretico, non solo rifiutÃƒÂ² di ritrattare le sue tesi, ma negÃƒÂ² il primato del papa e l'infallibilitÃƒÂ  dei concilii. \nSi aprÃƒÂ¬ cosÃƒÂ¬ una lunga controversia che spinse la chiesa a scomunicarlo e a bandirlo dall'impero. Trascorse gli ultimi anni traducendo in tedesco la sacra Bibbia, e morÃƒÂ¬, forse avvelenato, nel febbraio del 1546.\nLa voce di Martin Lutero ÃƒÂ¨ quella di Alberto Rossatti\nAntonella Ferrera intervista il filosofo della scienza Giulio Giorello.\n\nFile Details\n========================================\nName..........: 2006 - Martin Lutero.mp3\nFilesize......: 64Mb\n\nAudio Bitrate.: 192Kbps\nAudio Freq....: 44KHz\nAudio Channels: Mono\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:188d045232a57deedad099536a1b4bec53489521","amp;dn":"La+storia+in+giallo+156+-+Martin+Lutero+%5BMp3+Ita%5D+%5BTNTvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"188d045232a57deedad099536a1b4bec53489521","infoHashBuffer":{"type":"Buffer","data":[24,141,4,82,50,165,125,238,218,208,153,83,106,27,75,236,83,72,149,33]},"announce":[],"urlList":[]}}