{"title":"Frontiers in Space Series - Joseph A. Angelo","uid":8934787,"size":34371211,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:197e113fc7dacde9ea53abf85437bd2ded2b6910&amp;dn=Frontiers+in+Space+Series+-+Joseph+A.+Angelo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Agricola","files":-1,"time":1379538816,"description":"Frontiers in Space Series\n\nAuthor - Joseph A. Angelo\n\nFormat - pdf\n\n\nThe Frontiers in Space set uses space technology to introduce fundamental principles in mathematics, biology, chemistry, physics, and environmental science. This exciting and innovative approach teaches students how science, technology, and modern society are interlinked. Discussions of space technology will help to improve overall science and math literacy, as well as open up a wide range of exciting 21st-century career choices for students. The author also presents students with key information from a variety of space-related science and math educational materials sponsored by such government agencies as NASA, the National Oceanic and Atmospheric Administration, the U.S. Department of Defense, and many others. Each illustrated volume includes black-and-white photographs and line illustrations, inquiry questions (with answers), special sidebar materials, and recommended activities. Capsule biographies of several space exploration visionaries and scientists are included in each volume to let readers appreciate the human dimension of each specific area of space technology. This set provides students with the essentials to understanding space and its many possibilities for the future.","torrent":{"xt":"urn:btih:197e113fc7dacde9ea53abf85437bd2ded2b6910","amp;dn":"Frontiers+in+Space+Series+-+Joseph+A.+Angelo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"197e113fc7dacde9ea53abf85437bd2ded2b6910","infoHashBuffer":{"type":"Buffer","data":[25,126,17,63,199,218,205,233,234,83,171,248,84,55,189,45,237,43,105,16]},"announce":[],"urlList":[]}}