{"title":"Evernote 3.5.2.1764 [Multi](soft).","uid":5465992,"size":40679872,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:199635577781326a40c59d8372de1ea686c70638&amp;dn=Evernote+3.5.2.1764+%5BMulti%5D%28soft%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zurera","files":1,"time":1269621130,"description":"34.6 MB | Windows XP/2003/Vista/7 | \n\nEvernote es un excelente bloc de notas en el que podrÃƒÂ¡s guardar todo tipo de informaciÃƒÂ³n respetando su formato original: anotaciones personales, fragmentos de pÃƒÂ¡ginas web, direcciones de correo electrÃƒÂ³nico, trazos libres en pantalla, citas, esquemas o cualquier cosa que puedas copiar y pegar con el Portapapeles de Windows.\n\nEl entorno de Evernote incluye todas las herramientas necesarias para aÃƒÂ±adir tantas notas como te sean necesarias, clasificarlas en diferentes categorÃƒÂ­as, aÃƒÂ±adirles etiquetas y lanzar bÃƒÂºsquedas entre las notas disponibles. AdemÃƒÂ¡s, Evernote ofrece la posibilidad de publicar las notas en tu propio espacio web. OpciÃƒÂ³n muy ÃƒÂºtil para si quieres compartir tus notas con otros usuarios o acceder a ellas desde cualquier ordenador.\n\nEvernote utiliza un sistema de indexaciÃƒÂ³n previa de notas que permite agilizar las bÃƒÂºsquedas considerablemente. Basta con introducir una palabra clave en el buscador del programa para que, en un tiempo rÃƒÂ©cord, el programa liste en pantalla todas las notas relacionadas.\n\n\n\nLas notas guardadas en Evernote pueden ser en formato de texto plano o enriquecido. Soporta hipervÃƒÂ­nculos, fotos, tablas y cualquier estructura en HTML que copies de una pÃƒÂ¡gina de Internet o un documento.\n\nGracias a sus funciones adicionales, EverNote permite enviar por email cualquiera de las notas disponibles, imprimirlas con una simple selecciÃƒÂ³n, cifrar textos, reconocer trazos a mano alzada, sincronizar tus notas con tu espacio privado en Internet en cualquier momento y personalizar la apariencia del programa.","torrent":{"xt":"urn:btih:199635577781326a40c59d8372de1ea686c70638","amp;dn":"Evernote+3.5.2.1764+%5BMulti%5D%28soft%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"199635577781326a40c59d8372de1ea686c70638","infoHashBuffer":{"type":"Buffer","data":[25,150,53,87,119,129,50,106,64,197,157,131,114,222,30,166,134,199,6,56]},"announce":[],"urlList":[]}}