{"title":"Grant Hart - The Argument [2013] [FLAC/WEB]","uid":8742790,"size":510708789,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:19ee1c50e0df02e1d5584b231f4c1326b5e2a180&amp;dn=Grant+Hart+-+The+Argument+%5B2013%5D+%5BFLAC%2FWEB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":20,"time":1374835257,"description":"Artist: Grant Hart\nRelease: The Argument\nReleased: 2013\nLabel: EMI Music Distribution\nCatalog#: \nFormat: FLAC / WEB\n[color=blue]Country: USA\nStyle: POP ROCK\n\n1. Out of Chaos (01:58)\n2. Morningstar (04:19)\n3. Awake, Arise! (05:16)\n4. If We Have the Will (03:21)\n5. I Will Never See My Home (04:36)\n6. I Am Death (02:33)\n7. Sin (02:57)\n8. Letting Me Out (03:02)\n9. Is the Sky the Limit? (03:39)\n10. Golden Chain (02:41)\n11. So Far From Heaven (03:35)\n12. Shine, Shine, Shine (04:33)\n13. It Isn't Love (04:15)\n14. War In Heaven (04:31)\n15. Glorious (03:18)\n16. (It Was a) Most Disturbing Dream (03:59)\n17. Underneath the Apple Tree (03:09)\n18. The Argument (05:56)\n19. Run For the Wilderness (03:09)\n20. For Those Too High Aspiring (03:40)\n\nNever let it be said that Grant Hart lacks ambition. He may be erratic, his solo career progressing in fits and starts, but even then it didn't take much for him to take another stab at a rock opera or other long-form conceptual pieces, something that, for all his restlessness, Hart's former bandmate Bob Mould often resisted throughout his own solo career. Hart righted himself in 2009 with Hot Wax, not just his first album in a decade but his strongest collection of songs, and that renaissance continues on The Argument, a dense, lengthy song cycle based partially on John Milton's Paradise Lost and partially on William S. Burroughs' unpublished sci-fi story Lost Paradise. If those inspirations sound literary and vaguely intimidating, they nonetheless hint at the odd, thrilling journey Hart offers here. Burroughs and sci-fi suggest the glory days of the '70s and, sure enough, there are heavy hints of David Bowie throughout The Argument, but the spare production -- often it seems as if the singer/guitarist/drummer is the only musician, he's just overdubbed himself endlessly -- means this has a spacy spooky quality, not a hardcore glam crunch. Hart doesn't shy away from either pop or brevity -- many songs clock in under three minutes, &quot;Sin&quot; shuffles like prime music hall Ray Davies, &quot;Letting Me Out&quot; is as good a Buddy Holly homage as ever has been written -- but the overall construction of the album purposely keeps the listener on edge. The Argument creeps into view, hits its melodic stride halfway through, then dissipates into mystery. It is an album that raises questions but deliberately evades answers, an album that requires concentration and thought but, for as much as it demands of the listener, The Argument never seems like work, as Hart is thoroughly engaged, delivering songs that work on their own terms but purposefully add up to an intriguing, tantalizing enigma.","torrent":{"xt":"urn:btih:19ee1c50e0df02e1d5584b231f4c1326b5e2a180","amp;dn":"Grant+Hart+-+The+Argument+%5B2013%5D+%5BFLAC%2FWEB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19ee1c50e0df02e1d5584b231f4c1326b5e2a180","infoHashBuffer":{"type":"Buffer","data":[25,238,28,80,224,223,2,225,213,88,75,35,31,76,19,38,181,226,161,128]},"announce":[],"urlList":[]}}