{"title":"Batman 426-429 A Death In The Family (1988-1989, Dgtl, D-E)","uid":9520262,"size":146669404,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:1a13e6411739e2e13b8903c2e63347a24d70180f&amp;dn=Batman+426-429+A+Death+In+The+Family+%281988-1989%2C+Dgtl%2C+D-E%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"VikTSlick","files":-1,"time":1390615342,"description":"Jason Todd never had a chance. He never got a fair shake. There have been many reasons theorized over the years as to why the second man to don the Robin mask was so unpopular - maybe the origin was rushed, maybe he too much of a brat, maybe he just wasn't Dick Grayson, etc. - but the fact remains that when DC took the bold step of allowing the readers to decide Todd's fate (via a call-in hotline), the readers responded with a definite thumbs down, of the Roman variety. As a result, Todd was violently beaten with a crowbar by the Joker and left for dead in an exploding house, with his mother present as well. Credit must be given to DC for following through on what was at the time as shocking a development as the death of Gwen Stacy was in the 70's. Certainly, it was not likely that Batman's sidekick would die, and even harder to imagine it being so graphic. These four issues cover the famous (infamous?) story, one which had a profound effect on the Batman family for years and even now continues to haunt Bruce Wayne and the resurrected Jason Todd - as seen recently in the spiritual follow-up, Death of the Family. Writer Jim Starlin plays it straight - there are no pulled punches, and that is equally true of Jim Aparo's art and Mike DeCarlo's inks. The panels that more of less end Todd's life are justifiably considered classic now, due to their stark brutality. This edition is presented in remastered digital courtesy of Danger-Empire. Please seed, and...enjoy seems the wrong word, no? :-(","torrent":{"xt":"urn:btih:1a13e6411739e2e13b8903c2e63347a24d70180f","amp;dn":"Batman+426-429+A+Death+In+The+Family+%281988-1989%2C+Dgtl%2C+D-E%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a13e6411739e2e13b8903c2e63347a24d70180f","infoHashBuffer":{"type":"Buffer","data":[26,19,230,65,23,57,226,225,59,137,3,194,230,51,71,162,77,112,24,15]},"announce":[],"urlList":[]}}