{"title":"Operation Snow: How a Soviet Mole Triggered Pearl Harbor","uid":10493067,"size":951404,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1a221b4e4fc7ea17f6c72c60a1af9c68759e7a66&amp;dn=Operation+Snow%3A+How+a+Soviet+Mole+Triggered+Pearl+Harbor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sakstroy","files":-1,"time":1404572868,"description":"Operation Snow - How a Soviet Mole in FDR's White House Triggered Pearl Harbor (2012) by John P. Koster.pdf\n\nIn &quot;Operation Snow: How a Soviet Mole in FDR's White House Triggered Pearl Harbor&quot;, author and World War II magazine columnist John Koster provides incontestable proof that Russia was a driving force behind Pearl Harbor. Americans have long debated the cause of the December 7, 1941 bombing of Pearl Harbor. Many have argued that the attack was a brilliant Japanese military coup, or a failure of U.S. intelligence agencies, or even a conspiracy of the Roosevelt administration. But despite the attention historians have paid to the bombing of Pearl Harbor, the truth about that fateful day has remained a mystery-until now. In &quot;Operation Snow: How a Soviet Mole in FDR's White House Triggered Pearl Harbor&quot;, author John Koster uses recently declassified evidence and never-before-translated documents to tell the real story of the day that FDR memorably declared would live in infamy, forever. &quot;Operation Snow&quot; shows how Joseph Stalin and the KGB used a vast network of double-agents and communist sympathizers - most notably, Harry Dexter White - to lead Japan into war against the United States, demonstrating incontestable Soviet involvement behind the bombing of Pearl Harbor. A thrilling tale of espionage, mystery and war, &quot;Operation Snow&quot; will forever change the way we think about Pearl Harbor and World War II.\n\n350 pages\nPublisher: Regnery History; 1 edition (September 17, 2012)\nLanguage: English\nISBN-10: 1596983221\nISBN-13: 978-1596983229","torrent":{"xt":"urn:btih:1a221b4e4fc7ea17f6c72c60a1af9c68759e7a66","amp;dn":"Operation+Snow%3A+How+a+Soviet+Mole+Triggered+Pearl+Harbor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a221b4e4fc7ea17f6c72c60a1af9c68759e7a66","infoHashBuffer":{"type":"Buffer","data":[26,34,27,78,79,199,234,23,246,199,44,96,161,175,156,104,117,158,122,102]},"announce":[],"urlList":[]}}