{"title":"Manhattan Jazz Quintet - 1986 - Live at Pit Inn FLAC","uid":8657545,"size":471168309,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1b14eb40773e3fcbbb9c4734f02edeacccaa4ed5&amp;dn=Manhattan+Jazz+Quintet+-+1986+-+Live+at+Pit+Inn+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1373241358,"description":"Manhattan Jazz Quintet - 1986 - Live at Pit Inn\n\nThe Manhattan Jazz Quintet are an unusual group in that they very rarely perform as a unit in the United States (much less Manhattan) but have been a major hit in Japan, both for their recordings and occasional tours. Originally comprised of leader/pianist David Matthews, trumpeter Lew Soloff, tenor saxophonist George Young, bassist Eddie Gomez, and drummer Steve Gadd, the band (which emphasizes straight-ahead hard bop swinging) first came together in 1983 at the suggestion of the King label and the top Japanese jazz magazine Swing Journal. To everyone's surprise, its first recording (simply called Manhattan Jazz Quintet) became such a big seller that it was awarded Swing Journal's annual 1984 Gold Disk Award as the number one album in Japan. Several years later the group broke up when Gomez and Gadd needed more time to pursue their individual projects -- and all of the quintet members later became quite successful in their own careers -- but this edition of the MJQ recorded reunions in 1990 (which found John Scofield guesting on a few selections) and in 1993. Victor Lewis replaced Gadd that year, and subsequently Young was replaced by Andy Snitzer and Gomez by Charnett Moffett. The Manhattan Jazz Quintet recorded primarily for King in Japan (those dates were mostly made available in the U.S. by Projazz) during the 1980s, although they cut some later recordings -- among the comparative very few that actually took place in Manhattan! -- for the Sweet Basil label. During the new millennium The Manhattan Jazz Quintet have recorded regularly for Video Arts. (AllMusic)\n\nTrack list:\n01 - So this\n02 - Angel eyes\n03 - 'round midnight\n04 - Misticized\n05 - S.U. blues\n06 - Autumn leaves\n07 - Rosario\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:1b14eb40773e3fcbbb9c4734f02edeacccaa4ed5","amp;dn":"Manhattan+Jazz+Quintet+-+1986+-+Live+at+Pit+Inn+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b14eb40773e3fcbbb9c4734f02edeacccaa4ed5","infoHashBuffer":{"type":"Buffer","data":[27,20,235,64,119,62,63,203,187,156,71,52,240,46,222,172,204,170,78,213]},"announce":[],"urlList":[]}}