{"title":"Septic Death - Attention  mp3  320k  a2k  1990","uid":10832260,"size":95261043,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1ba1442543c5f3d8a5f183968a0bff9a5dbfedb9&amp;dn=Septic+Death+-+Attention++mp3++320k++a2k++1990&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"analogkid6103","files":24,"time":1408634655,"description":"Septic Death - Attention  mp3  320k  a2k  1990 What we got...Septic Death was a thrashcore band fronted by artist Brian &quot;Pushead&quot; Schroeder on vocals. Septic Death's music became a major influence on bands like Integrity, Von, Citizens Arrest, Infest, Rorschach and many other bands tied to the hardcore punk and extreme metal scenes. The band played only a few shows during its active years (1981 to 1986), mostly in Boise, Idaho.\n\nAlong with Schroeder, the band consisted of Paul Birnbaum on drums, Mike Matlock on bass, and Jon Taylor on guitar.\n\n&quot;Septic death's songs deal mainly with fear and paranoia, the mental state of a person and how it functions. A few songs deal with current issues, but those are so depressing just to read the paper, why bring more attention than a song? If you seek to bring out solutions or terror to open eyes of fear, that is well constructed. But just complaints do not have meanings of knowledge. Strength away from fear or the acceptance of fear and what it creates makes it wiser for the mind... not the person who sings the song he writes but lives in terror of them. Open the eyes and let the enjoyment in; the awareness is essential.(extracted from Maximum Rock'N'Roll).&quot;\n\n&quot;...religions were formed to create a god, and god was created, so you wouldn't fear death, and the reality of dying is SEPTIC DEATH (extracted from MRR).&quot;\n\nFans of Septic Death such as Dwid Hellion (of Integrity) often characterized their sound as &quot;horror hardcore&quot; (as stated in Integrity's &quot;Sliver In The Hands Of Time&quot;) due to the artwork, lyrics and content of their songs.\n\nThe Quality and Scarcity of the Septic Death releases have inspired a number of well made professional bootlegs, the most recent being a discography titled &quot;Zorlac Anthology&quot;. The double bootleg cd was released in the UK and limited to only 100 copies. An official Septic Death discography titled &quot;Chumoku&quot; has been in production since 2000 for San Francisco based Prank Records, with Pushead preparing all new artwork for the release. Some of the artwork was featured on the cover of Juxtapose magazine's &quot;black and White' issue. See Files for Tracklist","torrent":{"xt":"urn:btih:1ba1442543c5f3d8a5f183968a0bff9a5dbfedb9","amp;dn":"Septic+Death+-+Attention++mp3++320k++a2k++1990","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ba1442543c5f3d8a5f183968a0bff9a5dbfedb9","infoHashBuffer":{"type":"Buffer","data":[27,161,68,37,67,197,243,216,165,241,131,150,138,11,255,154,93,191,237,185]},"announce":[],"urlList":[]}}