{"title":"Flak German AntiAircraft Defenses - 1914-1945","uid":4853124,"size":5951505,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1bdf632b781313104befd5143a98b1fea7d3f3f2&amp;dn=Flak+German+AntiAircraft+Defenses+-+1914-1945&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"philmccrevice","files":1,"time":1239956294,"description":"Air raid sirens wail, searchlight beams flash across the sky, and the night is aflame with tracer fire and aerial explosions, as Allied bombers and German anti-aircraft units duel in the thundering darkness. Such &quot;cinematic&quot; scenes, played out with increasing frequency as World War II ground to a close, were more than mere stock material for movie melodramas. As Edward Westermann reveals, they point to a key but largely unappreciated aspect of the German war effort that has yet to get its full due. \nLong the neglected stepchild in studies of World War II air campaigns, German flak or anti-aircraft units have been frequently dismissed by American, British, and German historians (and by veterans of the European air war) as ineffective weapons that wasted valuable matÃƒÂ©riel and personnel resources desperately needed elsewhere by the Third Reich. Westermann emphatically disagrees with that view and makes a convincing case for the significant contributions made by the entire range of German anti-aircraft defenses. \n\nDuring the Allied air campaigns against the Third Reich, well over a million tons of bombs were dropped upon the German homeland, killing nearly 300,000 civilians, wounding another 780,000, and destroying more than 3,500,000 industrial and residential structures. Not surprisingly, that aerial Armageddon has inspired countless studies of both the victorious Allied bombing offensive and the ultimately doomed Luftwaffe defense of its own skies. By contrast, flak units have virtually been ignored, despite the fact that they employed more than a million men and women, were responsible for more than half of all Allied aircraft losses, forced Allied bombers to fly far above high-accuracy altitudes, and thus allowed Germany to hold out far longer than it might have otherwise. \n\nWestermann's definitive study sheds new light on every facet of the development and organization of this vital defense arm, including its artillery, radar, searchlight, barrage balloon, decoy sites, and command components. Highlighting the convergence of technology, strategy, doctrine, politics, and economics, Flak also provides revealing insights into German strategic thought, Hitler's obsession with micromanaging the war, and the lives of the members of the flak units themselves, including the large number of women, factory workers, and even POWs who participated. \n","torrent":{"xt":"urn:btih:1bdf632b781313104befd5143a98b1fea7d3f3f2","amp;dn":"Flak+German+AntiAircraft+Defenses+-+1914-1945","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1bdf632b781313104befd5143a98b1fea7d3f3f2","infoHashBuffer":{"type":"Buffer","data":[27,223,99,43,120,19,19,16,75,239,213,20,58,152,177,254,167,211,243,242]},"announce":[],"urlList":[]}}