{"title":"Folder Lock 7.2.2 Full + Serials (Alien)","uid":8616328,"size":9616135,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1c57a5b17a1516aef7599943dc6c58dcb824c764&amp;dn=Folder+Lock+7.2.2+Full+%2B+Serials+%28Alien%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Alien119","files":3,"time":1372261203,"description":"Folder Lock 7.2.2 Full\n\nFolder Lock is fast file-security software that can password-protect, lock, hide, and encrypt any number of files, folders, drives, pictures, and documents in seconds. Locked files are undeletable, unrenamable, unmovable, hidden, and inaccessible. You can lock, scramble, or encrypt depending on speed and security. Folder Lock is fully portable, so you can protect your files on USB flash drives, disks, CD-RWs, notebooks, and hard disks, and it doesn't require installation on another PC. Folder Lock protects files in Windows, DOS, and Safe modes, even when you change your OS or boot from a disk. Folder Lock doesn't let you delete its own program folder, and it can't be uninstalled without the correct password. Additional options include Stealth Mode, Hacker Attempt Monitoring, Shred files, AutoLock, Auto Shutdown PC, Lock your PC, Erase PC tracks, 256-bit Blowfish Encryption and Context Menu in Explorer.\n\nEncrypt Files\nEncrypt your personal files using 256-bit on-the-fly encryption technology totally dynamic and fool-proof.\n\nProtect USB / CD\nConvert your encrypted storages into executables and take your portable drives anywhere.\n\nMake Wallets\nStore sensitive information in encrypted form. A safe haven for private info like Credit Cards and Bank Accounts.\nRun Application in complete Stealth.\nDon't let anyone know you ever installed Folder Lock on your PC.\n\nPassword Security\nRestrict access to various parts of the application with use of admin level master password.\n\nAuto Protection\nSet inactivity based security policy in order to secure everything when you're away from your PC.\n\nHack Security\nDon't let hackers use dictionary attacks. Monitor, control and perform actions on incorrect password attempts.\n\nShred Files\nShred and permanently delete restorable files, folders and drives and even empty hard drive space.\n\nLock Files\nProtect important files from unwanted access by blocking visibility or access to files, folders and drives.\n\nBackup Online\nBackup all your encrypted files automatically to an online storage and easily restore it back.\n\n\nWhat's New in Folder Lock 7.2.2\n(June, 21st 2013)\n\nThis update resolves a minor glitch that was related to decrypting of master password. In addition, encryption for the master password has further been fortified to ensure data security for the end user.\n\n\n\nOS : Windows 8 / 7 / Vista / XP (32/64-bit)\n\n\nLanguage : English\n\n\nHome Page - http://www.newsoftwares.net/folderlock/\n\n\nTested And Working...\nScanned (With Kaspersky) And 100% Clean...\n","torrent":{"xt":"urn:btih:1c57a5b17a1516aef7599943dc6c58dcb824c764","amp;dn":"Folder+Lock+7.2.2+Full+%2B+Serials+%28Alien%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c57a5b17a1516aef7599943dc6c58dcb824c764","infoHashBuffer":{"type":"Buffer","data":[28,87,165,177,122,21,22,174,247,89,153,67,220,108,88,220,184,36,199,100]},"announce":[],"urlList":[]}}