{"title":"Ron Rash - Above the Waterfall (retail).epub","uid":13067912,"size":437127,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1cae1f2f6fcb85356d2a68dfd4ed1a8917017e80&amp;dn=Ron+Rash+-+Above+the+Waterfall+%28retail%29.epub&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mr_mando","files":1,"time":1450762994,"description":"Above the Waterfall - Ron Rash\r\n\r\nIn this poetic and haunting tale set in contemporary Appalachia, New York Times bestselling author Ron Rash illuminates lives shaped by violence and a powerful connection to the land\r\n\r\nLes, a longtime sheriff, is just weeks from retirement when he is forced to contend with the ravages of crystal meth—and his own corruption—in his small Appalachian town. Meanwhile, Becky, a park ranger with a harrowing past, finds solace amid the lyrical beauty of the North Carolina mountains.\r\n\r\nEnduring the mistakes and tragedies that have indelibly marked them, they are drawn together by a reverence for the natural world. When an embittered elderly local is accused of poisoning a trout stream on the property of a nearby resort, Les and Becky are plunged into deep and dangerous waters, forced to navigate currents of disillusionment and betrayal that will force them to question themselves and test their tentative bond—and threaten to carry them over the edge.\r\n\r\nEchoing the lapsarian beauty of William Faulkner and the spiritual isolation of Carson McCullers, Above the Waterfall demonstrates the prodigious talent of an author hailed as &quot;a gorgeous, brutal writer&quot; (Richard Price) and &quot;one of the best American novelists of his day&quot; (Janet Maslin, New York Times). Unforgettable and evocative, tragic and indelible, Above the Waterfall is a breathtaking achievement from a literary virtuoso","torrent":{"xt":"urn:btih:1cae1f2f6fcb85356d2a68dfd4ed1a8917017e80","amp;dn":"Ron+Rash+-+Above+the+Waterfall+%28retail%29.epub","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cae1f2f6fcb85356d2a68dfd4ed1a8917017e80","infoHashBuffer":{"type":"Buffer","data":[28,174,31,47,111,203,133,53,109,42,104,223,212,237,26,137,23,1,126,128]},"announce":[],"urlList":[]}}