{"title":"Ian Gillan - Cherkazoo And Other Stories [320k MP3]","uid":11558788,"size":189238828,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1e32e380d4d06284dd5357b9c806c19d3b5147d7&amp;dn=Ian+Gillan+-+Cherkazoo+And+Other+Stories+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"smbdownload","files":-1,"time":1416855287,"description":"As perhaps the crowning glory in Spitfire/Eagle's extensive Ian Gillan reissue series, Cherkazoo &amp; Other Stories is at once both the most eagerly anticipated volume by hardcore fans and the lone disc in the series to appeal to a larger audience than Gillan fanatics. Nothing on the collection has been previously been released, yet it is all legendary among Deep Purple and Gillan followers. The first eight tracks (six songs, two dialogues) of the compilation are all taken from the previously unreleased soundtrack to Cherkazoo, a children's story Gillan labored over in the early '70s as Deep Purple were riding the crest of their popularity. The remainder of the record is devoted to sessions Gillan cut between his departure from Purple in 1973 and the beginning of his solo career in 1976. Both items are equally sought-after among collectors, but outside listeners will undoubtedly be taken with Cherkazoo, a delightful collection of psychedelic pop and whimsical British music hall numbers. These are utterly charming songs, sounding like Sgt. Pepper's-era Beatles or early pre-Space Oddity Bowie, and having all the appeal of the best obscure British psychedelia: high praise indeed. The early solo sessions find Gillan in more familiar territory, namely hard rock. That doesn't mean it's predictable, however. On these songs, he's willing to play around, whether that means returning to early inspirations (including a fine cover of Elvis Presley's &quot;Trying to Get to You&quot;), or stretching out with organ solos or dipping into orchestrated pop, such as &quot;Music in My Head,&quot; which sounds like a great forgotten AM radio hit. There's more variety here than on Machine Head, yet it never sounds as contrived or forced as early Ian Gillan Band records occasionally do. It won't necessarily satiate those who just love the psychedelic pop that dominates the first half of the compilation, nor will it please those who just want hard rock, but all of the music on Cherkazoo &amp; Other Stores makes a convincing case for Gillan's musical strengths. As a matter of fact, it's one of the most satisfying records in his catalog. \n\nTrack Listing [320k MP3]\n\n    Intro (1:19)\n    Cherkazoo (Ian Gillan, Roger Glover) (2:04)\n    Monster in Paradise (Ian Gillan, Roger Glover, John Gustafson) (2:34)\n    The Bull of Birantis (Ian Gillan) (4:08)\n    Intro (2:16)\n    Hogwash (Ian Gillan, Roger Glover) (2:44)\n    Driving Me Wild [Take One] (Ian Gillan) (2:17)\n    Donkey Ride Dream (Ian Gillan) (2:24)\n    Trying to Get to You (Rose Marie McCoy, Charlie Singleton) (2:59)\n    Ain't That Lovin' You Baby (Jimmy Reed) (3:42)\n    Driving Me Wild [Fast Take] (Ian Gillan) (2:34)\n    Music in My Head (Ian Gillan) (4:47)\n    You Make Me Feel So Good (Ian Gillan, Dave Wintour) (4:41)\n    She Called Me Softly (Ian Gillan) (4:44)\n    Driving Me Wild [Take Three] (Ian Gillan) (3:13)\n    You Led My Heart Astray (Ian Gillan) (5:53)\n    A Little Share of Plenty (Ian Gillan) (7:05)\n    Night &amp; Day (Ian Gillan, Dave Wintour) (5:32)\n    [Untitled Hidden Track] (2:49)","torrent":{"xt":"urn:btih:1e32e380d4d06284dd5357b9c806c19d3b5147d7","amp;dn":"Ian+Gillan+-+Cherkazoo+And+Other+Stories+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e32e380d4d06284dd5357b9c806c19d3b5147d7","infoHashBuffer":{"type":"Buffer","data":[30,50,227,128,212,208,98,132,221,83,87,185,200,6,193,157,59,81,71,215]},"announce":[],"urlList":[]}}