{"title":"The Unicorn Tapestries (Art Ebook).pdf","uid":12873606,"size":90250942,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1e365cc4e2385e92d12fc75ff93947c2e4d8ba6a&amp;dn=The+Unicorn+Tapestries+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1448920230,"description":"Freeman, Margaret B., &quot;The Unicorn Tapestries&quot;\r\nMetropolitan | 1976 | ISBN 0870991477 | English | PDF | 254 pages | 86.07 Mb\r\n\r\nThe author, in an informative style, conveys all that is known or can be reasonably believed about the commissioning and the manufacture, all that can safely be conjectured about the original owners.\r\n\r\nOn permanent exhibition at The Cloisters, in New York, seven late Gothic tapestries portray the Hunt of the Unicorn. Like the unicorn himself, they are one of the marvels of the world, for in no other work of art anywhere is the pursuit and capture of this magical creature presented in such astonishing detail, with such command of pictorial verisimilitude and symbolic intention.\r\n\r\nIn a duality not rare in the late Middle Ages, the imagery is both secular and religious. The references to love, matrimonial fidelity, and desire for progeny are understandable in an ensemble that may have celebrated a marriage. But the unicorn, at the same time, is Christ, and the compositions reflect the Incarnation, the Passion, and the Resurrection. Gabriel, the angel of the Annunciation, is one of the hunters: the unicorn loses his fierceness in the lap of the Virgin Mary; a thorny crown encircles his horn and neck when he is slain; and then the glorious creature is miraculously alive again and chained to a pomegranate tree, simultaneously an image of the risen Christ and of the lover-bridegroom secured by his adored lady","torrent":{"xt":"urn:btih:1e365cc4e2385e92d12fc75ff93947c2e4d8ba6a","amp;dn":"The+Unicorn+Tapestries+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e365cc4e2385e92d12fc75ff93947c2e4d8ba6a","infoHashBuffer":{"type":"Buffer","data":[30,54,92,196,226,56,94,146,209,47,199,95,249,57,71,194,228,216,186,106]},"announce":[],"urlList":[]}}