{"title":"A.Horowitz - Cyngiel Smierci [PL]","uid":12800391,"size":547157269,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1f1160771006ab7e37e61c52a6ec2e885e4c276a&amp;dn=A.Horowitz+-+Cyngiel+Smierci+%5BPL%5D+MP3%40128&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"everdarksoul","files":57,"time":1448046010,"description":"Audiobook PL - 55 części /   \r\nrozmiar: 521 MB / czas: 09:27:14\r\nczyta: Andrzej Ferenc\r\n\r\nWielki powrót Jamesa Bonda! Anthony Horowitz w swojej nowej książce kontynuuje opowieść o najseksowniejszym i najbardziej skutecznym agencie Jej Królewskiej Mości, o kryptonimie 007. W książce znajdziemy też dużo oryginalnych fragmentów, autorstwa &quot;ojca&quot; Bonda - Iana Fleminga.\r\n\r\nZarys fabuły:\r\nJames Bond wraca do Londynu po pokonaniu Aurica Goldfingera. Towarzyszy mu piękna i niebezpieczna Pussy Galore, która pomogła mu odnieść to zwycięstwo.\r\nTymczasem nasila się rywalizacja naukowo-techniczna między Związkiem Radzieckim a Zachodem. Smiersz planuje akcję sabotażową, podczas wyścigów samochodowych w Niemczech Zachodnich. Bond przypadkowo widzi spotkanie rosyjskiego kierowcy na usługach Smierszu z tajemniczym koreańskim milionerem i dochodzi do wniosku, że jest to ledwie wstęp do nowego planu radzieckiej organizacji. Milioner-sierota, ofiara wojny koreańskiej, ma osobiste powody, by przyłożyć rękę do ostatecznego upadku Stanów Zjednoczonych. Czy pomoże Rosjanom rozgromić Zachód?\r\n\r\nNa całym świecie sprzedano ponad 100 milionów książek z serii o Jamesie Bondzie, bohater ten doczekał się też pokaźnej ilości ekranizacji swoich przygód, w których w jego rolę wcielali się najznakomitsi aktorzy.\r\nAnthony Horowitz oddaje w ręce czytelników powieść w niczym nieustępującą dokonaniom nawet samego Iana Fleminga - pełną nowych przygód, ale i znajomych twarzy - takich jak M czy panna Moneypenny. Akcja toczy się błyskawicznie, a świat szybkich samochodów, pięknych kobiet i bezlitosnych złoczyńców wciąga czytelnika bez reszty","torrent":{"xt":"urn:btih:1f1160771006ab7e37e61c52a6ec2e885e4c276a","amp;dn":"A.Horowitz+-+Cyngiel+Smierci+%5BPL%5D+MP3%40128","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f1160771006ab7e37e61c52a6ec2e885e4c276a","infoHashBuffer":{"type":"Buffer","data":[31,17,96,119,16,6,171,126,55,230,28,82,166,236,46,136,94,76,39,106]},"announce":[],"urlList":[]}}