{"title":"[PC]-Tom.Clancys.H.A.W.X-.","uid":4779650,"size":6550885798,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1fd3ff7cb6f58105ce8025a663a4003392622495&amp;dn=%5BPC%5D-Tom.Clancys.H.A.W.X-.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ESPACONSOLAS","files":1,"time":1237334045,"description":"Tom Clancy's H.A.W.X / UbiSoft RELEASE DATE : 17-03-2009 PROTECTION : Nothing GAME TYPE : Flight Action DISKS : 1 DVD In the year 2012, the era of the nation-state is drawing to a close. The nations of the future increasingly have turned to private military companies, also known as PMCs, to aid in their defense. These elite mercenaries provide clear benefits to the nations that engage them, but they also tend to take a rather lax view of the law. Even so, the Reykjavik Accords have authorized the PMCs' right to serve in every aspect of military operations. As the PMCs' role is further legitimized and their influence grows, concerns have begun to mount. Have the PMCs been granted too much power? And, if so, what will the consequences be for the world? Tom Clancy's HAWX puts you in the pilot's seat for revolutionary aerial combat action in an all-too-realistic world of the near-future. Engage in intense high-altitude warfare, complete with cutting-edge technology and devastating firepower. Become an elite pilot of the future through use of the game's unique Enhanced Reality System, which provides a incredibly realistic flight experience, including radars and incoming missile detection, weapons trajectory control, an anti-crash system and more. Take the throttle of more than 50 authentic aircraft as you prove your skills in dogfights over war-scarred modern landscapes. In HAWX, you're at the controls for stunningly rendered air combat. Take to the air as an elite pilot of the future in a world scarred by years of post-war trauma Enhanced Reality System (E.R.S.) features a damage control system, tactical map and information relay, weapons trajectory control and more, and allows you to issue orders to your squadron and other units Pilot more than 50 legendary aircraft over landscapes rendered in breathtaking detail using NASA and U.S. Geological Survey data Gain a level of comfort in the pilot's seat using assistance mode, which provides maximum piloting security via the E.R.S. Share the solo campaign experience using Jump In/Jump Out co-op functionality Dogfight with friends in PVP mode to find out who's top gun Install Notes: 1. Unpack release 2. Mount image or burn it 3. Install game 4. Play the game\nTom Clancy's H.A.W.X\n\n\n\nGracias por visitar www EspaTorrents com\nThank you for visit www EspaTorrents com\n\n\n\ndo you want more games &amp; cine-online in good-quality???\n\nwww espaconsolas com &amp; www espaendirecto com\n\nThanks!!","torrent":{"xt":"urn:btih:1fd3ff7cb6f58105ce8025a663a4003392622495","amp;dn":"%5BPC%5D-Tom.Clancys.H.A.W.X-.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fd3ff7cb6f58105ce8025a663a4003392622495","infoHashBuffer":{"type":"Buffer","data":[31,211,255,124,182,245,129,5,206,128,37,166,99,164,0,51,146,98,36,149]},"announce":[],"urlList":[]}}