{"title":"Naruto Episode 12 (480p)","uid":10754182,"size":41952723,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1ff796b54dec29589f7f4a0527fa37cffffaa9e2&amp;dn=Naruto+Episode+12+%28480p%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shareregi","files":2,"time":1407912545,"description":"Taking a nap after training in the woods, Naruto is waked up by who he thought was a girl. Eventually learning that the person actually a boy, but aware that he is the masked youth Haku, Naruto gets into an exchange of ideals and morals before the two part ways. Once found by Sasuke, Naruto resumes his Tree Climbing Practice into the evening until he and Sasuke finally make it to the top of their respective trees. Naruto and Sasuke return triumphantly to Tazuna's home, with Naruto cheerful, yet completely drained from the effort. Inari is disturbed at the sight of Naruto, thinking about Kaiza and as he gets into a heated dispute with Naruto who leaves while calling him a coward. Later that night, Kakashi tells a despondent Inari that Naruto understands the boy's pain from his own hardships. The next morning, deciding to let Naruto sleep in, Kakashi, Sasuke, and Sakura escort Tazuna to work. Upon arriving at the bridge, they find Tazuna's workers unconscious with Zabuza and a masked Haku revealing themselves. ","torrent":{"xt":"urn:btih:1ff796b54dec29589f7f4a0527fa37cffffaa9e2","amp;dn":"Naruto+Episode+12+%28480p%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ff796b54dec29589f7f4a0527fa37cffffaa9e2","infoHashBuffer":{"type":"Buffer","data":[31,247,150,181,77,236,41,88,159,127,74,5,39,250,55,207,255,250,169,226]},"announce":[],"urlList":[]}}