{"title":"YCCPDB","uid":8375940,"size":144659803,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:201bfd2810161866efcf531daf8ac14477a9b972&amp;dn=YCCPDB+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"YCCPDB","files":-1,"time":1366049380,"description":"The Debut Album from the Yung Creamed Currency Panty Dropper Billionaires!\n\n_________________\n\nTrack Listing:\n\n1. Money In That Bag Featuring Uncle Jungle and Fifi Dundutta\n\n2. Bank Accounts Featuring Hustle Sproutz, Uncle Jungle, Rapeshaun and Fifi Dundutta\n\n3. Make Money, Take Money, Rape Money Featuring Uncle Jungle, Fif Dundutta and Hustle Sproutz\n\n4. Yoga Pantz Featuring Uncle Jungle and Fifi Dundutta\n\n5. Big Booty Bitches Featuring Uncle Jungle, Hustle Sproutz and Fifi Dundutta\n\n6. Shake Dat Thang For Me Featuring Uncle Jungle, Fifi Dundutta, Hustle Sproutz and Pup E. Luv\n\n7. Last Night Featuring Drapes\n\n8. One Time For Your Spine Featuring Uncle Jungle, Hustle Sproutz, Fifi Dundutta and Spettacoloco\n\n9. I Wanna Love You Featuring Pup E. Luv, Uncle Jungle, Fifi Dundutta and Drapes\n\n10. She Wants It Featuring Uncle Jungle, Pup E. Luv, Spettacoloco and Fifi Dundutta\n\n11. Bitches Be Trippin' Featuring Fifi Dundutta, Pup E. Luv, Hustle Sproutz and Uncle Jungle\n\n12. Sproutz In Your Mouf (Live Freestyle) Featuring Hustle Sproutz\n\n13. I Don't Know What She Do (But She Done Does It) Featuring Fifi Dundutta, Uncle Jungle, Rapeshaun, Jozay Pesos, Hustle Sproutz and Pup E. Luv\n\n14. Make You Mine Featuring Pup E. Luv, Uncle Jungle and Spettacoloco\n\n15. Fly Little Guapalita Featuring Pup E. Luv, Fifi Dundutta, Uncle Jungle, Hustle Sproutz and Spettacoloco\n\n16. Make Money, Take Money, Rape Money Part II Featuring Uncle Jungle, Hustle Sproutz and Fifi Dundutta \n\n17. Uncle Hustle (Interlude) Featuring Uncle Jungle and Hustle Sproutz\n\n18. I Love The Way She Featuring Hustle Sproutz, Uncle Jungle, Jozay Pesos, Fifi Dundutta, Pup E. Luv, Rapeshaun, Spettacoloco and Drapes\n\n_________________\n\nFollow the #YCCPDB on Twitter!\n\n@YCCPDB\n@RealUncleJungle\n@FifiDundutta\n@HustleSproutz\n@RealPupELuv\n@Spettacoloco\n@Rapeshaun\n@JozayPesos\n@RealDrapes","torrent":{"xt":"urn:btih:201bfd2810161866efcf531daf8ac14477a9b972","amp;dn":"YCCPDB+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"201bfd2810161866efcf531daf8ac14477a9b972","infoHashBuffer":{"type":"Buffer","data":[32,27,253,40,16,22,24,102,239,207,83,29,175,138,193,68,119,169,185,114]},"announce":[],"urlList":[]}}