{"title":"Peter Watson - A Terrible Beauty / The Modern Mind [epub]","uid":9020808,"size":1556441,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:22508739e57dcf816ea1f4871e5b02e66ac2b828&amp;dn=Peter+Watson+-+A+Terrible+Beauty+%2F+The+Modern+Mind+%5Bepub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"epub_888","files":-1,"time":1381275932,"description":"A Terrible Beauty: The People and Ideas That Shaped the Modern Mind : A History\n\n(Alternative title:) The Modern Mind: An Intellectual History of the 20th Century\n\n\nTerrible Beauty presents a unique narrative of the twentieth century. Unlike more conventional histories, where the focus is on political events and personalities, on wars, treaties and elections, this book concentrates on the ideas that made the century so rich, rewarding and provocative. Beginning with four seminal ideas which were introduced in 1900 - the unconscious, the gene, the quantum and Picasso's first paintings in Paris ' the book brings together the main areas of thought and juxtaposes the most original and influential ideas of our time in an immensely readable narrative. From the creation of plastic to Norman Mailer, from the discovery of the 'Big Bang' to the Counterculture, from Relativity to Susan Sontag, from Proust to Salman Rushdie, and Henri Bergson to Saul Bellow, the book's range is encyclopedic. We meet in these pages the other twentieth century, the writers, the artists, the scientists and philosophers who were not cowed by the political and military disasters raging around them, and produced some of the most amazing and rewarding ideas by which we live. Terrible Beauty, endlessly stimulating and provocative, affirms that there was much more to the twentieth century than war and genocide","torrent":{"xt":"urn:btih:22508739e57dcf816ea1f4871e5b02e66ac2b828","amp;dn":"Peter+Watson+-+A+Terrible+Beauty+%2F+The+Modern+Mind+%5Bepub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22508739e57dcf816ea1f4871e5b02e66ac2b828","infoHashBuffer":{"type":"Buffer","data":[34,80,135,57,229,125,207,129,110,161,244,135,30,91,2,230,106,194,184,40]},"announce":[],"urlList":[]}}