{"title":"Ableton.Suite.v8.2.5.Program.Only.MAC.OSX.INTEL-ibu","uid":6643849,"size":228470333,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:22b6b0a36eb988184fc8e47a340df22d144f33ab&amp;dn=Ableton.Suite.v8.2.5.Program.Only.MAC.OSX.INTEL-ibu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1314865365,"description":"\nAbleton Suite v8.2.5 MAC OSX INTEL\n\nAbleton Suite is a complete software studio. Suite 8 gives you all of the features in Live 8 plus sound, with a radically new Library packed with beautiful new sounds and a wealth of useful resources. Suite 8 contains 11 Ableton instruments and effects including synths, a sampler, electric and acoustic drums, mallets, numerous sampled instruments, the new, reworked Operator and amp modeling effects. Two completely new instruments, Collision and Latin Percussion, round off the set. Ableton Suite 8 is a complete package: the tools and the sounds.\n\nKey features\nMultitrack recording up to 32-bit/192 kHz\nNondestructive editing with unlimited undo\nPowerful MIDI sequencing of software and hardware instruments\nAdvanced warping and real-time time-stretching\nLibrary with over 1600 expressive sounds, each with versatile control options\nA comprehensive selection of built-in audio and MIDI effects\nA wide range of software instruments\nInstrument Racks for simple management of complex instrument setups\nDrum Racks for intuitive and responsive beat-making\nEffect Racks for professional-grade mastering, mixing and creative sound processing\nNew groove engine; apply and extract grooves in real time\nConstruction kits containing loops and phrases in a number of styles\nSound Objects Lite, from SonArte: a toolkit of real world object recordings\n440 MB of abstract, experimental loops from renowned music software pioneers Cycling '74 *\nOver 400 loops and samples from Zero-G *\n1000s of single-device presets: simple components for making new sounds and exploring synthesis\nSong templates with pre-configured tracks and routing\nSupports AIFF, WAV, MP3, Ogg Vorbis and FLAC files\nVST and AU support; automatic plug-in delay compensation\nREX file support plus built-in audio to MIDI slicing\nVideo import and export for scoring, video warping\nSimple MIDI mapping plus instant mapping for selected hardware\nFull ReWire support; runs as Slave or Master\nMulticore and multiprocessor support\nSupport for The Bridge, Ableton's collaboration with Serato\n\nBugfixes\nLive would freeze and crash on OS X Lion when sending MIDI data to any MIDI port.\nUnder certain conditions, quantizing transient markers could lead to overlapping warp markers, which would cause various problems when editing the warp marker or its segment BPM value.\nUnder certain conditions, the &quot;Transient&quot;-based Beats warp mode would play double attacks. With this bug fixed, it is possible that some clips sound different.\nExcluding a plug-in from the scan process didn't work if Live crashed because of the first scanned plug-in, after enabling the VST plug-in source via Live's Preferences (Mac only).\nRendering a Live Set containing an EQ3 at sample rates below 44.1 KHz would result in an audio file containing pure silence.\nFixed a crash when loading a Live 7 Set with invalid clip color information in Live 8.\nDetail view appeared empty after Hot-Swapping an unfolded Rack, because devices were scrolled out of view.\nInfinitely long clips would be created if rewinding the global transport while making a new recording.\nTrack names could be incorrectly displayed when unfolding a Live set in the Live Browser. This only happened for &quot;automatic names&quot; that tracks get from the Instrument they contain. For Live Sets saved in earlier versions, names of tracks containing Racks, Max for Live devices or third-party plugins may still look wrong. Re-saving the Sets will fix the problem.\nSome Operator presets could sound different when loading them, and then creating or moving a track.\nThe Frontier Design Tranzport was not getting updated when switching tracks.\nThe green zoom button was sometimes disabled when using Live with Mac OS X.\nResuming a clip in Session view while the track is armed but OVR is OFF could result in the clip not playing its notes.\nToggling OVR ON and OFF doesn't create an UNDO step anymore\nCertain Library content wasn't usable for Live Intro users since version 8.2.\nEnabling a clip loop via the loop switch or the Set Loop Length button would sometimes stop the clip.\nFixed a crash which could occur when hot-swapping a certain Drum Rack pad.\nEleven additional crashes were also fixed.\n\nInstall:  \n        open ableton_suite_825_program_only.dmg\n          drag live-folder to Applications\n        if needed drag and drop Authorize821.auz onto registration-window\n\nenjoy and consider buying it\n","torrent":{"xt":"urn:btih:22b6b0a36eb988184fc8e47a340df22d144f33ab","amp;dn":"Ableton.Suite.v8.2.5.Program.Only.MAC.OSX.INTEL-ibu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22b6b0a36eb988184fc8e47a340df22d144f33ab","infoHashBuffer":{"type":"Buffer","data":[34,182,176,163,110,185,136,24,79,200,228,122,52,13,242,45,20,79,51,171]},"announce":[],"urlList":[]}}