{"title":"Vialls - Deadly Deception at Port Arthur - Scientific Evidence Q","uid":7109256,"size":855296,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:237db8ad9d7997e869bc735fc8ca6d5923275f77&amp;dn=Vialls+-+Deadly+Deception+at+Port+Arthur+-+Scientific+Evidence+Q&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1331979722,"description":"This is Joe Vialls's shocking book Deadly Deception at Port Arthur - Scientific Evidence Questions Australia's Port Arthur Massacre (1999) which is a major investigation into the Port Arthur massacre in Tasmania, Australia in 1996. The Port Arthur massacre of 28 April 1996 was a killing spree in which 35 people were killed and 21 wounded, mainly at the historic Port Arthur prison colony, a popular tourist site in south-eastern Tasmania, Australia. The awesome display of combat marksmanship was blamed on intellectually impaired Martin Bryant, who was held in illegal strict solitary confinement for more than 120 days, until he was &quot;ready&quot; to plead guilty. There was no trial. Within a matter of weeks legislation was passed to remove semi-automatic weapons from the Australian population and a gun buy-back proceeded. It is now illegal to own any semi-automatic gun in Australia. Vialls claims that Bryant was wrongly convicted for this crime and did not receive a fair trial. He further claims that the Port Arthur massacre was planned as early 1987 when, after a specially called Premier's meeting in Hobart in December 1987, the New South Wales Labour Premier, Mr. Barry Unsworth stated, &quot;there would be no effective gun control in Australia until there was a massacre in Tasmania&quot;. Was this event a psyop - a psychological operation or an event designed to drum up public support for some piece of legislation that would be otherwise be unpopular and probably be defeated? It is commonly known that every totalitarian regime in history was always preceeded by massive gun control laws which left the population helpless against heavily armed government agents. Is it possible that such plans have been laid out for the people of Australia if not of the whole world? Find out how it was all done in this case. 110 pages, few pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:237db8ad9d7997e869bc735fc8ca6d5923275f77","amp;dn":"Vialls+-+Deadly+Deception+at+Port+Arthur+-+Scientific+Evidence+Q","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"237db8ad9d7997e869bc735fc8ca6d5923275f77","infoHashBuffer":{"type":"Buffer","data":[35,125,184,173,157,121,151,232,105,188,115,95,200,202,109,89,35,39,95,119]},"announce":[],"urlList":[]}}