{"title":"Uranium Deposits of the World - Asia","uid":15543427,"size":90007585,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:23a9cbe4a4c1493cc332665ba415cc0263cfec3e&amp;dn=Uranium+Deposits+of+the+World+-+Asia&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1470945437,"description":"Uranium Deposits of the World - Asia - Franz J. Dahlkamp (Springer, 2009).pdf\r\n\r\nUranium Deposits of the World, in four volumes, comprises an unprecedented compilation of data and overviews of the key uranium regions throughout the globe. It offers not only a complete uranium-resource reference based on the latest research but also access to previously unavailable data. Each country and region receives an analytical overview followed by the detailed geologically- and economically-relevant synopsis of the individual regions and fields, including: location and magnitude of uranium districts and deposits; principal features of uranium districts; and characteristics of selected deposits. The description of districts and deposits includes sections on geology, alteration, mineralogy, shape and dimensions, ore controls or recognition criteria, and metallogenetic aspects. A typological classification of uranium deposits is added to give an overview of principal criteria of deposit types and related nomenclature. The set also provides readers access to the voluminous literature via the comprehensive bibliography of uranium-related publications. Abundantly illustrated with information-laden maps and charts throughout, this reference work is an indispensable tool for geologists, mining companies, government agencies, and others with interest in key natural resources. The four volumes of Uranium Deposits of the World, available as set, cover the world’s populated continents: Asia; Europe; Australia, Oceania, and Africa; and USA, and Latin America","torrent":{"xt":"urn:btih:23a9cbe4a4c1493cc332665ba415cc0263cfec3e","amp;dn":"Uranium+Deposits+of+the+World+-+Asia","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23a9cbe4a4c1493cc332665ba415cc0263cfec3e","infoHashBuffer":{"type":"Buffer","data":[35,169,203,228,164,193,73,60,195,50,102,91,164,21,204,2,99,207,236,62]},"announce":[],"urlList":[]}}