{"title":"NBA LIVE Mobile v1.0.6 Android","uid":13678983,"size":67252461,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:23c3d37bcec0ec4e6092554416beebe96c183533&amp;dn=NBA+LIVE+Mobile+v1.0.6+Android&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":".BONE.","files":1,"time":1456449694,"description":"Connect to the NBA all-year-round with fast-paced, daily live events based on real NBA teams, players, and in-season action. Enjoy full 5-on-5 action, authentic 3D gameplay, and battle it out on the hardwood all the way to the NBA Finals!\r\n\r\nSTAY FRESH IN DAILY LIVE EVENTS\r\nNBA LIVE Mobile connects you to the NBA every day, all year long. Instantly tap into brand new challenges and incredible rewards every day with live events, evolving matchups, Head-to-Head and Seasons modes, and more – all based on the real NBA!\r\n\r\nASSEMBLE YOUR TEAM*\r\nSelect your favorite NBA franchise and become GM. Acquire real NBA players from the past and present by opening packs, or by working the auction house. Collect blockbuster legends and current stars like Russell Westbrook. Upgrade your roster your own way, then take your team out on the court to compete against friends.\r\n\r\nFIND EDGES TO DOMINATE*\r\nPlay through fast-paced NBA seasons to build your powerhouse franchise. Unlock special abilities for your team members, dominate friends, and take your franchise to the next level.\r\n\r\nNBA LIVE Mobile brings real NBA events and next-generation hardwood action straight to your fingertips. Are you ready to rise to the top?\r\n\r\nThis app: requires a persistent Internet connection (network fees may apply); requires acceptance of EA’s Privacy &amp; Cookie Policy, TOS and EULA; includes in-game advertising; collects data through third party analytics technology (see Privacy &amp; Cookie Policy for details); contains direct links to the Internet and social networking sites intended for an audience over 13.\r\n\rlogin required. Must be 13 years or older.\r\n\r\nRequired Android O/S : 3.2+","torrent":{"xt":"urn:btih:23c3d37bcec0ec4e6092554416beebe96c183533","amp;dn":"NBA+LIVE+Mobile+v1.0.6+Android","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23c3d37bcec0ec4e6092554416beebe96c183533","infoHashBuffer":{"type":"Buffer","data":[35,195,211,123,206,192,236,78,96,146,85,68,22,190,235,233,108,24,53,51]},"announce":[],"urlList":[]}}