{"title":"Bach - Sonatas and Partitas (2001) [FLAC] (Sigiswald Kuijken)","uid":14499460,"size":742739636,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:245cbc4ea845f04aebe5845b8a276e975cd232b1&amp;dn=Bach+-+Sonatas+and+Partitas+%282001%29+%5BFLAC%5D+%28Sigiswald+Kuijken%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"macropus","files":42,"time":1462161221,"description":"J.S. Bach: Sonatas &amp; Partitas BWV 1001-1006\r\n\r\nSonatas &amp; Partitas for solo violin BWV 1001-1006 []\r\n\r\nSigiswald Kuijken (Violin)\r\n\r\nDeutsche Harmonia Mundi 77527\r\n\r\nDec 1999; Feb-Mar 2000\r\n\r\n2-CD / TT: 135:46\r\n\r\nRecorded at Accademia Musicale Chigiana, Siena, Italy.\r\n2nd recording of S&amp;P for solo violin BWV 1001-1006 by S. Kuijken.\r\n\r\nGramophone Review\r\nKuijken’s wonderful simplicity of playing allows these works to speak for themselves\r\nKuijken’s 1981 analogue recording of the Sonatas and Partitas‚ on the same label‚ was a pioneering achievement‚ persuading us that this demanding music needs a period instrument for it to have its full effect. The new recording‚ using the same Grancino violin‚ offers very similar interpretations – indeed‚ the most noticeable difference between the two sets is the recorded sound. In 1981 Kuijken was given a clear‚ intimate recording; this version‚ made in the Accademia Chigiana in Siena‚ has a far livelier acoustic‚ and a richer sonority. Fine in the slower movements‚ but in fast‚ intricate pieces like the finales of the first two sonatas‚ the extra resonance blurs the music’s impact. Is it because of this spacious ambience that Kuijken now adopts rather more measured tempos? This can be a significant improvement; whereas the earlier account of the First Partita’s Tempo di Borea seems a touch breathless‚ the new performance adds a sense of poise‚ with no loss of liveliness. But there are one or two movements – the gigue in Partita No 2 is one – where the more deliberate speed brings a feeling of laboriousness. Kuijken’s great virtues as a Bach player are his firm grasp of the music’s character‚ particularly its rhythmic character‚ and his often intense feeling for the overall shape of each piece. Compared to many Baroque players‚ his performances seem very straightforward; the phrases shaped beautifully but without exaggeration‚ the rubato always subtle. The demands of the music always dominate over technical considerations – there is occasional roughness that isn’t present in Rachel Podger’s recent accounts. Podger‚ indeed‚ achieves an astonishing degree of clarity and polish. Her recording‚ too‚ is superior to either of Kuijken’s – perfect definition yet with an attractive bloom. Her performances are stylish and elegant‚ full of interest and variety. Yet‚ ultimately‚ I’d choose Kuijken as a guide to the music. The Correnta of the First Partita gives a good example of their contrasted styles – Podger‚ with vividly varied bowings and lots of little hesitations to mark the phrase breaks‚ making a capricious and slightly mannered impression‚ Kuijken much simpler‚ yet alive to everything in the music that promotes its spirited‚ dancing character","torrent":{"xt":"urn:btih:245cbc4ea845f04aebe5845b8a276e975cd232b1","amp;dn":"Bach+-+Sonatas+and+Partitas+%282001%29+%5BFLAC%5D+%28Sigiswald+Kuijken%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"245cbc4ea845f04aebe5845b8a276e975cd232b1","infoHashBuffer":{"type":"Buffer","data":[36,92,188,78,168,69,240,74,235,229,132,91,138,39,110,151,92,210,50,177]},"announce":[],"urlList":[]}}