{"title":"Coast to Coast AM June 19, 2013 - Darwin &amp; Intelligent Desig","uid":8621706,"size":56884971,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:24ebb8e70dd38d382e6c2976ff4ee80b94b5aeb0&amp;dn=Coast+to+Coast+AM+June+19%2C+2013+-+Darwin+%26amp%3B+Intelligent+Desig&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pyramid91","files":5,"time":1372387948,"description":"MP3 version wins!\nCourtesy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\nDate:\n06-19-13\nHost:\nGeorge Noory\nGuests:\nStephen  Meyer,                   Jack  Cashill\nPointing out a hitch in Darwin's theory of evolution, Cambridge trained philosopher of science, Stephen C. Meyer, presented an argument for intelligent design. Darwin believed the appearance of purposeful design in living organisms was a kind of illusion, and explained it as a byproduct of an undirected process such as natural selection. However, Darwin recognized that the abrupt or sudden appearance of the first animals in the fossil record around 530 million years ago (in a period called the Cambrian Explosion) posed a challenge to his theory, which predicted a slow, gradual evolution of life. Darwin thought that future fossil discoveries would fill in the missing gaps, but what's happened is just the opposite-- a wider variety of Cambrian animals with intricate forms have been found, Meyer noted.  \nIn unraveling the mystery of the Cambrian Explosion, Meyer viewed the period as a kind of &quot;information revolution,&quot; the first since the origin of life itself. &quot;But I realized there was a cause of which we know from our ordinary experience, our uniform and repeated experience (which Darwin taught was the basis of all scientific reasoning) that is capable of generating information. And that cause is intelligence, it's mind, it's conscious or rational activity,&quot; he declared. That led him to develop a rigorous, and scientific argument for intelligent design, using the same reasoning methods that Darwin employed. \nOne biologist said that 'natural selection does a good job of explaining the survival of the fittest, but not the arrival of the fittest,' Meyer commented. He differentiated his theory from Creationism, noting that the method of reasoning is different. &quot;The theory of intelligent design is not attempting to interpret scripture, it's rather an inference from biological evidence,&quot; he said. Meyer further theorized that no agent from within the cosmos was responsible for the fine tuning of life, and the design of the very fabric of the universe. He thinks we're looking at an intelligence which originates beyond the universe itself. \nFlight 800 Update\nFirst hour guest, writer and producer Jack Cashill commented on new evidence in the crash of TWA Flight 800 that's being presented in an upcoming documentary about the 1996 incident. The conclusion the filmmakers reach is the same that Cashill and James Sanders made in their book First Strike-- that the explosion which took down Flight 800 came from an external source-- in other words, a missile. But while the new film points to the cause of the crash, they don't speculate as to who was behind it, or why there was a cover-up, Cashill remarked. He believes Flight 800 was an accidental casualty of a US military strike that was targeting a small terrorist plane filled with explosives. \nNews segment guests: Michael Henderson, Robert Davi, Christian Wilde, Rosemary Ellen Guileywww.visionaryliving.com\nWebsite(s):\n stephencmeyer.org\n darwinsdoubt.com\n cashill.com\nBook(s):\n Darwin's Doubt\n Signature in the Cell: DNA and the Evidence for Intelligent Design\n First Strike: TWA Flight 800 and the Attack on America\n","torrent":{"xt":"urn:btih:24ebb8e70dd38d382e6c2976ff4ee80b94b5aeb0","amp;dn":"Coast+to+Coast+AM+June+19%2C+2013+-+Darwin+%26amp%3B+Intelligent+Desig","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24ebb8e70dd38d382e6c2976ff4ee80b94b5aeb0","infoHashBuffer":{"type":"Buffer","data":[36,235,184,231,13,211,141,56,46,108,41,118,255,78,232,11,148,181,174,176]},"announce":[],"urlList":[]}}