{"title":"The Republic of Plato read by British actor Mr. Bruce Alexander","uid":6834820,"size":139028143,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2557b3f7339463bf2d2ddb7d81fa14c82f93c2fc&amp;dn=The+Republic+of+Plato+read+by+British+actor+Mr.+Bruce+Alexander&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"michaelrizzo","files":-1,"time":1321990508,"description":"This is an abridged version published on 4CDs at under 5 hours \n\nPlato's Republic has interesting ideas for those that argue mainly on semantics\nand make generalizations that fail to take into account crucial elements such as\nthe true nature of what is fundamentally of human merit and concern and a core\npart of whatever is to be truly considered is soul.\n\n\nCould we really be convinced that virtue means only doing the one thing you are fit\nfor in respect of a vocation? Are wives and children truly to be held in common?\nSuch apparent Socratic wisdom fails the test of human sensibility in its application\nin any event - I daresay. It isn't true wisdom as it isn't humanly practical.\n\nBut then we do have some wisdom from this greatly famous work - for example we are\ntold that justice is not found in just paying back what you owe r always telling the\ntruth. we are given an example of where using simple rules rather than greater \nprinciples would make this clear in any real bid for true justice.\n\nMy thanks to the original uploader at tpb who signed his or her name &quot;audiobooks&quot;\n\nI would have been grateful for this in my senior philosophy studies at the university\nof Alberta under Professor Carmichael back then! So much reading indeed!\n\nMichael Rizzo Chessman\n\n","torrent":{"xt":"urn:btih:2557b3f7339463bf2d2ddb7d81fa14c82f93c2fc","amp;dn":"The+Republic+of+Plato+read+by+British+actor+Mr.+Bruce+Alexander","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2557b3f7339463bf2d2ddb7d81fa14c82f93c2fc","infoHashBuffer":{"type":"Buffer","data":[37,87,179,247,51,148,99,191,45,45,219,125,129,250,20,200,47,147,194,252]},"announce":[],"urlList":[]}}