{"title":"Paranormal-Activity.2009.Theatrical.DvDrip[vice]","uid":5244297,"size":442200437,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2662958beff2d4f545d76b31ab1599c27a291ba9&amp;dn=Paranormal-Activity.2009.Theatrical.DvDrip%5Bvice%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vicerock","files":-1,"time":1261927143,"description":"PARANORMAL ACTIVITY 2009 THEATRICAL ENDING DVDrip\n\nVIDEO CODEC Divx\nformat Avi\nsize/res 480x272[wide screen]\nrun-time 01:26:23\nvideo bitrate 512\nvideo framerate 30\nXvid profile asp5\n\nAUDIO CODEC mp3\naudio bitrate 128\nsample rate 44100\na/v sync basic\n\nStarring:  \t Katie Featherston, Micah Sloat, Michael Bayouth\n\nPlot\n\nKatie, a student, and Micah, a day trader, are a young couple &quot;engaged to be engaged&quot;. Katie claims that a ghostly entity has haunted her since her youth and believes that it has followed her to their two-story tract house in suburban San Diego, California. Micah buys a video camera in the hopes of capturing paranormal activity on film. During a visit to their house, Dr. Fredrichs, a self-professed psychic, assesses that they are being plagued by a demon which feeds off &quot;negative energy&quot; and is intent on haunting Katie no matter where she goes. Dr. Fredrichs also recommends the two contact Dr. Abrams, a demonologist, and Micah's reluctance to do so leads to arguments between the couple. Each night, Micah leaves the video camera on a tripod in their bedroom to record whatever might be occurring while he and Katie sleep. He manages to document several phenomena such as objects moving on their own, lights and televisions switching on and off, and sounds ranging from voices and growls to footsteps and loud thuds. The strange occurrences in the middle of the night soon involve Katie awakening to spend several hours standing by the bed staring at Micah while he sleeps and going outside to sit on the backyard swing, none of which she remembers the following morning.\n\nKatie, already irritated by Micah's making light of the situation, becomes irate when Micah brings home a Ouija board, despite Dr. Fredrichs' warning against any attempt to communicate with the entity. While the two are out of the house, a wind blows through the living room and the Ouija board's planchette moves on its own. A small fire soon erupts on the board, extinguishing itself seconds later. Later, inhuman footprints are left in baby powder placed on the hallway floor by Micah. In the attic, Micah finds a charred photograph of a young Katie previously thought to have been destroyed in a house fire. The next night, the bedroom door slams itself shut and is violently knocked and banged upon from the other side. Dr. Abrams is abroad when Micah finally agrees to invite him, so Dr. Fredrichs agrees to make a second house call. However, Dr. Fredrichs immediately has a sense of foreboding upon entering their home, and apologetically leaves despite Katie and Micah's desperate pleas for him to stay and help.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1179904/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1179904/&lt;/a&gt;\n\nPLEASE SEED AND ENJOY THANKS\n\nSCREEN SHOTS &lt;a href=&quot;\nhttp://img6.imageshack.us/img6/7386/paranormalactivity2009d.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img6.imageshack.us/img6/7386/paranormalactivity2009d.jpg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:2662958beff2d4f545d76b31ab1599c27a291ba9","amp;dn":"Paranormal-Activity.2009.Theatrical.DvDrip%5Bvice%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2662958beff2d4f545d76b31ab1599c27a291ba9","infoHashBuffer":{"type":"Buffer","data":[38,98,149,139,239,242,212,245,69,215,107,49,171,21,153,194,122,41,27,169]},"announce":[],"urlList":[]}}