{"title":"SPECIAL FORCES 2011 DVDRip x264 AC3 E Sup &amp; FRENCH HIGH QUAL","uid":6984582,"size":1637202037,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:277caa90bb9befeb40e92e5c22583fa12a59ed05&amp;dn=SPECIAL+FORCES+2011+DVDRip+x264+AC3+E+Sup+%26amp%3B+FRENCH+HIGH+QUAL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mprajkumar","files":14,"time":1327522845,"description":"uploaded by DON RAJ\n\nSPECIAL FORCES 2011 DVDRip E Sup &amp; FRENCH HIGH QUALITY uploaded by DON RAJ\n\nSPECIAL FORCES 2011 REVIEW\n\n\nTITLE..............: .........:SPECIAL FORCES (2011)\nRELEASE NAME........: Special.Forces.2011.DVDRip.Xvid,AC3-SOuVLaAKI\nIMDB RATiNG.............: 6.2/10 from 680 users\nRELEASE DATE........: 16/01/2011\niMDB LiNK.................: http://www.imdb.com/title/tt1656192/\nFORMAT....................: AVI\nGENRE......................: Action | Adventure | Drama\nDURATiON.................: 1h 44mn\nPLOT.........................: A French journalist in Afghanistan is kidnapped by the Taliban.\nSiZE..........................: 1.52 GB\nBiTRATE...................: 2 039 Kbps\nFRAMERATE............: 25.000 fps\nViDEO CODEC.........: XVID\nRESOLUTiON...........: 720 X 304\nBITS/PIXEL*FRAME..: 0.289\nAUDiO......................: AC3 448 kbps ENGLISH &amp; FRENCH\nSUBTiTLES...............: ENGLISH &amp; FRENCH\nSAMPLE...................: Available\n\n\n\n &lt;a href=&quot;\nhttp://www.shotpix.com/images/96705774606425401125.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.shotpix.com/images/96705774606425401125.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.shotpix.com/images/88307808961795112064.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.shotpix.com/images/88307808961795112064.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.shotpix.com/images/87716638533970754180.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.shotpix.com/images/87716638533970754180.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.shotpix.com/images/66985921984045807167.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.shotpix.com/images/66985921984045807167.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.shotpix.com/images/05204462353569557888.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.shotpix.com/images/05204462353569557888.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.shotpix.com/images/29300686363725550790.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.shotpix.com/images/29300686363725550790.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.shotpix.com/images/63245163067107618247.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.shotpix.com/images/63245163067107618247.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.shotpix.com/images/45332519029669647368.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.shotpix.com/images/45332519029669647368.jpg&lt;/a&gt;\n\n\n\n          A Studiocanal release of an Easy Company presentation and production. (International sales: Studiocanal, Paris.) Produced by Thierry Marro, Benoit Ponsaille, Stephane Rybojad. Directed by Stephane Rybojad. Screenplay, Rybojad, Michael Cooper, Emmanuel Collomp.\nWith: Diane Kruger, Djimon Hounsou, Benoit Magimel, Denis Menochet, Raphael Personnaz, Alain Figlarz, Marius, Mehdi Nebbou, Raz Degan, Tcheky Karyo. (French, English, Pashto dialogue)\nA Gallic elite commando is sent to Central Asia to free a blonde, blue-eyed journo from the clutches of the Taliban in \\\\\\&quot;Special Forces,\\\\\\&quot; a film that\\\\\\'s as elementary and generic as its title suggests. Fiction debut of TV documaker Stephane Rybojad wants to be a rousing action-adventure against a geopolitical backdrop, but a gaping hole where the mise-en-scene should be proves crippling from the outset. Star power of odd pair Diane Kruger and Djimon Hounsou couldn\\\\\\'t compensate for a critical drubbing in France and will be of little help when it hits a single Blighty screen Nov. 18.\n\nGerman-born Kruger stars as French reporter Elsa (with a strangely Teuton accent when speaking English), who is kidnapped by the goons of a Taliban chief (Raz Degan). A special French military unit is quickly dispatched to Pakistan because France\\\\\\'s image abroad is on the line (\\\\\\&quot;It will not come to pass that the entire world will see the decapitation of a Frenchwoman live on TV,\\\\\\&quot; a politico helpfully underlines).\n\nThe small unit of highly trained men, seen executing an unrelated (and for the film, irrelevant) job in Kosovo in the prologue, consists of a few stick figures in bulletproof vests, with the thesps\\\\\\' order of billing directly linked to their chances of survival.\n\nThey include the serious leader, Kovax (Hounsou); his semi-funny sidekick, Tic Tac (Benoit Magimel), the inexperienced young \\\\\\'un (Raphael Personnaz); and the grumpy vet (Denis Menochet). Parachuted into enemy territory, they liberate Elsa relatively smoothly. But when their radio\\\\\\'s destroyed in the resulting shootout, they are forced to travel to a safer haven on foot with the Taliban on their tail, their mission reduced to a predictable game of cat-and-mouse in the majestic Hindu Kush mountains.\n\nEven though the soldiers have a journalist among them, the larger conflict in the area itself remains very black-and-white (and there\\\\\\'s no sense of any other forces being on the ground). The screenplay does nothing to illuminate any of the three parties: The Taliban are the evildoers, the Frenchmen the self-sacrificing military heroes, and the little-seen local population an exotic bunch caught in the middle.\n\nBut the film\\\\\\'s biggest problem isn\\\\\\'t its overly simple and familiar narrative, its scant character development or the soldiers\\\\\\' often miraculous resistance to Taliban bullets, but rather Rybojad\\\\\\'s poor command of film grammar. Pointing a camera any which way during the numerous shootouts is no guarantee for an exciting or even coherent action setpiece; add to that the lackluster editing, credited to Erwan Pecher and the helmer (who also produced, thus creating a possible lack of critical distance), and the pic occasionally comes off as amateurish.\n\nBut \\\\\\&quot;Special Forces\\\\\\&quot; wasn\\\\\\'t made on a tiny budget, having shot for weeks in gorgeous locations such as Djibouti and Tajikistan, with Rybojad overdosing on helicopter shots of arid mountain ranges. The score strikes an odd balance between a 1980s vibe and locally flavored sounds.\n\nKruger isn\\\\\\'t given a whole lot to work with, and isn\\\\\\'t the kind of actress who can hold her own when poorly directed. More often than not, she\\\\\\'s offscreen, hiding behind the nearest rock while her rescuers -- generically imposing, with only Magimel and Personnaz adding a hint of humanity -- empty their guns on the hordes of bearded and robed men in the distance.\n\nIsraeli actor Degan, playing another eye-linered evildoer after his turn in Oliver Stone\\\\\\'s \\\\\\&quot;Alexander,\\\\\\&quot; is laughably over the top, his Cambridge-educated \\\\\\&quot;butcher of Kabul\\\\\\&quot; occasionally insisting his entourage speak English, no doubt because that\\\\\\'s what bad guys do in French movies.\nCamera (color, widescreen), David Jankowski; editors, Rybojad, Erwan Pecher; music, Xavier Berthelot; production designer, Christophe Jutz; costume designer, Celine El Mazouzi; sound (Dolby Digital), Arnaud Lavaleix, Benoit Hery, Cyril Holtz. Reviewed at Le Grand Rex, Paris, Nov. 3, 2011.\n\n\n\nafter download Please KEEP SEEDING...\n\n....PLEASE KEEP SEEDING.... PLEASE KEEP SEEDING.... PLEASE KEEP SEEDING....","torrent":{"xt":"urn:btih:277caa90bb9befeb40e92e5c22583fa12a59ed05","amp;dn":"SPECIAL+FORCES+2011+DVDRip+x264+AC3+E+Sup+%26amp%3B+FRENCH+HIGH+QUAL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"277caa90bb9befeb40e92e5c22583fa12a59ed05","infoHashBuffer":{"type":"Buffer","data":[39,124,170,144,187,155,239,235,64,233,46,92,34,88,63,161,42,89,237,5]},"announce":[],"urlList":[]}}