{"title":"JeeKee's Kidstime 1 DVD 5( 4 Films op 1 DVD Ned  Audio) TBS","uid":6619779,"size":4535561137,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:27847618d0c49a5d3606e637c94e7090cb3a1a87&amp;dn=JeeKee%5C%27s+Kidstime+1+DVD+5%28+4+Films+op+1+DVD+Ned++Audio%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Marjanb","files":-1,"time":1313936123,"description":"JeeKee's Kidstime 1\n\nDeel 1 bevat de volgende vier films + HR Cover:\n\n\n\nRio\nBlu is een zeldzame Macaw papegaai die werd gevangen in de jungle van Rio. Hij belandde dankzij smokkelaars in Minnesota, waar hij gevonden werd en nu al vijftien jaar verzorgd wordt door Linda. De twee zijn onafscheidelijk. Op een dag komt een professor langs bij Linda om te vragen of zij en Blu mee gaan naar Rio om daar zijn ras te redden; Blu is namelijk het laatste mannetje van zijn soort. In Rio verloopt alles niet bepaald zoals gepland en beland Blu in een avontuur, samen met zijn soortgenoot Jewel en andere nieuwe vrienden.\n\nMegamind\nWanneer de beruchte schurk Megamind per ongeluk zijn aartsrivaal Metro Man vermoordt, verliest hij de zin van het leven. Zijn hele leven zat hij achter z\\'n vijand aan en de vijand achter hem. Nu dit domme ongelukje zijn leven veranderd heeft, creÃƒÂ«ert hij een nieuwe superheld genaamd Titan. Probleem is dat deze ook de nummer ÃƒÂ©ÃƒÂ©n schurk van de stad wil zijn. Hoe moet het nu?\n\nHoe tem je een draak\nDe jonge viking Hiccup woont op het eiland Berk, waar draken bevechten een manier van leven is. De intelligentie en de eigenwijze humor van de tiener vallen niet in goede aarde bij de stamleden en het stamhoofd... dat niemand minder is dan de vader van Hiccup. Maar wanneer Hiccup samen met andere Vikingjongens drakentraining krijgt, ziet hij zijn kans schoon om te bewijzen dat hij uit het goede hout gesneden is om krijger te worden. Wanneer hij echter een gewonde draak ontmoet, wordt zijn wereld ondersteboven gegooid, en wat begon als de enige gelegenheid voor Hiccup om zichzelf te bewijzen, verandert in een kans op een nieuwe toekomst voor de hele stam...\n\nVerschrikkelijke Ikke\nGru (Steve Carrell) is een duivels meesterbrein dat geniet van alles wat slecht is en van plan is om de maan te stelen. Hij verslaat iedereen die hem in de weg zit met zijn wapenverzameling van krimp- en vriesstralen en zijn gevechtsklare land- en luchtvoertuigen. Maar dan ontmoet hij op een dag drie kleine eigenwijze weesmeisjes die naar hem kijken en iets in hem zien wat nog nooit iemand heeft gezien: een mogelijke papa. \\'s Werelds grootste schurk heeft zojuist zijn grootste uitdaging gevonden: drie kleine meisjes die Margo, Edith en Agnes heten.\n\nNEDERLANDS gesproken, DVD Cover zit erbij.\n\n Category\t:\tVideo\n Format\t:\tDVD5\n Source\t:\tRetail\t\t\n Genre\t:\tAnimation Family Kinderfilm\n Language\t:\tDutch audio\t \t \t \n Files\t:\t88 Files\n Size\t:\t3.88 GB\n Filename\t:\tJeeKeeKidstime01\n\nEnjoy the Movie's\n\n************************************\n\nKom ook eens kijken :\n &lt;a href=&quot;\nhttp://www.black-sam.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.black-sam.org&lt;/a&gt;\n\nEnjoy\n\n*************************************\n \t\n\n","torrent":{"xt":"urn:btih:27847618d0c49a5d3606e637c94e7090cb3a1a87","amp;dn":"JeeKee%5C%27s+Kidstime+1+DVD+5%28+4+Films+op+1+DVD+Ned++Audio%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27847618d0c49a5d3606e637c94e7090cb3a1a87","infoHashBuffer":{"type":"Buffer","data":[39,132,118,24,208,196,154,93,54,6,230,55,201,78,112,144,203,58,26,135]},"announce":[],"urlList":[]}}