{"title":"Anti Keylogger Shield V2.3","uid":4144261,"size":795669,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:27a399f76cccf8621e9c4f85427ded0899508494&amp;dn=Anti+Keylogger+Shield+V2.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"oncommingstorm","files":1,"time":1208646140,"description":"Anti Keylogger Shield is a powerful, easy to use anti-spy software tool that prohibits operation of any keylogger, either know or unknown, professional or custom made. Once installed, Anti Keylogger Shield will run silently in your System Tray, block the system mechanisms that are exploited by keyloggers, and protect your privacy immediately and constantly.\n\nKeyloggers are small spy programs, that record everything one types on the computer, including documents, emails, usernames and passwords, and then either store this information in a hidden place on your computer for the person to obtain it later or send it over to the Internet to the person who infiltrated it.\n\nKeyloggers can come in many ways, as emails, viruses, trojan horses; from people you know might try to invade your privacy and see what you are typing, or remote hackers might want to stole usernames and passwords as you type it.\n\nUnlike similar programs, Anti Keylogger Shield does not use a signature database, and it will not try to detect keyloggers. Anti Keylogger Shield will simply block the very mechanisms that are used by known and unknown keyloggers, and these will not work anymore.","torrent":{"xt":"urn:btih:27a399f76cccf8621e9c4f85427ded0899508494","amp;dn":"Anti+Keylogger+Shield+V2.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27a399f76cccf8621e9c4f85427ded0899508494","infoHashBuffer":{"type":"Buffer","data":[39,163,153,247,108,204,248,98,30,156,79,133,66,125,237,8,153,80,132,148]},"announce":[],"urlList":[]}}