{"title":"Klaus Wunderlich - 1969 - Hammond Pops, vol. 4 [SLE 14 562-P]","uid":3982217,"size":65330392,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:291d2ebf043ebb231c7862b4cf958b319d900c62&amp;dn=Klaus+Wunderlich+-+1969+-+Hammond+Pops%2C+vol.+4+%5BSLE+14+562-P%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zitek","files":1,"time":1200611224,"description":"Klaus Wunderlich. \nFor people with musically fine-tuned ears and broad accept of music.\n\n\nThe Hammond organ Klaus used is a very heavy analogue electro-mechanical piece of musical instrument which produces a somewhat unique sound. To every different note produced there is a tonewheel spinning generating the sound. The drawbars, vibrato, percussion clicks and more provides endless combinations and variations of sounds.\n\nSet the sound aside for a moment and listen to his clever interpretations. You&amp;#039;ll soon notice what he often commented; he didn&amp;#039;t like angry, agressive music, but music that would rather cheer you up and put you in a good mood.\n\nThe recordings are multitracked, but considering this was done at the end of the 60ies with analogue tape recording equipment it&amp;#039;s quite impressive. Other than the Hammond, the lineup consists of guitar bass, rhythm guitar and drums.\n\nMixed into the medleys you find songs very popular at that time like Hey Jude, Early in the Morning, Aquarius (from the musical by the same name), Honky Tonk Woman and Oh, Happy Day.\n\n\nTRACKLISTING\n\n01 - Ein bisschen Goete, ein bisschen Bonaparte -- Early In The Morning -- Goodbye -- Hinter den Kulissen von Paris\n02 - In The Year 2525 -- Karamba, Karacho, ein Whisky\n03 - Das Madchen Carina -- Let The Sunshine In -- Good Morning Starshine\n04 - Hey Jude -- Saved by the Bell\n05 - Pretty Belinda -- Helicopter US Navy 66 -- Mendocino\n06 - Heute so, Morgen so -- Aquarius -- Lady Carneval\n07 - Er steht im Tor -- Anuschka -- Komm an meine grune Seite\n08 - Scheiden tut so weh -- Honky Tonk Woman -- Heather Honey\n09 - Lied meiner Liebe -- Was damals war\n10 - Ein Gluck, dass man das Gluck nicht kaufen kann -- Sie tragt blau, blau, blau -- Oh, Happy Day\n\nTotal running time 41:08.\n\nEnjoy!","torrent":{"xt":"urn:btih:291d2ebf043ebb231c7862b4cf958b319d900c62","amp;dn":"Klaus+Wunderlich+-+1969+-+Hammond+Pops%2C+vol.+4+%5BSLE+14+562-P%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"291d2ebf043ebb231c7862b4cf958b319d900c62","infoHashBuffer":{"type":"Buffer","data":[41,29,46,191,4,62,187,35,28,120,98,180,207,149,139,49,157,144,12,98]},"announce":[],"urlList":[]}}