{"title":"Left.Behind.3.Rise.of.the.Antichrist-SKIDROW","uid":6032011,"size":1362692627,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2aebc8d368c5d67b532769eebc4a19582e42d83b&amp;dn=Left.Behind.3.Rise.of.the.Antichrist-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":".BONE.","files":31,"time":1292108838,"description":"S K i D R O W\n\nT H E L E A D i N G F O R C E\n\nproudly presents\nLeft Behind 3: Rise of the Antichrist / LB Games\n\nRELEASE DATE : 10-12-2010 PROTECTION : Serial + Auth\nGAME TYPE : Strategy DISKS : 1 DVD\n\nRelease Notes:\n\nThe Skid Rowdies are looking new blood to fill up the ranks.\nWe're a professional team of dedicated sceners with big mark\nunder sceners. We believe on the ground idealism of the root\nof the real old school scene. We do all this for fun and\nnothing else. We don't earn anything on our hobby, as we do\nthis for the competition and the heart of what got the scene\nstarted in the mid eighties.\n\nIf you think you got something to offer, then don't hold back\non contacting us as soon as possible.\n\ntwice the fun \\/ double the trouble\n\nOn with the game release information:\n\nLEFT BEHIND 3: Rise of the Antichrist is a real-time strategy\ngame based on the best-selling LEFT BEHIND book series,\ncreated by Tim LaHaye and Jerry Jenkins. Join the ultimate\nfight of Good versus Evil, commanding the Tribulation Forces,\nthe Global Community Peacekeepers and the American Militia!\n\nIn the third chapter of the Left Behind PC Game series, gamers\nwill enjoy all new building graphics, improved missions and\nover 40 new interactive movies to enhance the storyline.\n\nThe game includes 46 single player missions including\ntutorials, 3 multiplayer modes, 39 maps, and a robust skirmish\nmode allowing you to play against the computer by yourself or\nwith up to 7 friends online.\n\nGeared toward players of all ages 13 and up, three levels of\ncomputer difficulty will challenge even the most experienced\nRTS gamer. Easy to understand controls and a comprehensive\ntutorial will ease even the most inexperienced gamer into a\nthriving, relasitic depiction of a future New York City on the\nbrink of World War III.\n\nAll new enhanced building graphics depict a thriving future\nNew York City.\n\nOver 40 new interactive movies to enhance the storyline and\nbring you closer to the action.\n\nCombat the Antichrist's forces on two battle fronts - physical\nand spiritual warfare: Use the power of prayer and worship to\nresist spiritual influences and defend against their physical\nattacks.\n\nControl more than 40 unit types, each developed with unique\nattributes, special abilities, and witness Angelic appearances\nand Demonic battles as a direct result of your choices.\n\nOver 40 new interactive movies to enhance the storyline and\nbring you closer to the action.\n\nChoose to play with up to 7 friends for free! Play with your\nfriends against the computer in skirmish mode or team up with\nthe computer to defeat your friends.\n\nFeaturing an original soundtrack by award-winning composer,\nChance Thomas (King Kong, Avatar, Lord of the Rings).\n\nInstall Notes:\n\n1. Unpack release\n2. Mount image or burn it\n3. Install\n4. Copy the cracked content from the SKIDROW folder on the DVD\nto the main installation folder and overwrite\n5. Play the game\n\nSupport the companies, which software you actually enjoy!\n\nGreetings:\n\nSalutes to our old Amiga friends from:\n\nFAIRLIGHT - RAZOR 1911 - VISION FACTORY - PARADOX - QUARTEX\nDCS - CRYSTAL - ZENITH - ACCESSION - ALPHA FLIGHT - PRODIGY\nTHE COMPANY - LEGEND - TRSI - ORACLE - ANTHROX - CLASSIC\n\nSalutes to our new friends in:\n\nUNLEASHED - TiNYiSO - BReWErS - RADIKAL - POSTMORTEM - SHOCK\nFAIRLIGHT - CRUDE - VACE - ReUnion - OUTLAWS - GENESIS\n\nLogo and layout by: Eboy/SAE\nLast updated 21/07/2007 by [XXX]","torrent":{"xt":"urn:btih:2aebc8d368c5d67b532769eebc4a19582e42d83b","amp;dn":"Left.Behind.3.Rise.of.the.Antichrist-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2aebc8d368c5d67b532769eebc4a19582e42d83b","infoHashBuffer":{"type":"Buffer","data":[42,235,200,211,104,197,214,123,83,39,105,238,188,74,25,88,46,66,216,59]},"announce":[],"urlList":[]}}