{"title":"Off Season - Jack Ketchum","uid":8897410,"size":221294,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2b47b011ae5fed0d7270236565d7b52e801b8db8&amp;dn=Off+Season+-+Jack+Ketchum&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TheRose88","files":1,"time":1378733550,"description":"Off Season Book I - Jack Ketchum  (epub)\n\n\n\nthis merciless tale of human evil in the Maine woods went out of print soon after publication, its bleak vision and extreme violence still influence horror today. Only a novel of expert articulation and emotional truth can cast such a long shadow, and Ketchum's is both. Horror critic Winter calls the book one of &quot;remarkable elegance,&quot; and indeed it's drum tight. Equally impressively, Ketchum uses the devastation of a group of tourists by a band of cannibals not to pander, as so many horror writers after him have done, but to explore with intelligence (and ferocity) the nature of evil and of the human spirit that can resist it. The novel's structure isn't original, modeled largely on the film Night of the Living Dead, but its events unfold with shocking energy and directness. The imagery is cruelAbloody battles between the tourists and cannibals, torture and consumption by the cannibals of their victimsAas is the arbitrariness of who will live and who will die; but always Ketchum is in command. In an afterword, Ketchum details the rough history of the novel, explaining how he has reinserted cuts forced by Ballantine. This signed and limited edition not only revives a horror classic and offers some neat publishing lore, but also reminds us that, once upon a time, some of the most exciting genre writing came in paper covers","torrent":{"xt":"urn:btih:2b47b011ae5fed0d7270236565d7b52e801b8db8","amp;dn":"Off+Season+-+Jack+Ketchum","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b47b011ae5fed0d7270236565d7b52e801b8db8","infoHashBuffer":{"type":"Buffer","data":[43,71,176,17,174,95,237,13,114,112,35,101,101,215,181,46,128,27,141,184]},"announce":[],"urlList":[]}}