{"title":"Portishead - Saturnine","uid":4383881,"size":24563523,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2b695cb3ac6b126895f90dca3f3cc16f5948ffad&amp;dn=Portishead+-+Saturnine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Villeroy","files":7,"time":1220810858,"description":"Portishead - Saturnine\nBootleg\nCompiled in: 2008\n\n1. Requiem For Anna (Un Jour Comme Un Autre - Anna) (2:39)\n2. Key Bored (5:57)\n3. Saturnine (3:51)\n4. Waiting For... (5:25)\n5. Greek Jam (2:03)\n\n\nFor all of you who are disappointed about the lack of B-sides from the Third sessions or about the initially-promised-but-not-delivered bonus track from the Japanese issue of Third, here&amp;#039;s Saturnine. This is a bootleg comprimising the relatively few leaked songs from the period between the self-titled album and the actual Third sessions - and nothing more. No remixes (that&amp;#039;s what Trip-Hop Reconstruction and Portishead Remixes vol. 1 &amp; 2 are for) and no tagging stuff from Mandalay or Jane Birkin as Portishead (and no Beth Gibbons &amp; Rustin Man stuff either). Just Portishead tracks. As a side note, this bootleg was titled not after the Saturnine song in it, but after the initial working title of Third. Don&amp;#039;t know if they actually thought of naming their third album Saturnine (the teaser on YouTube is certainly fake, with a theme by another artist, not Poritshead), but Geoff did said that Saturnine and Waiting For... are merely old &quot;doodles&quot;, which means though that they&amp;#039;re genuine Portishead songs. Come to think of it, I would have prefered Third to be named Saturnine and sound like those two excellent songs...\nNevertheless, I hope you guys will enjoy my effort to compile these songs and put them in one place.\n\nSide notes:\n\n- Track 1 is taken from &quot;Monsieur Gainsbourg Revisited&quot; (check out that compilation, there&amp;#039;s also a rare Tricky song on it), track 2 and 5 are from MySpace, while 3 and 4 are from the Saturnine leak on iSound.\n\n- Track 1 is vocal (even though you might not recognize the voice, it&amp;#039;s Beth Gibbons who is singing) while 2-5 are instrumental.\n\n- Track 4 samples... erm, I don&amp;#039;t know what it samples.\n\n- Track 5 is actually one single loop (or a combination of loops). It will likely appeal to drone/dark ambient aficionados or to some of the fans of the most gloomy moments on Third.\n\n- Back on MySpace, Key Bored and Greek Jam both had attached to them pics and album information bars. A pic that might be the logo of a security company (from Portishead?) and a line intriguinly called &quot;big angry one... grr&quot; was attached to Key Bored, while at Greek Jam the player said something like &quot;our third album/2006 (or 2007?) island&quot; - don&amp;#039;t remember whole of it. Greek Jam&amp;#039;s pic was apparently a screenshot from a very old computer game though.\n\n- The cool avatar of their MySpace is from a Stanley Kubrick film. ;)","torrent":{"xt":"urn:btih:2b695cb3ac6b126895f90dca3f3cc16f5948ffad","amp;dn":"Portishead+-+Saturnine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b695cb3ac6b126895f90dca3f3cc16f5948ffad","infoHashBuffer":{"type":"Buffer","data":[43,105,92,179,172,107,18,104,149,249,13,202,63,60,193,111,89,72,255,173]},"announce":[],"urlList":[]}}