{"title":"Butch.Cassidy.And.The.Sundance.Kid.1969.DVDr-DVD-Avbild","uid":3610761,"size":4698463309,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2bd005027a3fc5edc12c8ff713fcdf27b12d3fa5&amp;dn=Butch.Cassidy.And.The.Sundance.Kid.1969.DVDr-DVD-Avbild&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"trixiehobbit","files":3,"time":1170599269,"description":"Butch Cassidy and the Sundance Kid were real-life, turn-of-the-century outlaws who, in 1905, packed up their saddlebags, along with Sundance&amp;#039;s mistress (a schoolteacher named Etta Place), and left the shrinking American West to start a new life, robbing banks in Bolivia.\n\nAccording to the movie which opened yesterday at the Penthouse and Sutton Theaters, their decline and fall was the sort of alternately absurd and dreamy saga that might have been fantasized by Truffaut&amp;#039;s Jules and Jim and Catherine?before they grew up.\n\nButch (Paul Newman) is so amiable that it&amp;#039;s not until he gets to Bolivia, and is more or less forced to go straight, that he ever brings himself to shoot a man. Sundance (Robert Redford) behaves like the perpetual younger brother. Although confident of his own abilities, he always defers to Butch, whose schemes end in disaster more often than success. Etta (Katharine Ross) is the kind of total woman who can cook, keep house of sorts, seldom grumbles, and, if necessary, will act as third gun.\n\nThis is an attractive conceit and much of Butch Cassidy and the Sundance Kid is very funny in a strictly contemporary way?the last exuberant word on movies about the men of the mythic American West who have outlived their day. Butch and Sundance have the physical graces of classic Western heros, but all four feet are made of silly putty.\n\nWhen they try to rob a train and blow open its safe, the dynamite charge destroys not only the safe but also the entire baggage car. When they can escape from a posse only by jumping from a high cliff into a raging rapids below, Sundance must admit ruefully that he doesn&amp;#039;t know how to swim.\n\nLater, in Bolivia, their first attempt at bank robbery almost fails when they forget a list of Spanish phrases not included in the ordinary tourist&amp;#039;s guidebook: &quot;This is a robbery.&quot; &quot;Stand against the wall.&quot; &quot;Put up your hands.&quot; Butch and Sundance are the fall guys of their time and circumstances, and also of their movie.\n\nGeorge Roy Hill (Thoroughly Modern Millie, Hawaii) who directed, and William Goldman, the novelist (Boys and Girls Together) and occasional scenarist (Harper), who wrote the original screenplay, have consciously mixed their genres. Even though the result is not unpleasant, it is vaguely disturbing?you keep seeing signs of another, better film behind gags and effects that may remind you of everything from Jules and Jim to Bonnie and Clyde and The Wild Bunch.\n\nIn the center of the movie is a lovely, five-minute montage?done in sepia still photographs of the period?showing Butch, Sundance, and Etta having a brief fling in New York and making the steamer passage to South America. The stills tell you so much about the curious and sad relationship of the three people that it&amp;#039;s with real reluctance that you allow yourself to be absorbed again into further slapstick adventures.\n\nThere is thus, at the heart of Butch Cassidy, a gnawing emptiness that can&amp;#039;t be satisfied by an awareness that Hill and Goldman probably knew exactly what they were doing?making a very slick movie. They play tricks on the audience, by turning a bit of melodrama into a comic blackout, and by taking shortcuts to lyricism as when we get an extended sequence showing Butch clowning on a bicycle for the benefit of Etta backed by full orchestra playing Burt Bachrach&amp;#039;s latest. I admire Bachrach but he simply is not Georges Delarue, as Hill is not Truffaut; nor, for that matter, is Goldman.\n\nThere are some bothersome technical things about the movie (the camera is all zoom, zoom, zoom) but the over-all production is very handsome, and the performances fine, especially Newman, Redford, and Miss Ross, who must be broadly funny and straight, almost simultaneously. They succeed even if the movie does not.\n\nCAST FOR &amp;#039;BUTCH CASSIDY AND THE SUNDANCE KID\nPaul Newman - Butch Cassidy\nRobert Redford - The Sundance Kid\nKatharine Ross - Etta Place\nStrother Martin - Percy Garris\nHenry Jones - Bike Salesman\nJeff Corey - Sheriff Bledsoe\nGeorge Furth - Woodcock\nCloris Leachman - Agnes\nTed Cassidy - Harvey Logan\nKenneth Mars - Marshal\nDonnelly Rhodes - Macon\nJo Gilbert - Large Woman\nTimothy Scott - News Carver\nDon Keefer - Fireman\nCharles Dierkop - Flat Nose Curry\nFrancisco Cordova - Bank Manager\nNelson Olmsted - Photographer\nPaul Bryar - Card Player #1\nSam Elliott - Card Player #2\nCharles Akins - Bank Teller\nEric Sinclair - Tiffany&amp;#039;s Salesman\n\nPRODUCTION CREDITS\nLawrence Schiller - Special Effects\nPaul Monash - Executive Producer\nDan Striepeke - Makeup\nRichard Meyer - Editor\nWalter Scott - Set Designer\nJack Martin Smith - Art Director\nMichael Moore - Second Unit Director\nDavid Dockendorf - Sound/Sound Designer\nSteven Bernhardt - First Assistant Director\nMichael McLean - Casting\nJohn C. Howard - Editor\nChester L. Bayhi - Set Designer\nBurt Bacharach - Composer (Music Score)\nJohn C. Foreman - Producer\nConrad L. Hall - Cinematographer\nWilliam Goldman - Screenwriter\nArt Cruickshank - Special Effects\nGeorge Roy Hill - Director\nAndrew Horvitch - Editor\nL.B. Abbott - Special Effects\nHal David - Songwriter\nEdith Head - Costume Designer\nPhilip M. Jefferies - Art Director\n\nAWARDS\nBest Actor (win) - Robert Redford - 1970 British Academy Awards\nBest Actress (win) - Katharine Ross - 1970 British Academy Awards\nBest Cinematography (win) - Conrad L. Hall - 1970 British Academy Awards\nBest Direction (win) - George Roy Hill - 1970 British Academy Awards\nBest Film (win) - George Roy Hill - 1970 British Academy Awards\nBest Editing (win) - John C. Howard - 1970 British Academy Awards\nBest Editing (win) - Richard Meyer - 1970 British Academy Awards\nBest Screenplay (win) - William Goldman - 1970 British Academy Awards\n100 Greatest American Movies (win) - - 1998 American Film Institute\nBest Director (nom) - George Roy Hill - 1969 Directors Guild of America\nBest Picture - Drama (nom) - - 1969 Golden Globe\nBest Screenplay (nom) - William Goldman - 1969 Golden Globe\nBest Original Score (win) - Burt Bacharach - 1969 Golden Globe\nBest Original Song (nom) - Burt Bacharach - 1969 Golden Globe\nBest Original Song (nom) - Hal David - 1969 Golden Globe\nBest Cinematography (win) - Conrad L. Hall - 1969 Academy\nBest Director (nom) - George Roy Hill - 1969 Academy\nBest Original Screenplay (win) - William Goldman - 1969 Academy\nBest Picture (nom) - - 1969 Academy\nBest Original Score (win) - Burt Bacharach - 1969 Academy\nBest Song (win) - Hal David - 1969 Academy\nBest Song (win) - Burt Bacharach - 1969 Academy\nBest Sound (nom) - David Dockendorf - 1969 Academy\n\n\nIMDB-link......: http://www.imdb.com/title/tt0064115/\n\nYear.............: 1969\nCountry..........: USA\nAudio............: English, German, Spanish\nSubtitles........: English, German, Spanish\nVideo Format.....: widescreen\nDVD Source.......: dvd9\nDVD Format.......: pal\nDVD distributor..:\nProgram..........: DVDShrink\nBit Rate.........: average\n\n\nMenus..........: [x] Untouched, intact.\n                [ ] Stripped\n\nVideo..........: [x] Untouched, intact.\n                [ ] Re-encoded\n\nDVD-extras.....: [ ] Untouched, intact.\n                [ ] Stripped\n                [x] Re-encoded\n                [ ] None\n\nDVD-Audio......: [x] Untouched, intact.","torrent":{"xt":"urn:btih:2bd005027a3fc5edc12c8ff713fcdf27b12d3fa5","amp;dn":"Butch.Cassidy.And.The.Sundance.Kid.1969.DVDr-DVD-Avbild","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bd005027a3fc5edc12c8ff713fcdf27b12d3fa5","infoHashBuffer":{"type":"Buffer","data":[43,208,5,2,122,63,197,237,193,44,143,247,19,252,223,39,177,45,63,165]},"announce":[],"urlList":[]}}