{"title":"PC Security Tweaker  7.6 setup Serial Included.zip","uid":4437384,"size":1927315,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2d1916adf5cdb8e7f5b251de408e87f9000b9d57&amp;dn=PC+Security+Tweaker++7.6+setup+Serial+Included.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mcfilthynasty","files":1,"time":1223634149,"description":"PC Secuity Tweaker 7.6\n PC Security Tweaker is a security tweaking utility you can use to tweak Windows-based computers. It is compatible with all Windows versions and lets you control which users are allowed to access your PC and the level of access each user may have. You can choose to tweak access to lots of Control Panel applet functions, including Display, Network, Passwords, Printers, System, Add/Remove Programs, etc. You can enforce users to use separate system profile folders and provide them with their own custom shell folders such as Desktop, Start Menu, Favorites, My Documents. Additionally, by tweaking, you can: disable selected Start Menu items, lock and protect disk drives in My Computer, disable the DOS and command prompt, interruption boot keys, real DOS mode, Registry editing, taskbar, task manager, and network access, hide desktop icons, and much more. You can password-protect Windows and restrict users to running specific applications only. Security tweaks can be applied universally or just to specific users. This software also lets you tweak Internet Explorer to secure web browsing.\n\n\nSecurity Tools - security tools to password-protect PC\n\n* Bulletproof Public PC - public access PC kiosk\n* PC Security Tweaker - tweak to secure Windows PC\n* IP Address Shield - hide your IP address\n* Internet Trace Destroyer - remove history and tracks\n* Encrypt My Information - encrypt files on fly\n* Lock My Computer - create a public access PC\n\nAdvanced File Vault - hide &amp; lock your files\n\nDVD Device Lock - control access to device drives\n* Access Controller - lock desktop with password\n* File Access Scheduler - control access to files\n* File and Folder Privacy - protect your data\n* Outlook Express Privacy - protect e-mail messages\n\nInternet Tools - email and Internet tools, SMTP servers and mass mailers\n\n* Best Mass Mailer - mass email tool\n* Personal Mail Server Pro - SMTP/POP3 mail server\n* Local SMTP Server Pro - use PC as SMTP server\n* Email Arrival Notifier - be informed of the new emails\n\nTrading Tools - trading strategy testing software\n\n* Trading Strategy Tester for FOREX - test then invest\n\n\nScanned with Kaspersky - Clean\n\nEnjoy","torrent":{"xt":"urn:btih:2d1916adf5cdb8e7f5b251de408e87f9000b9d57","amp;dn":"PC+Security+Tweaker++7.6+setup+Serial+Included.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d1916adf5cdb8e7f5b251de408e87f9000b9d57","infoHashBuffer":{"type":"Buffer","data":[45,25,22,173,245,205,184,231,245,178,81,222,64,142,135,249,0,11,157,87]},"announce":[],"urlList":[]}}