{"title":"Hack the Stack {BBS}","uid":6909574,"size":12682392,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2ddd1a0019bd888f568b82ee1f1217460b1b571a&amp;dn=Hack+the+Stack+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1324733549,"description":"                                 ___ _          _     _                       \n  /\\/\\   ___ _ __ _ __ _   _    / __\\ |__  _ __(_)___| |_ _ __ ___   __ _ ___ \n /    \\ / _ \\ '__| '__| | | |  / /  | '_ \\| '__| / __| __| '_ ` _ \\ / _` / __|\n/ /\\/\\ \\  __/ |  | |  | |_| | / /___| | | | |  | \\__ \\ |_| | | | | | (_| \\__ \\\n\\/    \\/\\___|_|  |_|   \\__, | \\____/|_| |_|_|  |_|___/\\__|_| |_| |_|\\__,_|___/\n                       |___/                                                  \n\n******************************************************************************\n\nThis book looks at network security in a new and refreshing way. It guides readers step-by-step through the &quot;stack&quot; -- the seven layers of a network. Each chapter focuses on one layer of the stack along with the attacks, vulnerabilities, and exploits that can be found at that layer. The book even includes a chapter on the mythical eighth layer: The people layer.\n\nThis book is designed to offer readers a deeper understanding of many common vulnerabilities and the ways in which attacker's exploit, manipulate, misuse, and abuse protocols and applications. The authors guide the readers through this process by using tools such as Ethereal (sniffer) and Snort (IDS). The sniffer is used to help readers understand how the protocols should work and what the various attacks are doing to break them. IDS is used to demonstrate the format of specific signatures and provide the reader with the skills needed to recognize and detect attacks when they occur.\n\nWhat makes this book unique is that it presents the material in a layer by layer approach which offers the readers a way to learn about exploits in a manner similar to which they most likely originally learned networking. This methodology makes this book a useful tool to not only security professionals but also for networking professionals, application programmers, and others. All of the primary protocols such as IP, ICMP, TCP are discussed but each from a security perspective. The authors convey the mindset of the attacker by examining how seemingly small flaws are often the catalyst of potential threats. The book considers the general kinds of things that may be monitored that would have alerted users of an attack.\n\n* Remember being a child and wanting to take something apart, like a phone, to see how it worked? This book is for you then as it details how specific hacker tools and techniques accomplish the things they do.\n\n* This book will not only give you knowledge of security tools but will provide you the ability to design more robust security solutions\n\n* Anyone can tell you what a tool does but this book shows you how the tool works\n\n\n\n# Paperback: 416 pages\n# Publisher: Syngress; 1 edition (December 27, 2006)\n# Language: English\n# ISBN-10: 1597491098\n# ISBN-13: 978-1597491099","torrent":{"xt":"urn:btih:2ddd1a0019bd888f568b82ee1f1217460b1b571a","amp;dn":"Hack+the+Stack+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ddd1a0019bd888f568b82ee1f1217460b1b571a","infoHashBuffer":{"type":"Buffer","data":[45,221,26,0,25,189,136,143,86,139,130,238,31,18,23,70,11,27,87,26]},"announce":[],"urlList":[]}}