{"title":"TeacherFucksTeens - Elsa Jean, Katie Morgan (Student Teacher Con","uid":15310984,"size":374789654,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:2e411ab1005e5c4cd6f290c7d89827dfd23a82b5&amp;dn=TeacherFucksTeens+-+Elsa+Jean%2C+Katie+Morgan+%28Student+Teacher+Con&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xxxlavalxxx","files":2,"time":1468580285,"description":"Katie Morgan has come to Elsa Jean's house to have a parent teacher conference about Elsa's behavior making out with Rion King between classes. She requests a demonstration of what everyone is complaining about, and soon Elsa and Rion are liplocked. Katie is unimpressed with the display that has generated the complaints, so she offers to show them what a real sloppy makeout session looks like. She has two willing students, and soon their kissing lessons turn into more.Encouraging both of her students to even greater acts of sexuality, Katie offers to help Elsa learn how to suck dick better. They spend plenty of time on this lesson much to Rion's delight, and then get him even hornier as Katie helps herself and Elsa out of their clothes. After a long kiss, Katie shows Elsa how to eat pussy in a delectable 69 while Rion watches with the utmost enjoyment.Bringing Rion back into the action, Katie guides her students through all kinds of satisfying threesome positions as she and Elsa take turns eating out each other's dripping fuck holes while Rion fucks the other. Once Katie has ensured that she and Elsa have had their fill of cumming, she urges Rion right to the edge of his own endurance. At the very last moment she has him pull out of Elsa's twat so that he can cover her shaved pussy in his jizz that Katie licks up and then snowballs with Elsa.\r\nCategories: Small Boobs Big Boobs Shaved Pussy Short Girls Blonde Long hair Bras Hardcore Thongs High Heels Petite Girl-Girl-Boy Blowjob Pussy Licking\r\n \nhttp://imgdone.com/viewer.php?file=70197118793839536100.jpg\r\n \nhttp://imgdone.com/viewer.php?file=34149949266800808654.jpg","torrent":{"xt":"urn:btih:2e411ab1005e5c4cd6f290c7d89827dfd23a82b5","amp;dn":"TeacherFucksTeens+-+Elsa+Jean%2C+Katie+Morgan+%28Student+Teacher+Con","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e411ab1005e5c4cd6f290c7d89827dfd23a82b5","infoHashBuffer":{"type":"Buffer","data":[46,65,26,177,0,94,92,76,214,242,144,199,216,152,39,223,210,58,130,181]},"announce":[],"urlList":[]}}