{"title":"Victor Victoria 1982 (DivX) Souvenir version - Michael Rizzo","uid":5899656,"size":1042649723,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2ec6e3669cc9fe19603c53ee3e8d0712f3a0d50e&amp;dn=Victor+Victoria+1982+%28DivX%29+Souvenir+version+-+Michael+Rizzo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moviesbyrizzo","files":-1,"time":1287640082,"description":"For those of you patiently waiting for our full HD version (2GB)\nWe hope soon to be able to purchase an HD version at the store\n(when its available)to make a conversion for you at supreme resolution\nrates for the nice, larger HDTV sets now in use. \n\nThis offering we now bring to you is fresh conversion from a brand\nnew NTSC format DVD just before we donated the original to the local\nLibrary. It is therefore the longer version of this movie, \nin full 720 X 480 lovely wide-screen format (same as the DVD picture)\nand with lovely 192k audio too! We even include a souvenir kit of \nthe best songs from the movie in mp3 format along with subtitles\nwe extracted from the disc into srt files for French, Spanish and\nPortuguese needs. That's all there was for these subtitles here,\nI'm afraid to say. We wll have a PAL converted version (multi-sub)\nfor all the other Euro language offerings in subtitles too, and soon!\nThe moment it is available we expect to have an HD 720p version\nposted for you too!\n\nWhile this is now in standard DivX, we also have the identical movie\nin Xvid for those that need it, with identical quality all the \nway through. A separate posting will follow after this launch is underway.\n\n\n\nVictor Victoria is a most favorite of my movies personally in that I find\nit does wonders for the spirit to have Julie Andrews and Robert Preston\nrepartee as they do in situations that certainly do serve as inspiration\nto loftier attempts to articulate with clever wit, and with intelligence\nthat is as I say, in great sprit, certainly!\n\nThe &quot;dinner at the ritz without a wallet&quot; scene is unforgettable and \na &quot;tour de force&quot; around the Hollywood sets when you consider their \nmore recent exploits at the box office, by comparison.\n\nJulie Andrews shows a great spirit in her drive to keep her sensibilities\nintact despite being in what is an impoverished state financially\nat the moment in time.\n\nThe idea that a generous spirit couldn't begrudge this gal a meal even\nif the gesture has to be contrived in this fashion speaks to the sense of \nidealism and optimism f the human spirit that Ms. Andrews is wanting\nus to believe in here, even if its differently manifested to fit whatever\ncircumstances we may apply the principle to.\n\n\nWe ask for your seeding support \nwith thanks! Michael Rizzo Chessman\n\n","torrent":{"xt":"urn:btih:2ec6e3669cc9fe19603c53ee3e8d0712f3a0d50e","amp;dn":"Victor+Victoria+1982+%28DivX%29+Souvenir+version+-+Michael+Rizzo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ec6e3669cc9fe19603c53ee3e8d0712f3a0d50e","infoHashBuffer":{"type":"Buffer","data":[46,198,227,102,156,201,254,25,96,60,83,238,62,141,7,18,243,160,213,14]},"announce":[],"urlList":[]}}