{"title":"27 Killer Stories From The Cream of Crimewriters - OxCrimes","uid":13052553,"size":3081462,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2fd3d3b6f2647ad4448efb80031d5da8e17c7409&amp;dn=27+Killer+Stories+From+The+Cream+of+Crimewriters+-+OxCrimes&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1450634047,"description":"OxCrimes is introduced by Ian Rankin and has been curated by Peter Florence, director of Hay Festival. The stellar cast of contributors will include Mark Billingham, Alexander McCall Smith, Anthony Horowitz, Val McDermid, Peter James, Adrian McKinty, Denise Mina, Louise Welsh and a host of other compelling suspects.\r\n\r\nReview\r\n\r\nPraise for Ox-Tales: 'A fabulous insight into the literary landscape today Aesthetica An admirable and ingenious idea... There are many gems... This collection disproves claims that the short story is on its last legs. It is also a rare treat to be able to read literature that literally improves the world -- Sebastian Shakespeare Tatler An excellent anthology -- Jake Kerridge Daily Telegraph A diverse, compelling collection of crime stories Good Housekeeping Collections of crime short stories don't get any better than this -- Marcel Berlins Times Several of the starry contributors [are] on rare form ... a cherishable collection. -- Barry Forshaw FT A collection of 27 chilling short stories, written by the cream of the crop of crime writers Now Magazine\r\n\r\nAbout the Author\r\n\r\nOxCrimes is introduced by Britain's greatest crime writer, Ian Rankin, and features pieces by Mark Billingham, Alexander McCall Smith, Anthony Horowitz, Ian Rankin, Val McDermid, George Pelecanos, Peter James, Adrian McKinty, Denise Mina, Louise Welsh, Ann Cleeves, John Connolly, Stella Duffy, Christopher Fowler, Fred Vargas, Neil Gaiman, John Harvey, Maxim Jakubowski, Simon Lewis, Walter Mosley, Stuart Neville, Phil Rickman, Peter Robinson, James Sallis, Yrsa Sigurdardottir, Martyn Waites and Anne Zouroudi with an afterword by Mark Goldring, Oxfam CEO","torrent":{"xt":"urn:btih:2fd3d3b6f2647ad4448efb80031d5da8e17c7409","amp;dn":"27+Killer+Stories+From+The+Cream+of+Crimewriters+-+OxCrimes","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fd3d3b6f2647ad4448efb80031d5da8e17c7409","infoHashBuffer":{"type":"Buffer","data":[47,211,211,182,242,100,122,212,68,142,251,128,3,29,93,168,225,124,116,9]},"announce":[],"urlList":[]}}