{"title":"Foundations of Nanomechanics - From Solid-State Theory to Device","uid":15480962,"size":6680910,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2ff03a38413870c56e67f642378090b84ccb36d0&amp;dn=Foundations+of+Nanomechanics+-+From+Solid-State+Theory+to+Device&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1470253246,"description":"Foundations of Nanomechanics - From Solid-State Theory to Device Applications - Andrew N. Cleland (Springer, 2003).djvu\r\n\r\nWhy write another book on mechanics? There are, after all, a number of excellent texts that describe in great detail the way classical solids behave when acted upon by static and time-varying forces; many of these are cited in this monograph. These texts treat solids as continuous objects, and quantum mechanics does not enter the discussion. Furthermore, the atomic nature of the solid is implicit, but does not enter in a central role. At the other end of the spectrum, texts on condensed matter physics focus on the quantum mechanical nature of the solid; these contain quite clear descriptions of acou stic waves in solids, describing their dynamic and thermal properties, and how they interact with electrons in the solid, but contain little information regarding bulk deformations. This text, focussing on the mechanics of very small objects, attempts to provide a link between these two approaches; in addition to describing the theories of both the classical and the quantum mechanical solid, I attempt to outline where the classical description breaks down, and quantum mechanics must be applied, to understand the behavior of a nanoscale object. I have tried to merge the continuum description of the solid with the atomic one, and to show how and where quantum mechanics plays a role, especially as the size scale of the system is reduced, making the quantized energy scale larger and the role of thermal vibrations more important","torrent":{"xt":"urn:btih:2ff03a38413870c56e67f642378090b84ccb36d0","amp;dn":"Foundations+of+Nanomechanics+-+From+Solid-State+Theory+to+Device","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ff03a38413870c56e67f642378090b84ccb36d0","infoHashBuffer":{"type":"Buffer","data":[47,240,58,56,65,56,112,197,110,103,246,66,55,128,144,184,76,203,54,208]},"announce":[],"urlList":[]}}