{"title":"Rawhide (1951) Western - Xvid 1cd -  Subs-Eng-Fr-Sp -Tyronne Pow","uid":11426186,"size":887285567,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:300d5e91db04bd58f119a3ed88cb7ec01530950d&amp;dn=Rawhide+%281951%29+Western+-+Xvid+1cd+-++Subs-Eng-Fr-Sp+-Tyronne+Pow&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SaM","files":-1,"time":1415668628,"description":"Rawhide (1951) Western - Xvid 1cd -  Subs-Eng-Fr-Sp -Tyronne Power, Susan Hayward [DDR]\n\nRawhide is a 1951 Western film made by Twentieth Century-Fox. It was directed by Henry Hathaway and produced by Samuel G. Engel from a screenplay by Dudley Nichols. \nThe music score was by Sol Kaplan and the song &quot;A Rollin' Stone&quot; by Lionel Newman. The cinematography was by Milton R. Krasner.\nThe film stars Tyrone Power and Susan Hayward with Hugh Marlowe, Dean Jagger, Edgar Buchanan, Jack Elam and George Tobias.\n\n    CAST:-\n    Tyrone Power as Tom Owens\n    Susan Hayward as Vinnie Holt\n    Edgar Buchanan as Sam Todd\n    Hugh Marlowe as Rafe Zimmerman\n    Jack Elam as Tevis\n    George Tobias as Gratz\n    Dean Jagger as Yancy\n    Jeff Corey as Luke Davis\n    Judy &amp; Jody Dunn as Callie\n\nDirected by Henry Hathaway\nProduced by Samuel G. Engel\nWritten by Dudley Nichols\nMusic by Sol Kaplan, Lionel Newman\nRunning time 89 min.\n\nMOVIE PLOT:- Rawhide (1951)\nTom Owens (Tyrone Power) is the clean-cut and sophisticated gentlemen son of the Eastern Division Manager of the Overland Mail Company, J. C. Owens. His father decides he needs to learn the business from the ground up so sends Tom out west to a remote relay station, Rawhide Pass, to take lessons from the stationmaster, Sam Todd (Edgar Buchanan), whom he has known for over forty years. Owens has received his &quot;pardon&quot; from his father, however, and is scheduled to return to civilization in one week. He can't wait.\n\nA take-charge and strong-willed woman named Vinnie Holt (Susan Hayward) and her very young niece Callie arrive on a coach on their way east. Miss Holt's sister was killed in a bar brawl along with Callie's father, Johnny, back in Vacaville, California, and she is taking Callie to her paternal grandparents in the east. Miss Holt is anxious to start a new job but as her stage gets ready to depart Rawhide after their dinner break and mule change the Calvary arrives from the east with the news that four convicts escaped from Huntsville prison, held up a stagecoach that had passed through Rawhide earlier and killed the driver who was a friend of Sam's. The Calvary has learned that the convicts are after a gold shipment expected to pass through Rawhide the following day. The Calvary intends to escort Miss Holt's coach on its way east. However, per Company policy children may not ride a coach into a dangerous situation and when Miss Holt refuses the driver's command to leave Callie at the station (in her words &quot;jibber-jabber&quot;) she is forcibly removed from the coach by Tom Owens (Power).\n\nHolt (Hayward) takes Callie along with Owens' gun to the nearby hot springs for a bath. While they are gone a man approaches the outpost on horseback. Todd and Owens are leery knowing it could be one of the escaped convicts. Only Owens approaches while Todd hides in the stable tack room with his shotgun. The man flashes a badge so Owens gives Todd the all clear. However, they soon learn it is Rafe Zimmerman (Hugh Marlowe), the convict who escaped from Huntsville the day before his scheduled hanging for the murder of his girlfriend and her lover. Zimmerman then signals the other three convicts to ride in. They are despicable Tevis (played brilliantly by Jack Elam), simpleton Yancy (Dean Jagger) and Gratz (George Tobias).\n\nHolt (Hayward) and Callie return from bathing in time to see Todd get shot in the back by Tevis (Elam) as Todd makes a break for the shotgun he left in the stable. She is discovered when Callie cries. The convicts all assume Holt is Owens' wife. Zimmerman and Tevis then vie for power throughout the film. Tevis has a one-track mind and wants to have his way with Holt. That is all he can think about. But Zimmerman knows they need an official from the Company there when the last coach passes through that night. They need the driver to assure the Calvary to the east that all is well. Zimmerman believes the best way to keep Owens (Power) in line is to leave his wife and baby alone. Zimmerman constantly battles Tavis' stupidity, while Holt and Owens have their own form of power struggle.\n\nOwens (Power) gets hold of a kitchen knife and he and Holt chip away frantically throughout the night at the clay brick wall in the room where they are being held captive. Before they can make the hole big enough to escape through the knife breaks. Dawn comes and Owens is summoned to get ready for the stagecoach. In a moment of distraction Holt (Hayward) allows Callie to crawl out the small hole. Fearing for Callie's safety Holt begins to scream to be let out of the room. When Tevis opens the door he forces himself on her. Owens hears this and tries to come to her aid but gets knocked out by Zimmerman in the melee. Zimmerman thinks he has gotten control of Tevis but makes the mistake of turning his back on Tevis once too often and Tevis shoots him in the back. (Ironic that Zimmerman earlier told Owens that when he got older and some of the green wore off him he would learn to never trust anyone with anything.) Gratz attempts to kill Tevis but is gunned down by Tevis as well. Yancy runs off to hide.\n\nOwens regains consciousness, gets shot running across the yard but manages to get hold of the gun hidden earlier by Holt and is engaged in a gun battle with Tevis when Callie wanders back into the yard. Tevis threatens to shoot Callie if Owens doesn't throw down his gun and come out in the open. Owens complies and as he walks to his sure death, Holt is able to recover Gratz's rifle and save him by killing Tevis. The gold-filled stagecoach then rides in with Yancy aboard. The driver asks Owens what has been going on there. Owens replies, &quot;Learning the business, Jim. Just learning the business.&quot;\n\nVinnie Holt, a single woman traveling with her toddler niece, becomes stranded at Rawhide, a desert stagecoach stop managed by stationmaster Sam Todd and his assistant Tom Owens. Owens is quickly impressed by Vinnie's independent self-confidence. Jim Zimmerman, a fugitive murderer from Huntsville Prison disguised as a deputy, and three other ruthless escapees take over the station, intent on robbing the next day's gold shipment. After murdering Sam, Zimmerman knows they must keep Tom alive in order to complete their plans. Owens does not correct Zimmmerman's assumption that Vin is his wife, correctly sensing that the misconception might be the key to her survival also.\n\nTECHNICAL SPECIFICATIONS\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 673 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English, Espanol\nRunTime 89 mins\nSubtitles: Eng, Francais, Espanol\nRipped by: Trinidad [DDR]","torrent":{"xt":"urn:btih:300d5e91db04bd58f119a3ed88cb7ec01530950d","amp;dn":"Rawhide+%281951%29+Western+-+Xvid+1cd+-++Subs-Eng-Fr-Sp+-Tyronne+Pow","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"300d5e91db04bd58f119a3ed88cb7ec01530950d","infoHashBuffer":{"type":"Buffer","data":[48,13,94,145,219,4,189,88,241,25,163,237,136,203,126,192,21,48,149,13]},"announce":[],"urlList":[]}}