{"title":"A Beautiful Mind(2001)DVDRip.AC3(ENG)-DROCK","uid":6066568,"size":735647744,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3154d18d9bd2351b9fb7e87109defa87c4d9b537&amp;dn=A+Beautiful+Mind%282001%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1293390029,"description":"The true story of prominent mathematician John Forbes Nash Jr. is the subject of this biographical drama from director Ron Howard. Russell Crowe stars as the brilliant but arrogant and conceited professor Nash. The prof seems guaranteed a rosy future in the early '50s after he marries beautiful student Alicia (Jennifer Connelly) and makes a remarkable advancement in the foundations of &quot;game theory,&quot; which carries him to the brink of international acclaim. Soon after, John is visited by Agent William Parcher (Ed Harris), from the CIA, who wants to recruit him for code-breaking activities. But evidence suggests that Nash's perceptions of reality are cloudy at best; he is struggling to maintain his tenuous hold on sanity, and Alicia suspects a diagnosis of paranoid schizophrenia. Battling decades of illness with the loyal Alicia by his side, Nash is ultimately able to gain some control over his mental state, and eventually goes on to triumphantly win the Nobel Prize. Based loosely on the book of the same name by Sylvia Nasar, A Beautiful Mind (2001) co-stars Paul Bettany, Adam Goldberg, Anthony Rapp, Christopher Plummer, and Judd Hirsch. \n\nRipped with DVD Decrypter and Autogk.","torrent":{"xt":"urn:btih:3154d18d9bd2351b9fb7e87109defa87c4d9b537","amp;dn":"A+Beautiful+Mind%282001%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3154d18d9bd2351b9fb7e87109defa87c4d9b537","infoHashBuffer":{"type":"Buffer","data":[49,84,209,141,155,210,53,27,159,183,232,113,9,222,250,135,196,217,181,55]},"announce":[],"urlList":[]}}