{"title":"7 Days to die a12(.1) user friendly mod","uid":12109448,"size":16260,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:32262f131ffd235de3d9700e2ceaa56f7aa18431&amp;dn=7+Days+to+die+a12%28.1%29+user+friendly+mod&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pavelsvt","files":1,"time":1436534147,"description":"Hi 7Gamers, maybe some of you are bored of new a12 same as me. Never ending rain in the forest, extremely rare ores, etc.\n\nThis little modification is suited to fix this problems.\n\nFeatures:\n\n1) Random ore - a10.4 mining system, simply dig a hole and u will find smthing soon. Ores can be found under every biome, just mine like u did in a10.4\n\n2) Rain in forest - I think everybody has noticed that rain in forests is set to have 100% probability. This is fixed, now u have 90% to good weather and 10% to fog and rain.\n\n3) Dog hordes - hordes containing only Z dogs have been eliminated. You will not meet dog pack in villages or barns, but u can still meet them supporting big zombie hordes, so the danger of this op thing is not eliminated completely.\n\n4) Z hordes - Number of attacking Zs in 7 days hordes (7,14,21,28,35,42,49) have been lowered to cca 80%, which may help you save some ammo, but if you want to raise your level, you can go, and hunt random Zs in the area.\n\n5) Uncraftable items - some parts of some weapons is uncraftable by a12. Im working to fix this problem as well. U may find useful that pistol grip is craftable again using 1 iron ignot and 2 metal strips. Im working on making other items (like some parts of smg etc) craftable, but this will be in my next mod probably 16.07.2015.\n\nInstalation: 1) dwnload zip file 2) unzip the zip file 3) copy and rewrite matching text docs in game folder. \n\nI think its very simple, its working, Im using it with no problems (or with no \nproblesm which Im able to solve) pls seed, its not so big (16kb) and it will not waste ur net connection","torrent":{"xt":"urn:btih:32262f131ffd235de3d9700e2ceaa56f7aa18431","amp;dn":"7+Days+to+die+a12%28.1%29+user+friendly+mod","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32262f131ffd235de3d9700e2ceaa56f7aa18431","infoHashBuffer":{"type":"Buffer","data":[50,38,47,19,31,253,35,93,227,217,112,14,44,234,165,111,122,161,132,49]},"announce":[],"urlList":[]}}