{"title":"The Black Sorrows - Hold On To Me [1988][EAC/FLAC]","uid":10555274,"size":464839123,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:32730133f64c0044d9d8ed593e8896505c65e5e9&amp;dn=The+Black+Sorrows+-+Hold+On+To+Me+%5B1988%5D%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":-1,"time":1405383482,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Epic #45158 \nCountry: AUS\nYear: June 1, 1989\nGenre: rock\nFormat: CD\n\n\n\n[b]\n\n\n1\tThe Chosen Ones\t4:06\n2\tThe Crack-Up\t3:23\n3\tChained To The Wheel\t3:57\n4\tIn The Hands Of The Enemy\t4:33\n5\tRaise That Lantern\t6:27\n6\tHold On To Me\t3:51\n7\tGlorybound\t3:48\n8\tFire Down Below\t4:07\n9\tSleep Through The Hurricane\t4:46\n10\tThe Story Never Changes\t4:36\n11\tOne Driver\t3:17\n12\tWaiting For The Rain\t5:02\n13\tMercenary Heart\t3:09\n14\tKiss The Motherlode\t5:00\n15\tBefore The Shooting Stars\t3:23\n16\tSafe In The Arms Of Love\t3:02\n\n\n\n\nLegend has it that Joe Camilleri was kicked out of one of his earliest bands for sounding too much like Mick Jagger. If that's the case, Camilleri managed to overcome his problem in a unique way by the time of this, Black Sorrows' fifth album: Here, he makes himself sound just like Van Morrison instead. In fact, on tracks like &quot;Glorybound&quot; and &quot;The Chosen Ones,&quot; Camilleri manages to channel the voice and persona of the Belfast bluesman so convincingly, it's hard to believe that Camilleri's performance pseudonym &quot;Joey Vincent&quot; isn't actually a cover for the &quot;Van the Man&quot; himself. Still, as impressive as that achievement may be, Hold On to Me isn't merely some sort of second-rate Van Morrison knock-off or tribute album. Camilleri and company may borrow many of the same ingredients that Morrison uses to make his music -- blues, soul, and R&amp;B, as well as flashes of gospel, country, folk, and even Brill building pop -- but the trick is in mixing those well-worn ingredients together and coming up with something new. That's where Black Sorrows show that they're fit to be mentioned in the same breath with artists like Van Morrison and the Rolling Stones (or more contemporary critical favorites like John Hiatt, Paul Kelly, or Nick Lowe) -- every song on Hold On to Me sounds like it could be a classic (and classy) radio staple, without sounding like a copy of anything else. Not only is Hold On to Me's literate songwriting (by Camilleri and lyricist Nick Smith) superb, but the playing is also uniformly excellent (and, at times, positively inspired), and vocalists Camilleri and Linda and Vika Bull (the latter two making their debut on a Black Sorrows record) are soulful and gritty throughout. In the Sorrows' native Australia, Hold On to Me spawned three hit singles (the title track, &quot;The Crack-Up,&quot; and &quot;Chained to the Wheel&quot;), and came to be regarded as an all-time homegrown masterpiece. But Hold On to Me deserves to be remembered as more than just an Australian classic -- this is a record that deserves to be heard and hailed by music fans the world over.","torrent":{"xt":"urn:btih:32730133f64c0044d9d8ed593e8896505c65e5e9","amp;dn":"The+Black+Sorrows+-+Hold+On+To+Me+%5B1988%5D%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32730133f64c0044d9d8ed593e8896505c65e5e9","infoHashBuffer":{"type":"Buffer","data":[50,115,1,51,246,76,0,68,217,216,237,89,62,136,150,80,92,101,229,233]},"announce":[],"urlList":[]}}