{"title":"Facility Manager's Guide to Security: Protecting Your Assets","uid":4725640,"size":12615005,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:32ccb7661b64f5479a0cdf04f4d0cf0337bb16b7&amp;dn=Facility+Manager%5C%27s+Guide+to+Security%3A+Protecting+Your+Assets&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"x_DontTreadOnMe_x","files":-1,"time":1234731792,"description":"&quot;Covering everything required to build and manage a security system, Facility Manager's Guide to Security discusses the layout of the facility in order to provide security for workers, plants, processes, and products. The book covers distances and separation, fencing, access control, intrusion detection systems, pass key, key control systems, locks, hasps, and gates. It also explores more sophisticated systems such as closed circuit television, microwave transmitters, lasers, lighting, clear zone, and computer systems and control electronic systems. In addition, non-hardware aspects of security are examined, including security clearances and background checks, guards, rounds, shift work, training, and procedure development. Written by a former defense department official with 30 years of experience in the defense sector, this valuable book explains all aspect s of facility security. Facility managers will discover useful strategies for managing security personnel, guards, guard dogs, rounds shift work, training, procedure development, and other non-hardware elements of a security program.\n\n    * Publisher: Fairmont Press\n    * Number Of Pages: 340\n    * Publication Date: 2005-01\n    * ISBN-10 / ASIN: 0881734837\n    * ISBN-13 / EAN: 9780881734836&quot;\n\n~~~\n\nI am always adding new things, so check this account often.\n\nVisit roguesci (dot) org (slash) theforum, and register, for the world's longest running largest explosives and weapons forum on the web!","torrent":{"xt":"urn:btih:32ccb7661b64f5479a0cdf04f4d0cf0337bb16b7","amp;dn":"Facility+Manager%5C%27s+Guide+to+Security%3A+Protecting+Your+Assets","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32ccb7661b64f5479a0cdf04f4d0cf0337bb16b7","infoHashBuffer":{"type":"Buffer","data":[50,204,183,102,27,100,245,71,154,12,223,4,244,208,207,3,55,187,22,183]},"announce":[],"urlList":[]}}