{"title":"Hitler's War   (1940 - 1945)","uid":6914946,"size":1572112781,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:333f3d46e5fbad81fce44388604b251722194d0f&amp;dn=Hitler%5C%27s+War+++%281940+-+1945%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rosie1966","files":7,"time":1324992190,"description":"Rare footage illustrates the chlling account of Hitler's ruthless aspirations and savage victories as his armies blitz their way through northern Europe and fatefully invaded the Soviet Union. We examine the disappointment and defeat that followed the collapse of his Russian Adventure and the Allies' closing in on Berlin.\n\nHitler's fateful decision to invade the Soviet Union proved to be the decisive turning point that led to his defeat in Europe. Though 1941's successful Operation Barbarossa netted huge swaths of Soviet territory, the Nazis' attempt on Moscow was derailed by the harsh Russian winter, while the subsequent Battle of Stalingrad completely destroyed Nazi forces. Both of these disastrous campaigns ultimately led to the weakening of both the German military and Hitler's own psyche, resulting in the Allies' march into Berlin and the FÃƒÂ¼hrer's suicide shortly thereafter. Part of the fascinating WAR ZONE series, this documentary traces the history of Hitler's &quot;Russian Adventure&quot; through voice-over narration, interviews, rare archival footage, 3D graphics, and dramatic re-creations.\n\nThis was posted here 4 years ago as an external torrent, but no longer seems to be seeded. Short sample file is included for evaluation.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:333f3d46e5fbad81fce44388604b251722194d0f","amp;dn":"Hitler%5C%27s+War+++%281940+-+1945%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"333f3d46e5fbad81fce44388604b251722194d0f","infoHashBuffer":{"type":"Buffer","data":[51,63,61,70,229,251,173,129,252,228,67,136,96,75,37,23,34,25,77,15]},"announce":[],"urlList":[]}}