{"title":"New Marvel I Like 6-13-2012","uid":7355011,"size":204187625,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:339060ec227eff87e28ebbeb16fbb77453d94687&amp;dn=New+Marvel+I+Like+6-13-2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dadrkhomr","files":14,"time":1339733272,"description":"These are the Marvel comics I got from the week beginning 6/13/2012.  These are not a complete list of what Marvel put out this week.  There are other torrents for that. There are 12 titles in this week's offering. \n\nAll comics are either in CBR or CBZ format and are labelled individually.  Please do not share my descriptions or torrent ads with anyone without messaging me first.  If this torrent has no seeds please msg me privately.  I will be glad to reup anything that has no seeds.\n\n\n\n\nAmazing Spider-Man #687 (CBR 6/13/2012)\n\nThe End of the Earth devastates in part 6 of this earth blistering epic! Plus: Doctor Octopus has a new Sinister Six-THE AVENGERS! Can Spider-Man sacrifice one life to save the entire planet? \n\nAmazing Spider-Man Movie #2 (CBZ 6/13/2012)\n\nThe Amazing Spider-Man premieres in theaters nationwide July 3, 2012! As Peter Parker swings into action as Spider-Man, he's about to face his first challenge as a super hero! But how did he get there? Go 'between the scenes' with this story-inspired and based upon the new The Amazing Spider-Man movie! Featuring Gwen Stacy, Captain George Stacy, Dr. Curt Connors and the rest of Amazing Spider-Man gang as they come to cinematic life! \n\nAvengers #27 (CBR 6/13/2012)\n\nAVX TIE-IN! With the events of AVX raging around them, an Avenger betrays the team! \n\nAvengers Assemble #4 (CBR 6/13/2012)\n\nThe secret of the Zodiac is revealed! What impact will this revelation have on the Avengers and the world as they know it?! \n\nAvx vs. #3 (of 6) (CBR 6/13/2012)\n\nAll fights, All the time! Black Widow vs. Magik! Colossus vs. Thing! \n\nCaptain America #13 (CBR 6/13/2012)\n\nPart Three of 'Shock to the System' Scourge's secret identity revealed. \n\nCaptain America And Hawkeye #632 (CBR 6/13/2012)\n\nThe Hybrid Queen awakens-in a big way-and only Cap, Hawkeye, and Stegron (?!) stand in her way! And whose side is the mysterious Kashmir Vennema on? (Hint: It's not Cap and Hawkeye's!) \n\nFantastic Four #607 (CBZ 6/13/2012)\n\nThe Fantastic Four travel to Wakanda. The Return of Black Panther to the pages of the F4. What happens when the world completely runs out of Vibranium? \n\nMarvel Zombies Destroy #3 (of 5) (CBR 6/13/2012)\n\nThe Horrifying Truth behind what happened to the Norse Gods and how Asgard became zombie territory! An unlikely ally joins our heroes, the same mysterious force who caused the zombie plague! A daring raid into the very hearty of the zombie Red Skull's territory! \n\nSpider-Men #1 (of 5) (CBR 6/13/2012)\n\nThis June - history will be made for the Marvel Universe.  (This is a bad copy that I was not aware of before I made the torrent.   Only a partial scan. \n\nUltimate Comics X-Men #13 (CBR 6/13/2012)\n\nCLASSIFIED! \n\nX-Men #30 (CBR 6/13/2012)\n\nCLASSIFIED! \n\nX-Men Legacy #268 (CBR 6/13/2012)\n\nAVX TIE-IN! Frenzy's past is revealed as she ties up loose ends while the war between the Avengers and the X-Men rages on. \n\n\n","torrent":{"xt":"urn:btih:339060ec227eff87e28ebbeb16fbb77453d94687","amp;dn":"New+Marvel+I+Like+6-13-2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"339060ec227eff87e28ebbeb16fbb77453d94687","infoHashBuffer":{"type":"Buffer","data":[51,144,96,236,34,126,255,135,226,142,187,235,22,251,183,116,83,217,70,135]},"announce":[],"urlList":[]}}