{"title":"Dr. Lonnie Smith - The Healer","uid":7598727,"size":147081625,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:3398e0b73e33d59f51568ce9da2f1f915310f547&amp;dn=Dr.+Lonnie+Smith+-+The+Healer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"L_Hammond","files":-1,"time":1346759267,"description":"Dr. Lonnie Smith - The Healer - Jazz Organ\n\nThe first release for Pilgrimage Records, The Healer, is an exciting live document of the music that Doc's working trio has been wowing audiences around the world with over the past couple of years.\n\nTrack listing:\n01. Backtrack (13:17)\n02. Mellow Mood (8:22)\n03. Dapper Dan (7:17)\n04. Chelsea Bridge (9:41)\n05. Beehive (10:44)\n06. Pilgrimage (11:51)\n\nPersonnel:\n- Dr. Lonnie Smith - Hammond B-3 organ, vocals, keyboards &amp; electric percussion\n- Jonathan Kreisberg - guitar\n- Jamire Williams - drums\n\nTracks 1, 2 &amp; 6 Recorded June 22, 2011 at the Lamantin Jazz Festival, Hungary, by Laszlo Valik.\nTracks 3, 4 &amp; 5 recorded January 14, 2012 at The Jazz Standard, NYC, by Glen Forrest &amp; Ian Hendrickson-Smith.\n\n----------\nThe great B-3 organ master and conjurer of sound, Doctor Lonnie Smith, has made some great studio recordings, but he'll be the first to tell you that his music needs to be experienced live. The release of his brand new live recording 'The Healer' marks the Doctor's first live recording since his landmark 1970 album 'Live At Club Mozambique'. It showcases the great bandleader reinventing the possibilities of sound along with two young stars - guitarist Jonathan Kreisberg and drummer Jamire Williams. The Healer puts the listener front row center at a wild ride of a show that seamlessly blends jazz, fusion, hip hop, world music, and of course the B-3 funk that Doc helped create. \n\n----------\nMP3 format. 320 kbit/s. All songs are tagged by the book.\n\nIf you encounter errors during the file sharing, please, place this material as close to the root of the hard disk as possible and restart the file sharing (e.g. as close as possible to C: in Windows). This is in order to make the path (drive, directory and filename) as short as possible. Operating systems have limits regarding how long a path including the filename can be, and if this limit is exceeded there will be errors.\n\n----------","torrent":{"xt":"urn:btih:3398e0b73e33d59f51568ce9da2f1f915310f547","amp;dn":"Dr.+Lonnie+Smith+-+The+Healer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3398e0b73e33d59f51568ce9da2f1f915310f547","infoHashBuffer":{"type":"Buffer","data":[51,152,224,183,62,51,213,159,81,86,140,233,218,47,31,145,83,16,245,71]},"announce":[],"urlList":[]}}