{"title":"Nanotalk - Conversations with Scientists and Engineers About Eth","uid":15524485,"size":1625165,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:33ae002bbf9e6cc59459df56dfe04e65dd486aeb&amp;dn=Nanotalk+-+Conversations+with+Scientists+and+Engineers+About+Eth&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1470771147,"description":"Nanotalk - Conversations with Scientists and Engineers About Ethics, Meaning, and Belief in the Development of Nanotechnology - R.W. Berne (LEA, 2006).pdf\r\n\r\nNo one really knows where nanotechnology is leading, what its pursuit will mean, and how it may affect human and other forms of life. Nevertheless, its research and development are moving briskly into that unknown. Nanotalk is a book of conversations and explorations with thirty five such nano-research scientists and engineers who share their ideas, experiences, perceptions, and beliefs about their work, humanity, nature, change, and the future of the world with nanotechnology. Precisely because of the unknowable nature of nanotechnology research and development, conscientious foresight and ethical reflection are warranted every step of the way. Not only do nanotechnology research and development represent enormous financial commitments, but they also require a profound leap of faith regarding its possible outcomes. Using these conversations as the basis of reflection and deliberation, the author explores the possible significance of nanotechnology to humanity and how it might be pursued conscientiously and ethically","torrent":{"xt":"urn:btih:33ae002bbf9e6cc59459df56dfe04e65dd486aeb","amp;dn":"Nanotalk+-+Conversations+with+Scientists+and+Engineers+About+Eth","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33ae002bbf9e6cc59459df56dfe04e65dd486aeb","infoHashBuffer":{"type":"Buffer","data":[51,174,0,43,191,158,108,197,148,89,223,86,223,224,78,101,221,72,106,235]},"announce":[],"urlList":[]}}