{"title":"Game Engine Architecture 2012","uid":7608966,"size":9972038,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3436e6e6cdc1fbc28d3a5706d13de5d73f04772a&amp;dn=Game+Engine+Architecture+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"renatosistema","files":-1,"time":1347013577,"description":"Book Description\n\nA 2009 Game Developer Magazine Front Line Award Finalist, this book covers both the theory and practice of game engine software development, bringing together complete coverage of a wide range of topics. The concepts and techniques described are the actual ones used by real game studios like Electronic Arts and Naughty Dog. The examples are often grounded in specific technologies, but the discussion extends way beyond any particular engine or API. The references and citations make it a great jumping off point for those who wish to dig deeper into any particular aspect of the game development process. Intended as the text for a college level series in game programming, this book can also be used by amateur software engineers, hobbyists, self-taught game programmers, and existing members of the game industry. Junior game engineers can use it to solidify their understanding of game technology and engine architecture. Even senior engineers who specialize in one particular field of game development can benefit from the bigger picture presented in these pages. ","torrent":{"xt":"urn:btih:3436e6e6cdc1fbc28d3a5706d13de5d73f04772a","amp;dn":"Game+Engine+Architecture+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3436e6e6cdc1fbc28d3a5706d13de5d73f04772a","infoHashBuffer":{"type":"Buffer","data":[52,54,230,230,205,193,251,194,141,58,87,6,209,61,229,215,63,4,119,42]},"announce":[],"urlList":[]}}