{"title":"Esoteric Agenga in 5 parts mpeg","uid":4505482,"size":736272431,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:34f5365e367d20017285a686cf5059bc42250371&amp;dn=Esoteric+Agenga+in+5+parts+mpeg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Isness","files":6,"time":1226537603,"description":"I downloaded 'Esoteric Agenda' and split it into 5 parts &amp; converted to MPEG.\n\nAll 5 files fit on one cd-r. Good quality.\n\nvisit the site www.talismanicidols.org \n\nI split it into 5 parts for easy viewing and converted it to mpeg format. \n\nSo now you can share it and pass it on to people without computers or divX DVD players. \n\n \nIt has worked on all new DVD players that were at my disposal and I've given copies to friends, and those who had older (2 years or so) DVD players it has not worked.\n\nvisit the site www.talismanicidols.org \n\nThe questions that have remained timeless and profound throughout history have \nbeen all but left for dead. There have been messages left in scriptures, \narcheological remains, shamanic traditions, philosophy, poetry, art and music. \nAs we move closer to an apex of technological and intellectual information, we \nfind ourselves farther and farther away from feeling any comfort or wholeness \nwithin our hearts and souls. Yet even though the concept of spirituality \nshould have been long gone by now, we are seeing an awakening among people and \na growing desire for truth. For the first time in history we are finding that \nthere are no sole saviors or lone prophets to guide us, but a whole race \nwaking from a sleep that has brought this world to the brink of destruction. \nIn a world where Apocalyptic catastrophes seem inevitable, we must look at the \nsolutions in a whole new manner. As the latest quantum mechanics and \nmetaphysics are just being discovered, we notice that we are not moving \nforward, but returning to a consciousness that the ancient shamans, mystics \nand sages have left for us. It is a new age. An age for responsibility and \nstewardship. And as we begin to look for answers in the world within, the \nworld without will reflect. In this new age, we will discover that we are all \none mind, one organism, and one spirit. We are the savior we have been \nwaiting for. \n\n&quot;You must be the change you want to see in the world.&quot; Gandhi","torrent":{"xt":"urn:btih:34f5365e367d20017285a686cf5059bc42250371","amp;dn":"Esoteric+Agenga+in+5+parts+mpeg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34f5365e367d20017285a686cf5059bc42250371","infoHashBuffer":{"type":"Buffer","data":[52,245,54,94,54,125,32,1,114,133,166,134,207,80,89,188,66,37,3,113]},"announce":[],"urlList":[]}}