{"title":"Muppets The Jim Henson Hour RESTORED Food, Living With Dinosaurs","uid":10399106,"size":4582020119,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:34f9d7e5ccd0cdd7fd9734761844f9e1293a6bc0&amp;dn=Muppets+The+Jim+Henson+Hour+RESTORED+Food%2C+Living+With+Dinosaurs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":145,"time":1403325438,"description":"Jim Henson's Muppets\nThe Jim Henson Hour: Food / The Three Ravens / Living With Dinosaurs\n\nSemi restored from VHS and other sources. With special features!\n\nNBC cancelled The Jim Henson Hour after nine episodes. The episodes &quot;Food&quot; and &quot;Living With Dinosaurs&quot; didn't air in the US at the time. They're the rarest episodes, and the only ones where I don't have a decent-quality VHS copy of either.\n\nI set out to restore these episodes to a high standard, but due to the low quality of the material (and how different each source is) that wasn't possible. I would need other sources to do this properly.\n\nInstead, I've decided to release each episode twice, in very different forms. I have two sources for each episode, both of which have their own problems and pluses and minuses. These sources are too different to fit together properly, so I'm uploading both versions of each episode for you to enjoy.\n\nI have a high quality PAL VHS copy of &quot;Living With Dinosaurs,&quot; but it has Dutch subtitles. I've released that on a different PAL disc, so have a look for that.\n\n&quot;The Jim Henson Hour: Living With Dinosaurs&quot; is presented here from a low quality NTSC copy, which I've cleaned up. It's missing some footage but the Jim Henson Hour intros and credits are intact. I've also used higher quality audio, but you'll probably want to watch the PAL version I've uploaded instead.\n\nI've presented &quot;The Jim Henson Hour: Food&quot; as a similar low quality NTSC VHS, which I've cleaned up.\n\n&quot;Food&quot; is also presented from its broadcast in Canada on the half-hour &quot;Jim Henson Show.&quot; This was clearly a higher quality source at some point, but it seems to have been shrunk down to half its size for the web. You'll probably want to watch this version anyway, as the color and clarity is very good.\n\n&quot;The Storyteller: The Three Ravens&quot; is presented here in full DVD quality as a separate piece.\n\nBetween this and the PAL disc of Living With Dinosaurs, you can enjoy these rare episodes in full. It's certainly the best we can do until some other sources turn up. I wish I had a PAL Living With Dinosaurs without subtitles.\n\nAnyway, here's what you'll get:\n\n------------\n\nThe Jim Henson Hour\nEpisode 112: Food / The Three Ravens\n\nMuppettelevision --\n\nThe house band of Beard, Zoot, Clifford, Animal, and Digit annoy Kermit.\n\nSongs &quot;Taste Of Your Love (Food Chain Song),&quot; &quot;Food Songs Infomercial,&quot; &quot;You And Me.&quot;\n\nSuper Stockboy (Ron James) shows an old lady where eggplants come from. Link Hogthrob hosts a food review show. Hurting Something. Gorilla Television (with Camille Bonora). Swedish Chef versus Jacques Roach.\n\nMuppet performers: Jim Henson, Camille Bonora, Fran Brill, Kevin Clash, Dave Goelz, Rob Mills, Jerry Nelson, Dan Redican, Steve Whitmire\n\nWith Camille Bonora, Ron James, Gord Robertson, Sandra Shamas and Bob Stutt.\n\nThe StoryTeller --\nThe Three Ravens: A princess' dreams of love are threatened by the machinations of an evil witch queen.\n\nWritten by\tAnthony Minghella\nDirector\tPaul Weiland\n\nJohn Hurt, Miranda Richardson, Jonathan Pryce, Joely Richardson.\n\n------------\n\nThe Jim Henson Hour: Living With Dinosaurs (Low quality NTSC VHS version)\n\nLiving With Dinosaurs is a Jim Henson television special that originally aired in the UK on December 30, 1990. &quot;Living with Dinosaurs&quot; was written by Anthony Minghella, and directed by Paul Weiland, both of whom also worked on The StoryTeller. In the special, a socially awkward young English boy named Dom deals with his fears about his unemployed artist father (Lee), his pregnant mother (Vicky), and his asthma, with the help of his favorite doll, a stuffed dinosaur named Dog.\n\nAfter airing in the UK, the special was re-formatted to become an episode of The Jim Henson Hour. However, the series was cancelled before the reformatted version aired in the US.\n\nIn 2000, a pilot script was written for a new series based on Living With Dinosaurs, but it was never produced.\n\nWritten by\tAnthony Minghella\nDirector\tPaul Weiland\n\nCast\nMichael Maloney as Lee\nJuliet Stevenson as Vicky\nGregory Chisholm as Dom\nBrian Henson as Dog the Dinosaur\nPatrick Malahide as Uncle Adrian\nDarren Bastable as Victor\nGwyneth Strong as Teacher\n\n------------\n\nSpecial Features:\n\nAll eight Jim Henson introductions to The Jim Henson Show, the half-hour version of The Jim Henson Hour. (web quality) Jim's intros are different here from the Jim Henson Hour versions.\n\nDinah! (1977) From Dinah Shore's talk show, featuring Jim Henson and Frank Oz (as Kermit and Fozzie) singing with Ethel Merman. Paul Williams also checks in. I've restored a low quality VHS, but there's still a lot of picture interference. There was more of Jim and Frank and Kermit on this episode, but this is the only segment I have.\n\nLiving With Dinosaurs clip (from Youtube)","torrent":{"xt":"urn:btih:34f9d7e5ccd0cdd7fd9734761844f9e1293a6bc0","amp;dn":"Muppets+The+Jim+Henson+Hour+RESTORED+Food%2C+Living+With+Dinosaurs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34f9d7e5ccd0cdd7fd9734761844f9e1293a6bc0","infoHashBuffer":{"type":"Buffer","data":[52,249,215,229,204,208,205,215,253,151,52,118,24,68,249,225,41,58,107,192]},"announce":[],"urlList":[]}}