{"title":"Stardust The Bette Davis Story (VHS) (TV) [2006]","uid":6581641,"size":886053218,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:357a11bd978a6fa42259e3b4a4e7b6623b9e3200&amp;dn=Stardust+The+Bette+Davis+Story+%28VHS%29+%28TV%29+%5B2006%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1312437867,"description":" &lt;a href=&quot;http://bayimg.com/LAjlOaaDG&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/LAjlOaaDG&lt;/a&gt;\n\nStardust: The Bette Davis Story (2006) (TV)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0800219/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0800219/&lt;/a&gt;\n\nNarrated by OscarÃ‚Â®-winning actress Susan Sarandon and written and directed by Emmy Award-winning filmmaker Peter Jones, Stardust takes viewers on a psychological treasure hunt for the soul of a person so buried in contradiction and self-styled legend that fact and fiction became nearly indistinguishable. Jones is the first filmmaker to receive unrestricted access to Davis' vast personal archives that span her entire life. Stardust weaves an unprecedented amount of primary source material throughout the documentary, including scores of never-before-seen photographs and letters culled from more than one hundred of her personal scrapbooks, some with annotations in Davis' own handwriting. Stardust also de-constructs Davis' fascinating yet complex life through newly-discovered oral histories with her most important collaborators as well as original interviews including Jane Fonda, James Woods, Ellen Burstyn and Gena Rowlands, who critique scenes from films including Of Human Bondage; Jezebel; Now, Voyager; and What Ever Happened to Baby Jane? Each actor also reflects upon Davis' titanic off-screen persona. \n\nAdditionally, Davis' son, Michael Merrill, speaks for the first time about his parents' violent marriage and his sister B.D.'s blistering memoir, My Mother's Keeper. And in her first on-camera interview, Marion Sherry, B.D.'s nanny and widow of Davis' third husband, reveals shocking details surrounding the mysterious death of Davis' second husband.\n\nThe film explores Davis' troubled relationships with her emotionally distant father, who abandoned her family when she was 10, and the ambitious stage mother whose drive was crucial to Davis' early success. It also examines Davis' fiery personal and professional relationship with director William Wyler (Jezebel, The Letter, The Little Foxes), who, after completing their third multi-OscarÃ‚Â®-nominated collaboration, vowed never to work with the actress again. Finally, the documentary examines how Bette's ill-fated love life could prompt this feminist icon and four-time divorcee to declare, &quot;Unless the girl adjusts to her husband, there can never be a happy marriage.&quot;\n\nEmmy Awards \n2006  Won Emmy Outstanding Writing for Nonfiction Programming Peter Jones (writer) \n \n2006 Nominated Emmy Outstanding Nonfiction Special Tom Brown (executive producer) George Feltenstein (executive producer) Roger Mayer (executive producer) Brian Tessier (supervising producer) Melissa Roller (supervising producer) Peter Jones (producer) \n \n","torrent":{"xt":"urn:btih:357a11bd978a6fa42259e3b4a4e7b6623b9e3200","amp;dn":"Stardust+The+Bette+Davis+Story+%28VHS%29+%28TV%29+%5B2006%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"357a11bd978a6fa42259e3b4a4e7b6623b9e3200","infoHashBuffer":{"type":"Buffer","data":[53,122,17,189,151,138,111,164,34,89,227,180,164,231,182,98,59,158,50,0]},"announce":[],"urlList":[]}}