{"title":"Padre Nuestro DVDRip Spanish","uid":4629640,"size":735189153,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:36b4a2ca9645c1b22224cc0e84949a2a63452aa0&amp;dn=Padre+Nuestro+DVDRip+Spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mois20","files":4,"time":1231344359,"description":"Pedro es un joven mexicano que entra ilegalmente en Estados Unidos y consigue llegar a Brooklyn para conocer al padre que perdiÃƒÂ³ hace aÃƒÂ±os. Se despierta en un camiÃƒÂ³n completamente solo y sin sus pertenencias. Juan, su compaÃƒÂ±ero de viaje, se lo ha robado todo, documentaciÃƒÂ³n incluida, para hacerse pasar por ÃƒÂ©l.\nChristopher Zalla empezÃƒÂ³ a redactar el guiÃƒÂ³n de PADRE NUESTRO una semana despuÃƒÂ©s del 11-S porque sintiÃƒÂ³ la necesidad de hacer una pelÃƒÂ­cula acerca de su ciudad. Como muchos otros, Zalla se precipitÃƒÂ³ al World Trade Center para ayudar en las tareas de rescate, periodo de tiempo en el que pudo observar quÃƒÂ© es lo que unÃƒÂ­a a las personas. &quot;Intelectualmente, siempre habÃƒÂ­a entendido que Nueva York era una ciudad internacional, pero no lleguÃƒÂ© a comprenderlo emocionalmente hasta aquel dÃƒÂ­a. De pronto, sentÃƒÂ­ lo fundamental que era nuestro deseo de tener una comunidad. Hemos levantado barreras, fronteras entre nosotros, sin embargo es irÃƒÂ³nico pensar que todos buscamos conexiones, lazos familiares&quot;. Nueva York es la ciudad ideal para rodar una pelÃƒÂ­cula acerca de las fronteras: hay fronteras visibles e invisibles. Las separaciones claras entre los barrios ricos y los pobres; entre los otros cuatro distritos y Manhattan; entre los que comen en restaurantes de lujo y los inmigrantes ilegales que sudan en la cocina a unos cuantos metros. Pero basta con subir al metro para que las barreras desaparezcan. El rodaje de la pelÃƒÂ­cula contÃƒÂ³ con un equipo de personas de mÃƒÂ¡s de 20 nacionalidades diferentes, una autÃƒÂ©ntica metÃƒÂ¡fora de la ciudad y de la pelÃƒÂ­cula, &quot;ÃƒÂ©ramos un montÃƒÂ³n de extraÃƒÂ±os juntos, pero conseguimos crear una familia&quot;.","torrent":{"xt":"urn:btih:36b4a2ca9645c1b22224cc0e84949a2a63452aa0","amp;dn":"Padre+Nuestro+DVDRip+Spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36b4a2ca9645c1b22224cc0e84949a2a63452aa0","infoHashBuffer":{"type":"Buffer","data":[54,180,162,202,150,69,193,178,34,36,204,14,132,148,154,42,99,69,42,160]},"announce":[],"urlList":[]}}