{"title":"9 11 Nobody Knows 10th Update: Explosion Sounds, Heat, Flashes a","uid":14129285,"size":3708714299,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:37b0ecc686e7a7aab4237a5fb48c08ded80fbe54&amp;dn=9+11+Nobody+Knows+10th+Update%3A+Explosion+Sounds%2C+Heat%2C+Flashes+a&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Truthout","files":1,"time":1459537932,"description":"Relates more to military explosive demolition than to building implosions, which specifically involve the placement of charges at key points within a structure to precipitate the failure of steel or concrete supports within their own footprint. The other primary difference between these two types of operations is that implosions are universally conducted with the utmost concern for adjacent properties and human safety---elements that were horrifically absent from this event.\r\n\r\n&quot;Oh yeah,'' he said. &quot;There was a big conspiracy. They've never apprehended the people who were responsible.''\r\nShe grew frustrated with the long, slow rebuilding process at Ground Zero, as Larry Silverstein, the developer of the property, and the Port Authority of New York and New Jersey, which owns it, haggle over who will finance which building.\r\n\r\nTritium at Ground Zero too High \r\n\r\nA Nuke Maybe  \nhttp://i1222.photobucket.com/albums/d...\r\n\r\n\r\nAn unknown  process was started Ground Zero.. That process was hot enough to create giant meteorites which Nobody Knows were exactly were they came from. Hence &quot;Nobody Knows but Jesus&quot; play the video\r\n\r\nBrent Blanchard Implosion World 9/11, Charles Gargano The Port Authority Police Department  ,  Gerry Fornino FBI,  Scott Schrimpe, FDNY,  9/11 Nobody Knows 35 Minutes March 6th, 2002 hearing before the House Science Committee on the World Trade Center, Charles Gargano, Amy Goodman, Joseph Crowley, Hassan Astaneh. Abolhassan ASTANEH-ASL, astaneh 9/11 Mark Haines CNBC,  House Science Committee, Drone Photos, Hijack Code 7500,  squawking a hijack code, 904-555-0004, jimmy grillo, fdny\r\nJames Grillo FDNY, WTC 7 witnesses \r\n\r\n[Peace Studies, 9/11, cognitive dissonance, Twin Towers, WTC 1, WTC 2, controlled demolition, War on Terror, eyewitness evidence, FBI, NYFD, firefighters, first responders, Christopher Fenyo, N J Burkett, Jack Kelley, Dennis Tardio, Pat Zoda, Paul Lemos, Sue Keane, Naudet Brothers, Harley Man, David Chandler, squibs, pancake hypothesis, NIST, Shyam Sunder, 9/11 Commission]","torrent":{"xt":"urn:btih:37b0ecc686e7a7aab4237a5fb48c08ded80fbe54","amp;dn":"9+11+Nobody+Knows+10th+Update%3A+Explosion+Sounds%2C+Heat%2C+Flashes+a","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37b0ecc686e7a7aab4237a5fb48c08ded80fbe54","infoHashBuffer":{"type":"Buffer","data":[55,176,236,198,134,231,167,170,180,35,122,95,180,140,8,222,216,15,190,84]},"announce":[],"urlList":[]}}