{"title":"Submarine Command","uid":10400133,"size":1078371744,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:393448dc11114488004402bbe9464e233e19bf32&amp;dn=Submarine+Command&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"strawberry5","files":-1,"time":1403349157,"description":"Editor Note:\nIMHO, this is the 1st movie to touch on Post Traumatic Stress Disorder (PTSD) ..\n\nIMDB:\nWilliam Holden is Cmdr. White a quite mature man who suffers through the boredom of the post WW II Navy. He is chained to a desk on a base near his old submarine, which has been decommissioned and mothballed. He visits it periodically to experience his wartime ghosts. He is so bored that he seriously considers chucking the Navy and taking a more lucrative civilian job. Nancy Olson plays his understanding Navy wife. William Bendex is also on hand with old time Chief Petty Officer wisdom and to remind Holden of his ghosts.\n\nDon Taylor portrays the fun and games Navy pilot who is anything but mature. He is teaching ROTC at a nearby college. They met at the end of the war when White's submarine rescued him. They maintain a friendship even though White is at times disturbed by his happy-go-lucky well adjustment.\n\nWhen The Korean War starts White is rescued from his desk and placed in command of ----- (You guessed it!) his old submarine. Taylor and Holden are united again off the Korean Coast where boat and men undertake a movie ending dangerous mission.\n\nThis was a feel good war movie that wasn't loaded with dated propaganda. Holden narrates as he did in Sunset Blvd. where he first played opposite Olson.\n\nIf you like military movies, this is a good one.\n\np.s. It is an old movie, but unique on the www. ","torrent":{"xt":"urn:btih:393448dc11114488004402bbe9464e233e19bf32","amp;dn":"Submarine+Command","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"393448dc11114488004402bbe9464e233e19bf32","infoHashBuffer":{"type":"Buffer","data":[57,52,72,220,17,17,68,136,0,68,2,187,233,70,78,35,62,25,191,50]},"announce":[],"urlList":[]}}