{"title":"Crime Patrol 2 Drug Wars American Lasergames 2003 Version","uid":5916298,"size":654219696,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:39421e68e3e6420e4257225eb50b41d488def51f&amp;dn=Crime+Patrol+2+Drug+Wars+American+Lasergames+2003+Version&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FlashyVox","files":-1,"time":1288245282,"description":"Crime Patrol 2: Drug Wars is a live-action laserdisc video game, first released by American Laser Games in 1994. As the title implies, it is the sequel to the relatively popular arcade game Crime Patrol, with very similar gameplay, objectives and scenery.\n\nThe player steps into the shoes of an anonymous Drug Enforcement Administration member whose goal is to track down and detain or eliminate a dangerous drug baron residing in South America, thus destroying his illegal cartel. Along the way, the agent will have to render any opposition harmless by any means necessary, as is the case in most other American Laser Games releases.\n\nAs in Crime Patrol, the player battles criminals and other villains in several widely varying environments. In the original game, however, the main character advances from the &quot;Rookie&quot; level to the &quot;Delta Force&quot; level, while in Drug Wars, he does not get promoted at any point, simply moving on from one location to another with few complex aims. Beginning in Sierra County, New Mexico, the agent continues to fight crime in Chicago, the United States-Mexico border and, finally, the baron's residence in South America. In each of these locations, the player can choose from three different assignments; when all three are complete, he moves on to the next location. The game is finished successfully by reaching and neutralizing the drug lord.\n\nRun and play!\n\nAnd please pass it on Thank you!","torrent":{"xt":"urn:btih:39421e68e3e6420e4257225eb50b41d488def51f","amp;dn":"Crime+Patrol+2+Drug+Wars+American+Lasergames+2003+Version","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39421e68e3e6420e4257225eb50b41d488def51f","infoHashBuffer":{"type":"Buffer","data":[57,66,30,104,227,230,66,14,66,87,34,94,181,11,65,212,136,222,245,31]},"announce":[],"urlList":[]}}