{"title":"MegaSeg Pro 5.8.3","uid":7430282,"size":15057226,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:3981403b2537a6a4d8fb0dd0edef7c701b61077f&amp;dn=MegaSeg+Pro+5.8.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"openarena","files":-1,"time":1341880881,"description":"S version: Mac OS X 10.4 or later\n\nLink for more information:\nCode: &lt;a href=&quot;\nhttp://www.megaseg.com/about.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.megaseg.com/about.html&lt;/a&gt;\n\nMegaSeg is a totally self-contained DJ music mixing and radio automation system which benefits from the ease, mobility, and reliability of Mac computers.\n\nMegaSeg enables DJs and radio stations to put their massive music libraries on their Mac and seamlessly segue or beat mix between songs or music videos, trigger sound effects via hot keys, note requests via color coded request lists, cue tracks via a second sound output, create dynamic scheduled playlists, and program timed playlist events.\n\nMobile DJ businesses can use MegaSeg to easily add another system to their growing business, and is a professional solution for DJ's who need more mixing control than Apple's iTunes offers. MegaSeg has full integration with the iTunes library and playlists, including compatibly with songs bought from the iTunes Music Store.\n\n\nWhat's New\nVersion 5.8.3:\n\nNew MIDI jog wheel &quot;pressure&quot; or touch mode for responsive scrub or scratching effects\nWave Viewer two-finger trackpad scrolling to scrub or scratch tracks is more responsive\nAdded an option to turn MIDI off\nClearing the Match BPM search results returns to the last library sort order\nFolder view type-to-select matches any substring for easier selection\nFull screen mode is properly restored on relaunch\nRemapped MC6000 MIDI preset's Crossfader to audio mode and Advance to the EFX button\nRevised DJ2GO and Mixtrack MIDI presets to support button lights\nScrolling the library or playlist track selection works better for MIDI controllers\nSearch Notes returns correct results when library is not sorted by title\nSelecting a new data folder refreshes the category and playlist browser\nThe right jog wheel on the DAC-3 controller works again\nToggling views no longer cause floating windows to disappear\nType-to-select in iTunes Playlist Browser now works\nType-to-select works in the list of MIDI control functions\nVarious other optimizations and fixes","torrent":{"xt":"urn:btih:3981403b2537a6a4d8fb0dd0edef7c701b61077f","amp;dn":"MegaSeg+Pro+5.8.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3981403b2537a6a4d8fb0dd0edef7c701b61077f","infoHashBuffer":{"type":"Buffer","data":[57,129,64,59,37,55,166,164,216,251,13,208,237,239,124,112,27,97,7,127]},"announce":[],"urlList":[]}}