{"title":"NEOScavenger 0.9931b","uid":10744203,"size":50659153,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:39f38f547cd507fa5e37321e780ade0a370d0d64&amp;dn=NEOScavenger+0.9931b&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AppRipper","files":-1,"time":1407798526,"description":"NEO Scavenger\n(c) Blue Bottle Games\n\nRelease date: 8/05/2014 \nProtection: DRM-Free\nLanguage: English\nVersion: 0.9931b\n\n\nNEO Scavenger is a turn-based, rogue-like RPG where you must\nsurvive in the wasteland long enough to figure out who you are\nEach turn you must decide where to go, how to scavenge for\nsupplies, and how to deal with anything and anyone you encounter\nAnd with each passing minute, the pit in your stomach grows, your\ndehydration worsens, your muscles tire, and your body temperature\ndrops in the cold autumn air. Choose your starting abilities\ncarefully, because they and your wit are the only tools you have in\nthe apocalypse!\n           &lt;a href=&quot;\nhttp://bluebottlegames.com/main/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bluebottlegames.com/main/&lt;/a&gt;\n\nInstructions:\n1) Unzip\n2) Enjoy!\n\nIt's DRM-Free as far as I know, however I would block it on your firewall anyway.\n\nHope you all enjoy this game! Buy it and support the developer! He really deserves it!\n\n-AppRipper &quot;Happy Hacking!&quot;\n\n*** CHANGELOG ****\n\nAdded new item property 88 to ignore subgroups when stacking items. (e.g. like recipes and headlines)\nAdded code to make chance of disease transfer in battle depend on ratio of current range to transfer range.\nChanged creature spawning rates to be weighted by new &quot;fWeight&quot; field in game data.\nChanged creature spawning rates to reduce skewing towards creatures with variants (e.g. Blue Frogs).\nFixed Blue Rot, Smallpox, Pneumonia, and Hepatitis from stacking multiple stages on same creature.\nFixed a bug that caused override data to be ignored when applied to template-based items (e.g. camps, data).\nFixed a bug that caused craft confirm button tooltip on non-crafting pages sometimes.\nFixed a bug that caused crafted output items to be missing software sometimes.\nFixed a bug that caused &quot;SetImmunity&quot; to ignore ID namespaces in mods.\nFixed a bug that caused return to Zom Zom's to delete confiscated items.\nFixed a bug that caused confiscate to throw null pointer error if used a second time during a play session. (e.g. Zom Zom's stuck bug)\nFixed typo in Zom Zom's.\nFixed a bug that caused gas mask cartridges to not fit on ground.","torrent":{"xt":"urn:btih:39f38f547cd507fa5e37321e780ade0a370d0d64","amp;dn":"NEOScavenger+0.9931b","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39f38f547cd507fa5e37321e780ade0a370d0d64","infoHashBuffer":{"type":"Buffer","data":[57,243,143,84,124,213,7,250,94,55,50,30,120,10,222,10,55,13,13,100]},"announce":[],"urlList":[]}}