{"title":"Terry Reid - Original Album Series [5 CD's][2014][320 KBPS]","uid":12136324,"size":700047524,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3a3a9774da4df248bca2a38a880e62abe7afc75e&amp;dn=Terry+Reid+-+Original+Album+Series+%5B5+CD%27s%5D%5B2014%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LameDuck69","files":75,"time":1437188346,"description":"-----------------------------------------------------------\nTerry Reid - Original Album Series [5 CD's][2014][320 KBPS]\n-----------------------------------------------------------\n\n----------------------------------------\nCD1 - Bang Bang You're Terry Reid [1968]\n----------------------------------------\n\n01. Bang Bang (My Baby Shot Me Down)\n02. Tinker Taylor\n03. Erica\n04. Without Expression\n05. Sweater\n06. Something's Gotten Hold Of My Heart \n07. Season Of The Witch\n08. Writing On The Wall/Summertime Blues\n09. When I Get Home\n10. Loving Time\n\n-----------------------\nCD2 - Terry Reid [1969]\n-----------------------\n\n01. Superlungs My Supergirl\n02. Silver White Light\n03. July\n04. Marking Time\n05. Stay With Me Baby\n06. Highway 61 Revisited/Friends\n07. May Fly\n08. Speak Now Or Forever Hold Your Peace\n09. Rich Kid Blues\n\n------------------\nCD3 - River [1973]\n------------------\n\n01. Dean\n02. Avenue\n03. Things To Try\n04. Live Life\n05. River \n06. Dream\n07. Milestones\n\n------------------------\nCD4 - Rogue Waves [1978]\n------------------------\n\n01. Ain't No Shadow\n02. Baby I Love You\n03. Stop And Think It Over\n04. Rogue Wave\n05. Walk Away Rene\n06. Believe In Magic \n07. Then I Kissed Her\n08. Bowangi\n09. All I Have To Is Dream\n\n-----------------------\nCD5 - The Driver [1991]\n-----------------------\n\n01. Fifth Of July\n02. There's Nothing Wrong\n03. Right To The End\n04. The Whole Of The Moon\n05. Hand Of Dimes\n06. The Driver (Part 1) \n07. If You Let Her\n08. Turn Around\n09. Gimme Some Lovin'\n10. Laugh At Life\n11. The Driver (Part 2)\n---------------------------\n**320 KBPS CBR\n**Cover Art\n---------------------------\nTerry Reid (born 13 November 1949, Huntingdon, England) is an English rock vocalist and guitarist. He has performed with high profile musicians, as a supporting act, a session musician, and sideman.\n\nTerry Reid lived in Bluntisham &amp; attended St.Ivo School, St.Ives, Cambridgeshire. After leaving school at the age of 16, Reid joined Peter Jay's Jaywalkers after being spotted by the band's drummer, Peter Jay. At the time, Reid was playing for a local band, The Redbeats. Regularly played at the River Club in St Ives. His public profile was enhanced in 1966 when The Jaywalkers were named as a support act for The Rolling Stones for their concert at the Royal Albert Hall. Graham Nash of The Hollies became friends with Reid at that concert, and suggested The Jaywalkers sign up with UK Columbia Records - an EMI label - to record with producer John Burgess. Their first single, the Soul-inspired &quot;The Hand Don't Fit the Glove&quot; was a minor hit in 1967, but by then The Jaywalkers had decided to disband.\n\nReid came to the attention of hits producer Mickie Most, who became his manager. His first single with Most, &quot;Better By Far,&quot; became a radio favourite, but the album, Bang Bang, You're Terry Reid, was not a commercial success. With accompanying musicians Peter Solley on organ and Keith Webb on drums, a 1968 tour of the United States with Cream did much to gain Reid a loyal following. His final performance of the tour at the Miami Pop Festival garnered positive reviews from the music press.\n\nThe song &quot;Without Expression&quot; by Reid and Graham Nash, from Bang Bang, You're Terry Reid, was recorded by The Hollies in 1968 as &quot;A Man With No Expression&quot; and by Crosby, Stills, Nash and Young in 1969 as &quot;Horses Through a Rainstorm&quot;, with Nash singing lead on both. Both versions were not released until years later.\n\nYardbirds guitarist Jimmy Page became interested in Reid's work, and when The Yardbirds disbanded, Page wanted Reid to fill the vocalist spot for his proposed new group, the New Yardbirds, which was to become Led Zeppelin. Reid had already committed to go on the road with Cream (as an opening act on the 1968 US Tour). So he suggested to Page that he consider a young Birmingham based singer, Robert Plant, instead, having previously seen Plant's Band of Joy as a support act at one of his concerts. An alternative reason for Reid's refusal to join the nascent Led Zeppelin surfaced in a mid 80's article in NME on supposed satanic connections within the rock world. The article claimed that it was Page's &quot;heavy reputation as a Crowleyan black magician&quot;, which frightened Reid away from commitment to the band. Reid later was offered a position as a member of Deep Purple when they decided to replace singer Rod Evans, but once again, he declined due to contractual agreements. Ian Gillan was given the position instead.\n\nIn 1969, Reid supported British tours, notably Jethro Tull and Fleetwood Mac. Reid, Solley and Webb toured the United States again when he opened for The Rolling Stones on their 1969 American Tour. He did not appear at the infamous Rolling Stones concert at Altamont Music Festival","torrent":{"xt":"urn:btih:3a3a9774da4df248bca2a38a880e62abe7afc75e","amp;dn":"Terry+Reid+-+Original+Album+Series+%5B5+CD%27s%5D%5B2014%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a3a9774da4df248bca2a38a880e62abe7afc75e","infoHashBuffer":{"type":"Buffer","data":[58,58,151,116,218,77,242,72,188,162,163,138,136,14,98,171,231,175,199,94]},"announce":[],"urlList":[]}}