{"title":"HISTORY OF POP AND ROCK MUSIC - part 513","uid":8874888,"size":736627399,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3bd2937bdd68dd303dce17398b313a01ddcf40aa&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+513&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1378168115,"description":"       \n\n                         PART  513               \n\n\n\n\n         BUSTA RHYMES  -  Put Your Hands Where My Eyes Could See  (1997)        \n         LL COOL J  -  Phenomenon  (1997)\n         WILL SMITH  -  Gettin' Jiggy wit It  (1998)\n\n\n\n\n         &quot;Put Your Hands Where My Eyes Could See&quot; is a 1997 song by American rapper Busta Rhymes from his second studio album When Disaster Strikes (1997). Released as the lead single, the song includes samples from &quot;Sweet Green Fields&quot; by Seals and Crofts. It was nominated for the Grammy Award for Best Rap Solo Performance at the 40th Grammy Awards, but lost to &quot;Men in Black&quot; by Will Smith. The song became successful, it peaked at number 37 on the US Billboard Hot 100 Airplay chart, as well as reaching number two on the Hot R&amp;B/Hip-Hop Songs chart, whilst reaching number sixteen on the UK Singles Chart. The song is best remembered by its music video, directed by Hype Williams, which features Busta waking up, getting dressed and brushing his teeth (along with his maids). The video is based on John Landis's 1988 film Coming to America. At the chorus is a well choreographed dance routine which is followed by Busta running with an elephant in glowing tribal African make-up and outfit. The video received heavy rotation on both the MTV and BET networks. The video was filmed at Chambers and Centre Street in Downtown Manhattan.\n\n        &quot;Phenomenon&quot; was the first single by LL Cool J from his seventh album Phenomenon. It was released on September 23, 1997. It samples the song &quot;Who Is He And What Is He To You&quot; by Creative Source. On the B-Side was Hot Hot Hot. It interpolates bits of Liquid Liquid's song &quot;Cavern&quot;. The lyrics &quot;Something Like a Phenomenon&quot; and the beat are taken from the song White Lines by Grandmaster Melle Mel.\n\n      &quot;Gettin' Jiggy wit It&quot; is a single by American rapper Will Smith, released as the third cut from his debut solo album Big Willie Style. Released in January 1998, the song was Smith's second hit produced by Poke &amp; Tone, who replaced his long-time partner Jazzy Jeff, though the record-scratching techniques of Jazzy Jeff can be heard in the song. The record spent three weeks at the top of the Billboard Hot 100 chart from March 14, 1998. The song also won a Grammy Award in 1999 for the Best Rap Solo Performance. It was ranked the 68th greatest song of the 1990s by VH1. &quot;Gettin' Jiggy wit It&quot; Hit Number 1 on March 11, 1998. However, it was ranked at #19 on the list of AOL Radio's 100 Worst Songs Ever in 2010.","torrent":{"xt":"urn:btih:3bd2937bdd68dd303dce17398b313a01ddcf40aa","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+513","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bd2937bdd68dd303dce17398b313a01ddcf40aa","infoHashBuffer":{"type":"Buffer","data":[59,210,147,123,221,104,221,48,61,206,23,57,139,49,58,1,221,207,64,170]},"announce":[],"urlList":[]}}