{"title":"Cracking the Particle Code of the... (2014) John W Moffat (multi","uid":9506187,"size":17474477,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c58399c10a4ce58478d17bf8525642019c680c1&amp;dn=Cracking+the+Particle+Code+of+the...+%282014%29+John+W+Moffat+%28multi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7","files":-1,"time":1390320863,"description":"Cracking the Particle Code of the Universe: The Hunt for the Higgs Boson (2014) John W Moffat (multi)\n\n\nCracking the Particle Code of the Universe: The Hunt for the Higgs Boson by John W Moffat\n\n\nFormat: mobi/epub/azw3\nLength: 252 pages\nGenre: Non-Fiction/Science\nDate: 1 January 2014\n\nAmong the current books that celebrate the discovery of the Higgs boson, Cracking the Particle Code of the Universe is a rare objective treatment of the subject. The book is an insider's behind-the-scenes look at the arcane, fascinating world of theoretical and experimental particle physics.\n\nLeading up to the recent discovery of a new boson. If the new boson is indeed the Higgs particle, its discovery represents an important milestone in the history of particle physics. However, despite the pressure to award Nobel Prizes to physicists associated with the Higgs boson, John Moffat argues that there still remain important data analyses to be performed before uncorking the champagne.\n\nProfessor Moffat takes a critical look at the hype surrounding the Higgs boson. In the process, he presents a cogent and often entertaining history of particle physics and an exploration of alternative theories of particle physics that do not feature the Higgs boson, including his own. He gives a detailed and personal description of how theoretical physicists come up with new theories, and emphasizes how carefully experimental physicists must interpret the complex data now coming out of accelerators like the Large Hadron Collider (LHC).\n\nAuthor:\n\nJohn W. Moffat has been a professor of physics for more than three decades. He is currently Professor Emeritus at the University of Toronto, a member of the Perimeter Institute for Theoretical Physics in Waterloo, Ontario, Canada, and adjunct professor in the physics department at the University of Waterloo. Moffat is well known for his alternative theory of gravity to Einstein's general relativity. He is the author of Reinventing Gravity: A Physicist Goes Beyond Einstein and Einstein Wrote Back: My Life in Physics.","torrent":{"xt":"urn:btih:3c58399c10a4ce58478d17bf8525642019c680c1","amp;dn":"Cracking+the+Particle+Code+of+the...+%282014%29+John+W+Moffat+%28multi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c58399c10a4ce58478d17bf8525642019c680c1","infoHashBuffer":{"type":"Buffer","data":[60,88,57,156,16,164,206,88,71,141,23,191,133,37,100,32,25,198,128,193]},"announce":[],"urlList":[]}}