{"title":"Urgent breaking news: ACTA is EViL","uid":4204422,"size":180648,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c87f426ad690c7e6a9f5d5dd9b92fe7bd5af5fe&amp;dn=Urgent+breaking+news%3A+ACTA+is+EViL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"btalex1990","files":1,"time":1211713993,"description":"This is the EViL Trade Agreement that will criminalize cracking of copy protections on legally purchased products giving you less innovation and more bureaucratic control.\n\nSource: http://wikileaks.org/wiki/Proposed_US_ACTA_multi-lateral_intellectual_property_trade_agreement_%282007%29\n\n\n\nSummary\n\nIn 2007 a select handful of the wealthiest countries began a treaty-making process to create a new global standard for intellectual property rights enforcement, which was called, in a piece of brilliant marketing, the &quot;Anti-Counterfeiting Trade Agreement&quot; (the agreement does not cover currency fraud).\n\nACTA is spearheaded by the United States along with the European Commission, Japan, and Switzerland ? which have large intellectual property industries. Other countries invited to participate in ACTA?s negotiation process are Canada, Australia, Korea, Mexico and New Zealand. Noticeably absent from ACTA?s negotiations are leaders from developing countries who hold national policy priorities that differ from the international intellectual property industry.\n\nA ?Discussion Paper on a Possible Anti-Counterfeiting Trade Agreement? was reportedly provided to select lobbyists in the intellectual property industry, but not to public interest organizations concerned with the subject matter of the proposed treaty.[1]\n\nWikileaks has obtained the document.\n\nThe agreement covers the copying of information or ideas in a wide variety of contexts. For example page three, paragraph one is a &quot;Pirate Bay killer&quot; clause designed to criminalize the non-profit facilitation of unauthorized information exchange on the internet. This clause would also negatively affect transparency and primary source journalism sites such as Wikileaks.\n\nThe document reveals a proposal for a multi-lateral trade agreement of strict enforcement of intellectual property rights related to Internet activity and trade in information-based goods hiding behind the issue of false trademarks. If adopted, a treaty of this form would impose a strong, top-down enforcement regime, with new cooperation requirements upon internet service providers, including perfunctionary disclosure of customer information. The proposal also bans &quot;anti-circumvention&quot; measures which may affect online anonymity systems and would likely outlaw multi-region CD/DVD players.\n\nThe proposal also specifies a plan to encourage developing nations to accept the legal regime.\n\nTrade representatives were hoping to formalize the agreement at the G-8 summit in July 2008.\n\nThe following summary of the trade agreement issue is from IP Justice, an international group based in San Francisco that campaigns for a just world intellectual property regime:\n\n    After the multi-lateral treaty?s scope and priorities are negotiated by the few countries invited to participate in the early discussions, ACTA?s text will be ?locked? and other countries who are later ?invited? to sign-on to the pact will not be able to re-negotiate its terms. It is claimed that signing-on to the trade agreement will be &quot;voluntary&quot;, but few countries will have the muscle to refuse an ?invitation? to join, once the rules have been set by the select few conducting the negotiations. \n\n    The US is negotiating ACTA through the Office of the US Trade Representative (USTR), an office within the Bush Administration that has concluded more than 10 ?free trade? agreements in recent years, all of which require both the US and the other country to increase intellectual property rights enforcement measures beyond the international legal norms in the WTO-TRIPS Agreement. [2] \n\nTalking points from the European Commission, the Office of the United States Trade Representative, the Australian Department of Foreign Affairs and Trade, and others have published selected passages ostensibly from the document in response; refer to [3] for useful links.\n\nThe ACTA push was launched on October 23, 2007 by US Ambassador Susan C. Schwab and five U.S. members of Congress from the &quot;Congressional Caucus on Intellectual Property and Piracy Prevention&quot;. A copy of her opening remarks follow:\n\n        Remarks by U.S. Trade Representative Susan C. Schwab\n              Anti-Counterfeiting Trade Agreement (ACTA)\n                               October 23, 2007\n? Thank you all for being here. Today we are announcing a major new\n  initiative in the international fight against IPR counterfeiting and piracy.\n? I want to begin by thanking our host today, the Congressional Caucus on\n  Intellectual Property and Piracy Prevention, and its co-chairs -\n  Representatives Bono, Feeney, Wexler, and Adam Smith of Washington.\n? Thank you also to the Members present, who have done so much to advance\n  the cause of IP protection, including:\n      - Rep. Mary Bono (R-CA)\n      - Rep. Bob Goodlatte (R-VA)\n      - Rep. Howard Berman (D-CA)\n      - Rep. Adam Schiff (D-CA)\n      - Rep. Marsha Blackburn (R-TN)\n? I also want to acknowledge and thank the Ambassadors and representatives\n  of our trading partners who have joined us today.\n[...]\n? We are pleased to be working in this broader effort with a number of key\n  trading partners, large and small, including Canada, the European Union,\n  Japan, Korea, Mexico, New Zealand, and Switzerland. We hope and believe\n  that others will join over time, marking an emerging consensus on stronger\n  IP enforcement. All who share our ambition and commitment to stronger\n  IPR enforcement are welcome.\n[...]\n? With that goal in mind, the U.S. Government is eager to move ahead as fast\n  as possible with the negotiation of this important new agreement.\n? Thank you.\n\nWho is really behind ACTA? Follow the money:\n\nRep. Howard Berman (D-CA)[4]\n\n    Top four campaign contributions for 2006: \n\n        Time Warner $21,000 \n        News Corp $15,000 \n        Sony Corp of America $14,000 \n        Walt Disney Co $13,550 \n\n    Top two Industries:\n\n        TV/Movies/Music $181,050 \n        Lawyers/Law Firms $114,200 \n\nOther politicians listed also show significant contributions from IP industries.\n\nContext\n    United States \n    Government (bureaucracy) \n    Office of the United States Trade Representative \n\nWikileaks release date\nThursday May 22, 2008\nPrimary language\nEnglish\nFile size in bytes\n378251\n\n\nDescription (as provided by the original submitter)\n\n1. Not to our knowledge.\n\n2. This document details provisions of a proposed plurilateral trade agreement that would impose strict enforcement of intellectual property rights related to Internet activity and trade in information-based goods. If adopted, a treaty of this form would impose a strong, top-down enforcement regime imposing new cooperation requirements upon ISPs, including perfunctory disclosure of customer information, as well as measures restricting the use of online privacy tools. The proposal also specifies a plan to encourage developing nations to accept the legal regime. Talking points from the European Commission, the Office of the United States Trade Representative, the Australian Department of Foreign Affairs and Trade, and others have published selected passages ostensibly from this document; refer to http://ipjustice.org/wp/campaigns/acta/ for useful links.\n\n3. Trade officials, copyright claimants.\n\n4. Call Office of the United States Trade Representative, European Commission, Australian Department of Foreign Affairs and Trade, and other trade officials including the corresponding offices in Canada, Japan, and Switzerland.\n\n5. Not clear; suspect that one of the parties to the agreement may have had an interest in releasing details to the public.\n6. Trade representatives intend to formalize the agreement at the G-8 summit in July 2008.","torrent":{"xt":"urn:btih:3c87f426ad690c7e6a9f5d5dd9b92fe7bd5af5fe","amp;dn":"Urgent+breaking+news%3A+ACTA+is+EViL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c87f426ad690c7e6a9f5d5dd9b92fe7bd5af5fe","infoHashBuffer":{"type":"Buffer","data":[60,135,244,38,173,105,12,126,106,159,93,93,217,185,47,231,189,90,245,254]},"announce":[],"urlList":[]}}