{"title":"Tales From The Quadead Zone (1987) NTSC DVD5 --MvDmp","uid":6699146,"size":2389713836,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:3d91a6149f079b8aff68d40b9dfde4a07079ed91&amp;dn=Tales+From+The+Quadead+Zone+%281987%29+NTSC+DVD5+--MvDmp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lunarpod","files":11,"time":1316893751,"description":"TALES FROM THE QUADEAD ZONE\n\nYear: 1987\nCountry: USA\nLanguage: English\nGenre: Horror -VERY Low Budget\nDuration: 62min 24sec\nDirector: Chester Novell Turner\nStars: W.J. Rider, Doug Daverport and Johnnie Tanguy\n\nSYNOPSIS/REVIEW from Joseph A. Ziemba of Bleedinskull.com:\nTales From The Quadead Zone, a three story anthology, is Chester N. Turner\\\\\\\\\\\\\\'s second and final dig into self-released, SOV sludge. Following up the exhaustive-yet-hilarious filth of Black Devil Doll From Hell (1984), Quadead finds Turner and friends in a very distinctive place. They honed the skillz, cut the sex, and unwittingly churned out the greatest SOV trash film of all time. No exceptions. Explanation, be it godly or mortal, has gone missing during Quadead\\\\\\\\\\\\\\'s 62 deranged minutes. Therefore, we must be prepared for anything. Don\\\\\\\\\\\\\\'t knock \\\\\\\\\\\\\\'em for the Casiotone CT-401; take heed of the titty-mug. In the mind of Chester Turner, these things may be the substance of life. I wholeheartedly agree.\n\nA swirl of comic book credits and psychotic, ass-shaking beats usher us into the Quadead Zone. A woman (Shirley L. Jones, Helen from Black Devil Doll) reads stories from the Quadead Zone book to her son, Bobby. Bobby is an invisible ghost. He communicates with Shirley by whispering \\\\\\\\\\\\\\&quot;Sha-sh-sh-sh-sha!\\\\\\\\\\\\\\&quot; and blowing in her hair (she seems to have wind-gasms when this happens). \\\\\\\\\\\\\\&quot;Food For ?\\\\\\\\\\\\\\&quot; tells the tale of eight white trash yokels, their quest for five sandwiches, a teddy bear bell, and the unfortunate introduction of a shotgun. In \\\\\\\\\\\\\\&quot;The Brothers,\\\\\\\\\\\\\\&quot; Ted (Keefe L. Turner, brother of Chester) and Fred steal Ted\\\\\\\\\\\\\\'s brother\\\\\\\\\\\\\\'s dead body from the Brown-Rawls Funeral home. Fred says, \\\\\\\\\\\\\\&quot;Fuck you want a dead body for, man?\\\\\\\\\\\\\\&quot; Ted replies with something that sounds like \\\\\\\\\\\\\\&quot;Bambtwow!\\\\\\\\\\\\\\&quot; Ted\\\\\\\\\\\\\\'s brother does not enjoy being dressed as a clown. Finally, Shirley\\\\\\\\\\\\\\'s wraparound story becomes our third adventure, \\\\\\\\\\\\\\&quot;Unseen Vision\\\\\\\\\\\\\\&quot;. Daryl, Shirley\\\\\\\\\\\\\\'s husband, arrives home, then proceeds to beat the shit out of her with the Quadead book. He says, \\\\\\\\\\\\\\&quot;Goddamn fool crazy muthafucka dirty bitch, shit!,\\\\\\\\\\\\\\&quot; then gets stabbed. Keyboard twee. Razor blade. Video ghosts. No fin; the credits say \\\\\\\\\\\\\\&quot;Tales From The Quadead Zone Will Return\\\\\\\\\\\\\\&quot;. I will await forever.\n\nAs you can see, rules of language, structure, and general awareness have no business in the Quadead Zone. It\\\\\\\\\\\\\\'s a tight package of non-stop, fantasmo delirium. People speak in tongues that escape the radar of historical linguists. Chester Turner\\\\\\\\\\\\\\'s homemade score (some of which is recycled from Black Devil Doll, but re-recorded) drowns out everything at all times. Hilarity forces you to pause for breath (Ted and Fred\\\\\\\\\\\\\\'s jive talk sessions) before pummeling you with disturbing grit-gore (Daryl Vs. Shirley). Surprises hide beneath every plastic covered couch and dirt floor basement. And then, before you realize it, Quadead walks the plank...and lives.\n\nThe novelty of 1980s SOV trash films lies in their associative qualities; real people making movies on their own terms and having fun. Simple. Admirable. Quadead looks real enough, and that\\\\\\\\\\\\\\'s the stinger. The occurrences and technical decisions in the film are so completely derailed that Turner and company had to be either \\\\\\\\\\\\\\&quot;touched\\\\\\\\\\\\\\&quot; or oblivious in their manic creativity. In other words, splash cold water on your face. This is really happening. When that mindset hits, the film is elevated above the expected SOV expectations; Tales From The Quadead Zone is incredibly effective with its bad decisions and equally defective the other way around. The original intent will baffle to no end, but one thing\\\\\\\\\\\\\\'s for sure: This is an experience that can never be replicated, repeated, or equaled. The theme song only adds to the perfection.\n\nSource: VHS\nRegion: ALL\nVideo: VHS transfer\nMenu: Custom\nExtras: None\nAudio: 2.0\nSubtitles: None\n\nIMDB Link: http://www.imdb.com/title/tt0215234/\n\nEnjoy!!\n &lt;a href=&quot;\nhttp://www.MovieDump.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.MovieDump.net&lt;/a&gt;\n","torrent":{"xt":"urn:btih:3d91a6149f079b8aff68d40b9dfde4a07079ed91","amp;dn":"Tales+From+The+Quadead+Zone+%281987%29+NTSC+DVD5+--MvDmp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d91a6149f079b8aff68d40b9dfde4a07079ed91","infoHashBuffer":{"type":"Buffer","data":[61,145,166,20,159,7,155,138,255,104,212,11,157,253,228,160,112,121,237,145]},"announce":[],"urlList":[]}}