{"title":"Coast to Coast AM February 20 2013","uid":8173704,"size":56042373,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:3e0bb2d7f3d496737f8631af10b3f22f2f4c13fc&amp;dn=Coast+to+Coast+AM+February+20+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1361474683,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t02-20-13\nHost: \tGeorge Noory\nGuests: \tRussell Targ, - Devaron\n\nIn the first half, writer and physicist Russell Targ discussed the early remote viewing program, including his work with the 'father of remote viewing,' the late Ingo Swann. &quot;Ingo taught us about the whole idea of remote viewing,&quot; he said, recalling early experiments in which Ingo was able to raise the temperature of different thermos bottles on a random schedule. In the summer of 1972, Swann came to work with Hal Puthoff at Stanford, and showed that he could psychically slow down sine wave frequencies of balls spinning in a vacuum. When Targ began to work with them, NASA asked Swan to view Jupiter (around one million miles away). &quot;He sees a belt of shiny crystals as he zooms in, surrounding the planet, and no one had ever seen that before because they're too faint to see from Earth,&quot; he recounted, adding that we now know that when people do remote viewing, they see the target in real time at the distant location, which violates the notion of relativity.\n\nOne of the most valuable uses for remote viewing, Targ suggested, is as a tool for self-discovery. &quot;As you get familiar with remote viewing, you realize your awareness fills all of space-time...so it's clear that you couldn't possibly be just made of meat and potatoes,&quot; he commented. He also talked about different aspects of psychic gifts and ESP (his free ESP Trainer app is available on iTunes). Interestingly, he noted that the late renowned psychic Peter Hurkos only became psychic after he fell off a ladder and banged his head. As a tribute to the recently deceased Ingo Swann, we have made available audio from a Coast appearance he made in 2000.\n\n--------------------------------------\n\nIn the latter half, self- claimed alien/human hybrid, Devaron, discussed the phenomenon of &quot;changelings,&quot; children who are surreptitiously or unintentionally substituted for another by ETs. According to Devaron, this program has been happening since the dawn of mankind, possibly instigated by an ET race such as the Annunaki. The purpose of such exchanges is to evolve the overall consciousness of the human species, as well as to evolve the genetic signature of humans, he said. Devaron estimated that over time, there've possibly been millions of 'changeling' exchanges that have occurred.\n\nChangelings have special abilities, such as intuition, and typically stand out from the crowd, Devaron continued, citing Moses (found floating in the river as a baby) as an example of a changeling. Devaron considers himself a changeling, and according to the communications he's received from the ETs, they have some 250 home worlds in our galaxy and Andromeda. He said he visited one such world-- a planet in the Vega system about 78% the size of Earth with lush forests, though the ETs live in connected underground cities that are encased in protective bubbles.\n\nNews segment guests: Stan Deyo, Katherine Albrecht\nWebsite(s):\n\n    espresearch.com\n    uvian.org\n\nBook(s):\n\n    The Reality of ESP: A Physicist's Proof of Psychic Abilities\n    Do You See What I See?: Memoirs of a Blind Biker\n    Principles of Self Mastery\n\n","torrent":{"xt":"urn:btih:3e0bb2d7f3d496737f8631af10b3f22f2f4c13fc","amp;dn":"Coast+to+Coast+AM+February+20+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e0bb2d7f3d496737f8631af10b3f22f2f4c13fc","infoHashBuffer":{"type":"Buffer","data":[62,11,178,215,243,212,150,115,127,134,49,175,16,179,242,47,47,76,19,252]},"announce":[],"urlList":[]}}