{"title":"Leaving Las Vegas (1995) [DVDrip (XviD)]~Ekolb","uid":4854406,"size":978629497,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3eccd518a9db5c62623b4ac4ead002d92791285e&amp;dn=Leaving+Las+Vegas+%281995%29+%5BDVDrip+%28XviD%29%5D%7EEkolb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ekolb","files":4,"time":1240001107,"description":"Leaving Las Vegas (1995)\n\nLeaving Las Vegas is a 1995 romantic drama film about a relationship between a suicidal alcoholic and a prostitute from Las Vegas, starring Nicolas Cage and Elisabeth Shue. Ben Sanderson is a late-stage alcoholic who has hit rock bottom. Trashing all personal and professional ties to his L.A. existence, he sets off for the lights of Vegas on a mission: to drink himself to death. There he meets Sera, a beautiful, seen-it-all hooker. From the moment Ben and Sera connect, they form a unique bond based upon unconditional acceptance and mutual respect that will change each of them forever. The film was directed and written by Mike Figgis, based on a semi-autobiographical novel by John O'Brien. Two weeks after the production of the film had started, O'Brien committed suicide. A halt of the project was considered, but work on the film was continued as a memorial of sorts.\n\nLeaving Las Vegas was filmed in super 16mm instead of 35 mm film format, which is the basic film gauge most commonly used for motion pictures, although 16 mm is relatively common for art house films. After a limited release in the United States on October 27, 1995, the film received high critical praise. It made its nation-wide release on February 9, 1996, with moderate box office receipts, presumably because the film did not have a big marketing scheme, and it was fairly unknown until after the Academy Awards Ceremony of 1996. The critical success of the film did not surface immediately, however it was one of the most popular films for rental and sale in 1996 and 1997. Nicolas Cage received an Academy Award for Best Actor for his work in this film. Elisabeth Shue was nominated for the Academy Award for Best Actress and the film also received nominations for Best Adapted Screenplay and Best Director (Figgis).\n\nDirected by Mike Figgis \nProduced by Lila CazÃƒÂ¨s\nAnnie Stewart \nWritten by John O'Brien (novel)\nMike Figgis (screenplay) \nStarring Nicolas Cage\nElisabeth Shue\nJulian Sands\nRichard Lewis\nValeria Golino\n\nFormat            : AVI\nLength            : 933 MiB for 1h 51mn 59s 136ms\nCodec             : XviD\nSource            : DVD5\n\nVideo #0          : MPEG-4 Visual at 1 020 Kbps\nAspect            : 624 x 352 (1.773) at 23.976 fps\n\nAudio #0          : MPEG Audio at 133 Kbps\nInfos             : 2 channels, 48.0 KHz\n\nEnjoy!\nEkolb","torrent":{"xt":"urn:btih:3eccd518a9db5c62623b4ac4ead002d92791285e","amp;dn":"Leaving+Las+Vegas+%281995%29+%5BDVDrip+%28XviD%29%5D%7EEkolb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3eccd518a9db5c62623b4ac4ead002d92791285e","infoHashBuffer":{"type":"Buffer","data":[62,204,213,24,169,219,92,98,98,59,74,196,234,208,2,217,39,145,40,94]},"announce":[],"urlList":[]}}