{"title":"Firehouse - I Live My Life For You (Xvid-2nafish)","uid":6053763,"size":162099310,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3ed361eb9855318e61ed5b0b76229620e15c222a&amp;dn=Firehouse+-+I+Live+My+Life+For+You+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1292823149,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:04:18\n\n[Video]\nResolution : 480x360\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 4883 Kbps\nQuality Factor : 0.97 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;I Live My Life for You&quot; is the seventh single released by the American rock band FireHouse. The song reached number 26 on the Billboard Hot 100 and number 20 on the Adult Contemporary charts. The song was written by guitarist Bill Leverty and vocalist C.J. Snare.\n\nWhen asked about the song's success in an interview, Snare commented that &quot;we surprised a lot of people because we were the only band of that genre that I can remember that actually had a top 20 hit right in the middle of that whole Seattle scene.&quot;\n\n3 is the aptly titled third studio album of the rock band FireHouse. It was released in 1995.\n\nThe album featured a softer sound than their previous two albums. It also spawned another hit signature power ballad in &quot;I Live My Life for You&quot;.\n\nFireHouse is an American hard rock band formed in Charlotte, North Carolina in 1989. The band reached stardom during the early 1990s with hit singles like &quot;Don't Treat Me Bad&quot; and &quot;All She Wrote&quot;, as well as their signature ballads &quot;I Live My Life for You&quot;, &quot;Love of a Lifetime&quot;, and &quot;When I Look Into Your Eyes&quot;. At the 1992 American Music Awards, FireHouse won the award for Best New Hard Rock/Metal Band. They were chosen over Nirvana and Alice in Chains.\n\nDespite diminishing success in the United States as the decade progressed, the band remained very popular in Asia, mainly in countries like Japan, Thailand, and Singapore. FireHouse continued to release new material throughout the late 1990s and into the early 2000s, most of which has successfully charted in Japan. The band has also continued to tour internationally as of 2007, having participated twice in the annual Rock Never Stops Tour with other bands of the 1980s. FireHouse is estimated to have sold 7 million albums worldwide since their debut.\n\nOriginally composed of vocalist C.J.Snare, guitarist Bill Leverty, guitarist Cosby Ellis, drummer Michael Foster, and bassist Perry Richardson, the band has maintained its original members with the exception of Cosby Ellis, who left the band in 1989 after co-writing the multi platinum debut recording and was not replaced, and Richardson, who departed in 2000 due to conflict. Richardson was replaced three times before current bassist Allen McKenzie was given the position in 2004. \n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:3ed361eb9855318e61ed5b0b76229620e15c222a","amp;dn":"Firehouse+-+I+Live+My+Life+For+You+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ed361eb9855318e61ed5b0b76229620e15c222a","infoHashBuffer":{"type":"Buffer","data":[62,211,97,235,152,85,49,142,97,237,91,11,118,34,150,32,225,92,34,42]},"announce":[],"urlList":[]}}