{"title":"Un giorno perfetto,  Ferzan Ozpetek","uid":8145029,"size":1102920500,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3fa296c8b1ca6aa47ab8068d352ad994a1ebd9ba&amp;dn=Un+giorno+perfetto%2C++Ferzan+Ozpetek&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"wesleybl","files":6,"time":1360895709,"description":"A dysfunctional family is torn apart in a moment of violence and anger in this thriller from director Ferzan Ozpetek. Antonio (Valerio Mastandrea) is a burly and short-tempered man who works as a bodyguard for Elio Fioravanti (Valerio Binasco), a high-ranking politician. Antonio is officially married to Emma (Isabella Ferrari), but she's left him and has gone to live with her mother Adriana (Stefania Sandrelli), taking their kids Valentina (Nicole Murgia) and Kevin (Gabriele Paolino) with her. Antonio is determined to win Emma back, and when Kevin is invited to a birthday party thrown for Elio's daughter by the politician's young trophy wife Maja (Nicole Grimaudo), he hopes it will give him a chance to reconnect with his family. However, at the party Emma makes it clear that she has no interest in getting back together with Antonio and wants him to stop following her. Antonio flies into a rage, attacks Emma, then storms off with Valentina and Kevin in tow. Once Emma collects herself, she realizes she must act quickly if she wants her children back, and with the help of Mara (Monica Guerritore) they comb the city in search of Antonio. Un Giorno Perfetto (aka A Perfect Day) was an official selection at the 2008 Venice Film Festival.\n\nDirector:  Ferzan Ozpetek\n\nSubtitles: Portuguese, Greek, Serbian, Turkish\n\nDVD rip","torrent":{"xt":"urn:btih:3fa296c8b1ca6aa47ab8068d352ad994a1ebd9ba","amp;dn":"Un+giorno+perfetto%2C++Ferzan+Ozpetek","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fa296c8b1ca6aa47ab8068d352ad994a1ebd9ba","infoHashBuffer":{"type":"Buffer","data":[63,162,150,200,177,202,106,164,122,184,6,141,53,42,217,148,161,235,217,186]},"announce":[],"urlList":[]}}