{"title":"EnigmaT Set Rips { Cuts } - August 28th, 2014","uid":10914181,"size":855559008,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4203e2cfe4248f6e412b8b65102bd70d29d68bc8&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+August+28th%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":100,"time":1409290003,"description":"Adagio Sensus &amp; Ellie Lawson - Easy For You (Original Mix) (Cut From Feel Set)-enTc\nAlex Ender &amp; Allion - Monterini (GDJB Rip)-enTc\nAllen &amp; Envy &amp; Swap - Nemesis (Kinetica Remix) (Set Rip)-enTc\nAly &amp; Fila - Along The Edge (ASOT 678 Rip)-enTc\nAndy Bianchini feat. Roman Polonsky - No Cold Ice (Cut From Criado Set)-enTc\nArkham Knights - Disconnected (ASOT 678 Rip)-enTc\nArmin van Buuren - Hystereo (ASOT 678 Rip)-enTc\nATB - Intencity (Witness45 Bootleg) (Set Rip)-enTc\nAurosonic &amp; Frain Breeze feat. Nina Schofield - Lift You Up (ASOT 678 Rip)-enTc\nAurosonic &amp; Frainbreeze feat. Nina Schofield - Lift You Up (Original Mix) (Cut From Feel Set)-enTc\nBeat Anatomy - Light Unique (Witness45 Remix) (Set Rip)-enTc\nBeatsole - Dreamlike (Original Mix) (Cut From Sty Set)-enTc\nBluSkay &amp; KeyPlayer feat. Natalie Rose - Summer Rain (Emanuele Congeddu Dub Mix) (Cut From Uplift Set)-enTc\nBoeoes Kaelstigen - Be The Lights (Bjorn Akesson Glitchy Dub) (Cut From Bjorn Set)-enTc\nCiro Visone - Tuono (Original Mix) (Cut From Angel Ace Set)-enTc\nCobra Effect - Sandro Sofa (Cobra Effect Biteleg) (Cut From Gold Set)-enTc\nCompact Grey - S.A.Y. (Original Mix) (Cut From Armada Set)-enTc\nCurtis Young - Last Resort (Fady &amp; Mina Remix) (ASOT 678 Rip)-enTc\nCurtis Young - Last Resort (Fady &amp; Mina Remix) (Cut From Romel Set)-enTc\nDanny Stubbs - What Happened To Us (Cut From Solarstone Set)-enTc\nDarren Porter - The Oracle (ASOT 678 Rip)-enTc\nDash Berlin &amp; 3LAU feat. Bright Lights - Somehow (ASOT 678 Rip)-enTc\nDash Berlin &amp; Disfunktion feat. Chris Arnott - People Of The Night (ASOT 678 Rip)-enTc\nDash Berlin &amp; John Dahlback feat. BullySongs - Never Let You Go (ASOT 678 Rip)-enTc\nDave Silcox - Everything (Cut From W&amp;W Set)-enTc\nDave Till &amp; Tyler Ace - Desert Storm (Cut From W&amp;W Set)-enTc\nDavid Gravell - The Last of Us (GDJB Rip)-enTc\nDavid Gravell - The Last Of Us (Original Mix) (Cut From Armada Set)-enTc\nDavid Guetta &amp; Showtek feat. Vassy - Bad (OOVEE Bootleg) (Cut From W&amp;W Set)-enTc\nDedrekoning featuring Sophie Ellis-Bextor - Only Child (Pearson &amp; Hirst Remix) (GDJB Rip)-enTc\nDimitri Vegas, MOGUAI &amp; Like Mike feat. Julian Perratta - Body Talk (Mammoth) (Cut From W&amp;W Set)-enTc\nDirty South feat. Sam Martin - Unbreakable (Club Edit) (Cut From Gold Set)-enTc\nDirtywork - Get Funky (Original Mix) (Cut From Gold Set)-enTc\nDisfunktion - On (Original Mix) (Cut From Armada Set)-enTc\nDJ Aramis - Shift (Original Mix) (Cut From 9Axis Set)-enTc\nDJ RaySim - Heaven's Gate (Emotional Mix) (Cut From 9Axis Set)-enTc\nDuncan Newell - On The Rocks (ASOT 678 Rip)-enTc\nDVBBS &amp; Joey Dale feat. Delora - Deja Vu (Cut From W&amp;W Set)-enTc\nEgera vs Ronni Nilsen - Galadriel (Serge Macoveu Sunrise Mix) (Cut From All-Stars Set)-enTc\nEllez Ria - Overdrive (Project 8 Remix) (Cut From All-Stars Set)-enTc\nEmir Guven - Hazel (Kayat Remix) (Cut From Angel Ace Set)-enTc\nFarzin - Redeemer (Jesper Olesens Uplifting Remix) (Cut From Saux Set)-enTc\nFederation - Be There (Darren Porter Remix) (ASOT 678 Rip)-enTc\nFederation - Be There (Darren Porter Remix) (Cut From Solarstone Set)-enTc\nFirst State - Scube (Cut From Schossow Set)-enTc\nFreedom Fighters &amp; Ivort - Creature From The Lost World (Original Mix) (Cut From Newall Set)-enTc\nGalantis vs Tom &amp; Jame - You (Dannic Ultra Bootleg) (Cut From W&amp;W Set)-enTc\nGeorge Boston - Casablanca (Allen &amp; Envy Remix) (Set Rip)-enTc\nGran Saxena - Future Truth (Original Mix) (Cut From Colonial One Set)-enTc\nGusGus - Over (Juventa Bootleg) (Cut From W&amp;W Set)-enTc\nHeatbeat - Bloody Moon (ASOT 678 Rip)-enTc\nHilton Caswell &amp; Trilucid - The Unbelievable Truth (Original Mix) (Cut From Saint-Jules Set)-enTc\nIkerya Project - United (Original Mix) (Cut From Above Clouds Set)-enTc\nJacob van Hage - Floorburn (GDJB Rip)-enTc\nJaymes Young - Habits Of My Heart (Jakko Remix) (Cut From Schossow Set)-enTc\nJoe Garston feat. Andrew Farr - Airglow (Cut From W&amp;W Set)-enTc\nJohn Lennon - Imagine (Armin van Buuren Bootleg) (ASOT 678 Rip)-enTc\nJohn O'Callaghan - One Special Particle (Guy J Remix) (GDJB Rip)-enTc\nKinetica - Amazonia (Set Rip)-enTc\nKinetica - ID -August 2014- (Set Rip)-enTc\nKlauss Goulart - Absolute Chaos (Tepes Remix) (GDJB Rip)-enTc\nLeon 76 presents Northia - Lead-ka (GDJB Rip)-enTc\nMajera - Till We Meet Again (Cut From Solarstone Set)-enTc\nManno, Sickstate - Barrage (Demo) (Cut From Gold Set)-enTc\nMaor Levi feat. Angela McCluskey - Pick Up The Pieces (Cut From Ferry Set)-enTc\nMarkus Schulz featuring Lady V - Erase You (Wellenrausch's Dark Matter Remix) (GDJB Rip)-enTc\nMatt Skyer - Green (Original Mix) (Cut From Angel Ace Set)-enTc\nMax Graham vs. Maarten de Jong - Lekker (ReOrder Remix) (ASOT 678 Rip)-enTc\nMemoria - Divided (Xylo's 'Split Persona' Remix) (Cut From Angel Ace Set)-enTc\nMichael Cassette - Disco Frisco (Original Mix) (Cut From Super8 Set)-enTc\nMixail feat. Stijn Moz - Space Dance (Hold On Tight) (Cut From Pit Set)-enTc\nMonoverse - What We Wont See (Cut From Pit Set)-enTc\nMyk Bee - Forever Gone (Original Mix) (Cut From Romel Set)-enTc\nMystique - Brand New (Cut From Schossow Set)-enTc\nNew World - Ushio (Cut From Uplift Set)-enTc\nNikhil Prekash &amp; Iionas - Sunny Side Up (Cut From Akira Set)-enTc\nOMEWorld &amp; Artem Dultsev pres. Aurora 6 - Im Alive (Jesse Suun Remix) (Cut From Feel Set)-enTc\nOne Republic - Love Runs Out (Marcus Schossow Remix) (Cut From Schossow Set)-enTc\nPhil Dinner feat. Danny Claire - Where Have You Gone (Aizen Remix) (Set Rip)-enTc\nPhotographer - Rebound (ASOT 678 Rip)-enTc\nPLH feat. Annie Ducharme - Liberty (Violin Mix) (Cut From Romel Set)-enTc\nPRIDES - I Should Know You Better (Grum Remix) (ASOT 678 Rip)-enTc\nPurple Stories - Sacura (GDJB Rip)-enTc\nRafael Frost feat. Ana Criado - Never Been Hurt Before (Cut From Ferry Set)-enTc\nRAM &amp; Susana - RAMelia (Tribute to Amelia) (Driftmoon Remix) (Cut From 9Axis Set)-enTc\nRichard Bass - Memories Of Happiness (Original Mix) (Cut From Feel Set)-enTc\nRogier de Kreuk - Pendejo (ASOT 678 Rip)-enTc\nRonski Speed - Sipoc (ASOT 678 Rip)-enTc\nS.W.A.R.M. - Step Into The Light (Original Mix) (Set Rip)-enTc\nSensetive5 &amp; Max Meyer - Bilao Sunrise (Zack Roth Remix) (Cut From Saint-Jules Set)-enTc\nSimon Moon &amp; Lukas Wawryca - Euphoria (Michele Cecchi Remix) (Cut From All-Stars Set)-enTc\nSkyknock - Arias Dream (Talamanca Remix) (Cut From Feel Set)-enTc\nSonny M - Pure (Alan Ruddick Remix) (Cut From All-Stars Set)-enTc\nSoundLift - Freedom (Intro Mix) (Cut From Uplift Set)-enTc\nThomas Newson &amp; Magnificence - Blizzard (Cut From W&amp;W Set)-enTc\nTonerush - Iris (Original Mix) (Cut From Saux Set)-enTc\ntranzLift - City of the Gods (Peter Smith Remix) (Cut From Romel Set)-enTc\nWillem De Roo - Inception (Cut From Ferry Set)-enTc\nWitness45 - Harder Sky (Original Mix) (Set Rip)-enTc\nZuubi - Duality (Original Mix) (Cut From Feel Set)-enTc\n","torrent":{"xt":"urn:btih:4203e2cfe4248f6e412b8b65102bd70d29d68bc8","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+August+28th%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4203e2cfe4248f6e412b8b65102bd70d29d68bc8","infoHashBuffer":{"type":"Buffer","data":[66,3,226,207,228,36,143,110,65,43,139,101,16,43,215,13,41,214,139,200]},"announce":[],"urlList":[]}}