{"title":"Prism - Over 60 Minutes With Prism (1991) Mp3 320 vtwin88cube","uid":5868682,"size":175509054,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:42503e895a55e01e3bff0a2cadad9ccf4f40705b&amp;dn=Prism+-+Over+60+Minutes+With+Prism+%281991%29+Mp3+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1286308144,"description":"Prism - Over 60 Minutes With Prism: The Best Of (1991)\nMp3\nCBR 320\nTagged with front cover\n\n\nThe arena rock sound from Canada's Prism  dominated radio in the '70s and early '80s, and with 16 singles under their belt they were one of the forerunners amidst the multitude of other guitar rock bands. This hits collection from the &quot;Over 60 Minutes&quot; series gathers all of their strongest songs and reveals an excellent cross section of this talented band's musicianship. With six of their album's represented here, the purity of Ron Tabak's harsh yet powerful vocals burst from the guitar and keyboard interplay that swims behind him. The first three songs on the album, &quot;Good to Be Back,&quot; &quot;Don't Let Him Know,&quot; and &quot;Cover Girl,&quot; were written by Bryan Adams and Jim Vallance, who were good friends of the band. The song &quot;Cover Girl&quot; is an ode to the late Playboy playmate Dorothy Stratten who was murdered by her former boyfriend at the age of 20. Other highlights include the aloof guitar guided &quot;Young and Restless&quot; and the high school prom favorite &quot;Night to Remember.&quot; Prism prove they weren't just another rock band from the West coast with &quot;Armageddon,&quot; about the first anniversary of Elvis Presley's death. For this song, they brought in the Vancouver Symphony Orchestra to play some beautifully crafted violin and cello work to mingle with the bold guitar playing. Some mesmerizing keyboard work takes command in the dazzling &quot;Spaceship Superstar&quot; by way of John Hall, inspired by the first Star Wars movie. The synthesizer makes up much of the group's sound, but it's used for effect rather than for rhythm, as heard on songs like &quot;Flying&quot; and &quot;Take Me Away.&quot; Sometimes sounding like Jefferson Starship, Prism  produced refined, chord blazing rock with high harmonies emerging from out of nowhere and crisp keyboards for coloration. Each of the 17 songs on this collection are splendid examples of pure AOR rock. ~ Mike DeGagne, All Music Guide.\n\n\n1.  Good to Be Back - Prism, Adams, B. \t\n2.  Don't Let Him Know - Prism, Adams, Bryan \t\n3.  Cover Girl - Prism, Adams, B. \t\n4.  Young and Restless - Prism, Harlow, Allen \t\n5.  American Music - Prism, Mitchell, Lindsay \n6.  Armageddon - Prism, Mitchell, L. \t\n7.  Virginia - Prism, Miller, B. \t\n8.  You Walked Away Again - Prism, Adams, B. \t\n9.  Mirror Man - Prism, Hall, J. \t\n10. Night to Remember - Prism, Mitchell, L. \t\n11. See Forever Eyes - Prism, Hall, J. \t\n12. Flying - Prism, Harlow, A. \n13. Take Me Away - Prism, Harlow, A. \t\n14. It's Over - Prism, Higgs, Rodney \t\n15. Open Soul Surgery - Prism, Higgs, Rodney \t\n16. Take Me to the Kaptain - Prism, Higgs, Rodney \t\n17. Spaceship Superstar - Prism, Higgs, Rodney \n\n\nEnjoy &amp; SEED SEED SEED...","torrent":{"xt":"urn:btih:42503e895a55e01e3bff0a2cadad9ccf4f40705b","amp;dn":"Prism+-+Over+60+Minutes+With+Prism+%281991%29+Mp3+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42503e895a55e01e3bff0a2cadad9ccf4f40705b","infoHashBuffer":{"type":"Buffer","data":[66,80,62,137,90,85,224,30,59,255,10,44,173,173,156,207,79,64,112,91]},"announce":[],"urlList":[]}}