{"title":"VectorLinux 6.0 Standard Edition Gold","uid":4737156,"size":733554979,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:42abc74a8e056645f331addf7713d6a457d8ba8f&amp;dn=VectorLinux+6.0+Standard+Edition+Gold&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bey0nd","files":2,"time":1235376570,"description":"The final release of VectorLinux 6.0 (code name 'Voyager') is now available. This release is a major milestone in the ten year history of Vectorlinux. With the unbridled enthusiasm of a community gone wild, we have forged our very own stable GUI installer and our repository now hosts over a thousand packages. VectorLinux is the fastest Linux desktop in it's class. We have exceeded our original goals of VectorLinux 6.0 and produced a beautiful, full featured stable desktop for a rocket fueled experience.\n\nThe main desktop is based on Xfce-4.4.3 with a custom theme and artwork again unique to VectorLinux. LXDE is installed as a secondary desktop option. Much work has been done on localization and we know users from all over the globe will find VectorLinux a stellar experience.\n\nAll the VectorLinux trademarks are included: DVD playback, Audio and Video Codecs, Multimedia and Java plugins are installed and working out of the box. The best of the Open Source world is included: Gimp, Inkscape, Gtkam, Gqview and Xpdf for Graphics; Firefox, Opera, Dillo and Seamonkey for Internet Browsing; aMsn, Pidgin and Xchat for instant messaging; K3b and our very own vburn for CD burning; Mplayer, XMMS, Xine and VLC for playing most available media formats. The office applications are Gnumeric, Abiword and Scribus.\n\nWireless networking has been extended with updated drivers and firmware, Wicd has been employed to manage wireless and non wireless networking. Firestarter is included for firewall protection and there is added support for several webcam makes and models.\n\nWith all the improvements in installation, usability and hardware Support, we believe this release will finally give Vectorlinux the desktop recognition it deserves. &lt;a href=&quot;\nhttp://vectorlinux.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://vectorlinux.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:42abc74a8e056645f331addf7713d6a457d8ba8f","amp;dn":"VectorLinux+6.0+Standard+Edition+Gold","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42abc74a8e056645f331addf7713d6a457d8ba8f","infoHashBuffer":{"type":"Buffer","data":[66,171,199,74,142,5,102,69,243,49,173,223,119,19,214,164,87,216,186,143]},"announce":[],"urlList":[]}}