{"title":"(Blues) Salty Dog - Slap That Thing","uid":6314886,"size":131132065,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:42ef5c35682cdeeca739db5f4914f606f17182bc&amp;dn=%28Blues%29+Salty+Dog+-+Slap+That+Thing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nightissuchproximity","files":-1,"time":1302669454,"description":"Styles: Acoustic Blues, Contemporary Blues\nReleased: 2001\nLabel: Black Market Music\nFile: mp3@320K/s\nSize: 123.3 MB\nTime: 53:51\nArt: front + back\n\n1. Preachin' Blues - 4:11\n2. Slap That Thing - 2:44\n3. Cypress Grove - 4:07\n4. Got A Bad Feelin' - 3:19\n5. Black Mattie - 3:39\n6. Boogie Woogie Country Girl - 3:50\n7. Deep River Blues - 3:07\n8. He's My Daddy - 3:09\n9. Mandolin Boogie - 2:46\n10. Parchment Farm - 3:14\n11. Mama Taint Long Fo Day - 3:24\n12. Kansas City Blues - 2:18\n13. Crossroads - 3:43\n14. Hello Little Boy - 3:28\n15. Kind Hearted Man - 3:41\n16. Georgia Crawl - 3:11\n\n\n\nNotes:Steve Plater - A dynamic wicked guitar player, both electric and acoustic,has gained the recognition as one of Australia's finest multi-instrumentalists. Steve is a one man band performing on Drums, snare and hi-hat with his awesome sounding handcrafted Biscuit-Tin/Jack Daniels tin guitar and Cigar box guitars made by Steve himself, clearly giving the raw rootsey edge to Salty Dog,s unique sound.\nFrom their opening set Steve's energy is radiated into the crowd setting them on fire with his powerful drumming and fierce guitar playing captivating audiences young and old, are dancing or either tapping their feet to the hypnotic beat immersing themselves into the music! Through out the show anxious punters speak to Steve about his wicked custom instruments which mostly result in a sale or two! Don't be surprised if you see one of Steve's creations hanging around at the odd venue here and there. Soon he won't have to bring all of his instruments to shows as he may just grab a Jack Daniels Whiskey Tin guitar from over the bar that various venues have purchased from him at past gigs and play it!The guitar demon set the crowd on fire when Salty Dog performed\nat the recent International Blues rock festival in Phuket Thailand which sealed a come back performance.\nSteve won Male Artist of the Year Vic/Tasmanian Blues awards back in 2000 and is the only non vocal guitarist to win such an award in the category, is, a master perfectionist at his craft. He recorded a Solo album in 2006 WILD GUITAR including originals and his own renditions of Surf/Blues dedicated to his all time favorite guitar players Dick Dale Roy Buchanan Robin Trower\nMarion Turner - Australia's leading female vocal blues harmonica player completes the other half of salty dog and is the 3-times winner Vic/Tas Blues awards Female Artist of the Year. Marion Turner - Australia's leading female vocal blues harmonica player completes the other half of salty dog and is the 3-times winner Vic/Tas Blues awards Female Artist of the Year. ","torrent":{"xt":"urn:btih:42ef5c35682cdeeca739db5f4914f606f17182bc","amp;dn":"%28Blues%29+Salty+Dog+-+Slap+That+Thing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42ef5c35682cdeeca739db5f4914f606f17182bc","infoHashBuffer":{"type":"Buffer","data":[66,239,92,53,104,44,222,236,167,57,219,95,73,20,246,6,241,113,130,188]},"announce":[],"urlList":[]}}