{"title":"World That Never Was: True Story by Alex Butterworth","uid":9622148,"size":8603061,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:44f4ef362f04a8886035f3af23e95ab455096371&amp;dn=World+That+Never+Was%3A+True+Story+by+Alex+Butterworth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":2,"time":1392519103,"description":"\nA thrilling history of the rise of anarchism, told through the stories of a number of prominent revolutionaries and the agents of the secret police who pursued them.\nIn the late nineteenth century, nations the world over were mired in economic recession and beset by social unrest, their leaders increasingly threatened by acts of terrorism and assassination from anarchist extremists. \n\nIn this riveting history of that tumultuous period, Alex Butterworth follows the rise of these revolutionaries from the failed Paris Commune of 1871 to the 1905 Russian Revolution and beyond. Through the interwoven stories of several key anarchists and the secret police who tracked and manipulated them, Butterworth explores how the anarchists were led to increasingly desperate acts of terrorism and murder.\n\nRich in anecdote and with a fascinating array of supporting characters, The World That Never Was is a masterly exploration of the strange twists and turns of history, taking readers on a journey that spans five continents, from the capitals of Europe to a South Pacific penal colony to the heartland of America. It tells the story of a generation that saw its utopian dreams crumble into dangerous desperation and offers a revelatory portrait of an era with uncanny echoes of our own.\n\nGenre: Non-Fiction / History / Ararchists","torrent":{"xt":"urn:btih:44f4ef362f04a8886035f3af23e95ab455096371","amp;dn":"World+That+Never+Was%3A+True+Story+by+Alex+Butterworth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44f4ef362f04a8886035f3af23e95ab455096371","infoHashBuffer":{"type":"Buffer","data":[68,244,239,54,47,4,168,136,96,53,243,175,35,233,90,180,85,9,99,113]},"announce":[],"urlList":[]}}