{"title":"American Greetings Create A Card 2 2009 Gold Edition Full","uid":5465477,"size":443066612,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:45d990c9c07ac25c9384decd2fb47fc035882328&amp;dn=American+Greetings+Create+A+Card+2+2009+Gold+Edition+Full&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"altfactor","files":1,"time":1269601055,"description":"American Greetings Create-A-Card 2009 Gold v2\n\nAmerican Greetings Creat a Card is the fun and easy way to personalize greeting cards for every occasion in your life. Show family and friends how much you care by choosing just the right card for them.\nWith Create A Card Gold v2, you can choose from Birthday Cards, Anniversary Cards, Get well Cards, Christmas Cards, Thinking of you, Thank you Cards, Valentine's Day Cards, Romantic Cards, Congratulations Cards, Wedding Cards, Announcement Cards, Halloween Cards and more.\n\nMake your selection, customize it and print it out.\n\nUse this Greeting card software to create your stunning greeting cards easily. Belltech Greeting Card Designer, a feature-rich professional quality greeting card software, helps you create amazing greeting cards in a matter of minutes and email or print them right-away on any Windows compatible printer.\n\nDesign from a variety of templates, poems.\nPut your own photos and text.\nPrint card in your own printer.\nEmail card (e greeting card) as an image file attachment.\n\nDesign personalized cards for Birthdays, Wedding, New Year, anniversaries, Valentines Day or any special occasion. The program comes with tons of card templates, clip art, background pictures to get you started. For fast output, you just choose a template, personalize the messages and print, that's all; Also, use shapes like heart, call-out, moon, sun etc. to make your card even more interesting.\n\nProduct Highlights:\nQuick and Easy Design: Why bother going to store spending hours looking for a perfect greeting card and then buying something that you dont like? Use our easy-to-use software to create your perfect greeting card. Choose from readymade greeting, verse and then modify the way you like, select and draw shapes and text; resize, tilt, change color, fill with gradient color or do anything with your design elements to make the right card. And all that in a few minutes.\n\nUse your own clip-arts, logo and photos: We supply you with many graphics that you can use, but don't think that it is all you can use. Get your own picture, family photo, clip-art and design the perfect card you want.\n\nChoose any layout: With is application you can create quarter-fold or half-fold cards. In quarter-fold you also choose create quarter-side-fold or quarter-top-fold cards.\n\nUse templates and graphics: Don't know how to start the layout of your card? Use our card templates, background and clip-arts to start with easily. Simple to use yet so powerful!\n\nConvenient Design tools: Draw rectangle/triangle/circle or use freehand lines and shapes to create callout and lovely designs.\n\nStunning Background: Use the supplied backgrounds or use your own. Anything is possible and is easy.\n\nUse Color blends: This is a unique feature of this greeting card software. You can now have a color blend the way you want, the control is in your hand. Remember, this is not a static background image, but a filled shape whose color-blend and texture you control completely.&quot; Possibilities are endless!\n\nSupports any printing papers: Supports all standard greeting card papers(Half-fold and quarter-fold) from Avery and other suppliers.\n\nSystem Requirements:\n-Windows 98/ME/2000/NT/XP/2003/Vista\n-64 MB of RAM and about 40 MB of hard drive space.\n\nMore features...\n-Cut-Copy-Paste: Offers cut-copy-paste functionality for all the design elements. You can also copy-paste texts and images from other applications.\n-Undo/Redo: Supports Undo/Redo.\n-Align/Rotate: You can align the selected elements to the right, left, top or bottom, or can rotate them to any desired angle.\n\nCustomers Comments:\nThis is really a cool greeting card software!\nperfect program for creating personalized cards for birthdays etc.\n","torrent":{"xt":"urn:btih:45d990c9c07ac25c9384decd2fb47fc035882328","amp;dn":"American+Greetings+Create+A+Card+2+2009+Gold+Edition+Full","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45d990c9c07ac25c9384decd2fb47fc035882328","infoHashBuffer":{"type":"Buffer","data":[69,217,144,201,192,122,194,92,147,132,222,205,47,180,127,192,53,136,35,40]},"announce":[],"urlList":[]}}