{"title":"Woods - Bend Beyond (2012) [FLAC]","uid":8094601,"size":223926047,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:461ce148700523fb5ffd2f7e36a954c8758668f3&amp;dn=Woods+-+Bend+Beyond+%282012%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1359765052,"description":"\n  Woods - Bend Beyond (2012) [FLAC]\n\n  Released: 2012\n  Duration: 32:12\n  Genre: Pop/Rock\n  Style: Indie, Psychedelic\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n  Cover: Front\n\n  01 Bend Beyond \n  02 Cali in a Cup \n  03 Is It Honest \n  04 It Aint Easy \n  05 Cascade \n  06 Back to the Stone \n  07 Find Them Empty \n  08 Wind Was the Wine\n  09 Lily \n  10 Size Meets the Sound \n  11 Impossible Sky \n  12 Something Surreal \n\n  Even with their fuzzy textures and tape experiments, Brooklyn noise folk group Woods have always made sounds that seemed more suited to the sunny settings of the West Coast than the overcrowded buildings and busy surroundings of their urban hometown. With Bend Beyond, the fifth proper full-length from a ridiculously prolific band, Woods' songs feels more drenched in sunshine and ocean spray than ever, and coincidentally more polished and confident than their ramshackle lo-fi earlier albums. \n\n  In fairness, Woods founder and principal songwriter Jeremy Earl left Brooklyn for a more peaceful home in upstate New York, where he and the rest of the band put the album together. Rather than a remote cabin-in-the-woods record, however, Bend Beyond sounds open, invigorated, and more alive than ever. Lead single &quot;Cali in a Cup&quot; lets go of some of the eeriness and sad-hearted vibes that the band embraced on breakthrough albums like Songs of Shame, feeling instead bright and jubilant, the sonic equivalent of an evening drive up the Pacific Coast Highway. \n\n  A new level of maturity in Earl's songwriting comes through on tracks like &quot;Is It Honest&quot; and the brilliant &quot;Impossible Skys,&quot; and imbues the album with a sense of hopefulness and self-assuredness never heard from the band before. Even the creepy acoustic strains and off-kilter percussion of album closer &quot;Something Surreal&quot; don't equate to the kind of downer folk all the elements suggest. The production feels more deliberate and the songs feel more purposed. Perhaps the absence of the one or two endless jam-style songs that have marked almost every Woods release up until this point contributes to the album's feeling of clearheadedness. \n\n  The closest Bend Beyond gets to jamming is the opening title track, whose passages of guitar exploration come off more like an homage to Everybody Knows This Is Nowhere-era Crazy Horse and sound restrained when compared to some of the &quot;anything goes&quot;-style noise jams that graced past efforts. With stronger songs, more solid production, and a unique synthesis of tight performances (thanks in part to new drummer Aaron Neveu) and tasteful noise, Bend Beyond is the most fully realized set of songs yet from Woods, and continues a lineage of each record surpassing their last.","torrent":{"xt":"urn:btih:461ce148700523fb5ffd2f7e36a954c8758668f3","amp;dn":"Woods+-+Bend+Beyond+%282012%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"461ce148700523fb5ffd2f7e36a954c8758668f3","infoHashBuffer":{"type":"Buffer","data":[70,28,225,72,112,5,35,251,95,253,47,126,54,169,84,200,117,134,104,243]},"announce":[],"urlList":[]}}