{"title":"The Carpenters - Close To You","uid":4475783,"size":139722756,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:47cba35415f81111275b152aca8feaad3e068684&amp;dn=The+Carpenters+-+Close+To+You&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"2nafish","files":-1,"time":1225331782,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;(They Long to Be) Close to You&quot; is a popular song written by Burt Bacharach and Hal David. It was first recorded by Richard Chamberlain and released as a single in 1963 as &quot;They Long to Be Close to You,&quot; without parentheses. However, it was the single&amp;#039;s flip side, &quot;Blue Guitar,&quot; that became a hit. Although Richard Chamberlain recorded the first version, the tune was also recorded as a demo by Dionne Warwick in 1963 and re-recorded with a Burt Bacharach arrangement for her 1964 album Make Way for Dionne Warwick, and was released as the B-side of her 1965 single &quot;Here I Am.&quot; But the version recorded by The Carpenters is the most well known, having become a hit in 1970.\n\nIn 1970, it was released by The Carpenters on their album, Close to You, and it became their breakthrough hit. The song stayed at number one on the Billboard Hot 100 for four weeks. Richard had stated that when Herb Alpert introduced the song to him back in early 1970, he was a bit apprehensive about the song, and didn&amp;#039;t have confidence in it. He and Alpert collaborated on the song, and the finished product was a 4-minute, 36-second long song. When A&amp;M Records decided to release it in May 1970, it became A&amp;M&amp;#039;s biggest hit since Herb Alpert&amp;#039;s &quot;This Guy&amp;#039;s in Love with You&quot; from 1968.\n\nBecause of &quot;(They Long to Be) Close to You,&quot; the Carpenters earned a Grammy Award for Best Contemporary Performance by a Duo, Group or Chorus in 1971. It became the first of three Grammy Awards they would win during their careers.\n\nClose to You was the second album by The Carpenters, released in August 1970. In 2003, the album was ranked number 175 on Rolling Stone magazine&amp;#039;s list of the 500 greatest albums of all time. The album contains the hit singles &quot;(They Long to Be) Close to You&quot; and &quot;We&amp;#039;ve Only Just Begun&quot;. &quot;(They Long to Be) Close to You&quot; was the duo&amp;#039;s first big hit that gained the Carpenters international reputation for a decade.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:47cba35415f81111275b152aca8feaad3e068684","amp;dn":"The+Carpenters+-+Close+To+You","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47cba35415f81111275b152aca8feaad3e068684","infoHashBuffer":{"type":"Buffer","data":[71,203,163,84,21,248,17,17,39,91,21,42,202,143,234,173,62,6,134,132]},"announce":[],"urlList":[]}}