{"title":"Halting the Sexual Predators among Us - Dobbert, D [Non-Fiction]","uid":8865666,"size":26333272,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:47d3591f17f595f49da95bc69b97608fbd764591&amp;dn=Halting+the+Sexual+Predators+among+Us+-+Dobbert%2C+D+%5BNon-Fiction%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"K-Slender","files":5,"time":1377901513,"description":"Recently, the National Center for Victims of Crime reported annual figures showing 103,845 children were sexually abused, while in that same year there was a 20% increase in all rape incidents and a 33% increase in sexual assaults. Incarceration and therapy have not reduced the rates, points out this author. The rate of incarceration has increased, but incidence of sex crimes is not waning. Dobbert warns we must all play a vital role to reduce such crimes, by prevention. The seasoned forensic examiner enables us to see life through the sexual predator's eyes, to understand the motives and intentions of people with abnormal and uncontrollable desires. He argues we can create a safer world by removing the opportunity for such people to act on their ideas.\n\nThe author clearly explains disorders from exhibitionism to pedophilia, and presents scenes that illustrate precursor behaviors shown by people preparing to act on such disordered thinking. Also illustrated are stalking patterns common to mentally ill people who commit sexual assaults or lust murders, including the activities of Kenneth Bianci, the Hillside Strangler, and Jeffrey Dahmer, whose serial lust homicides horrified the world. Community activists, teachers, principals, police officers, prosecutors, social workers, and students of criminal justice, forensic psychology, and psychopathology will find this volume of interest.\n","torrent":{"xt":"urn:btih:47d3591f17f595f49da95bc69b97608fbd764591","amp;dn":"Halting+the+Sexual+Predators+among+Us+-+Dobbert%2C+D+%5BNon-Fiction%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47d3591f17f595f49da95bc69b97608fbd764591","infoHashBuffer":{"type":"Buffer","data":[71,211,89,31,23,245,149,244,157,169,91,198,155,151,96,143,189,118,69,145]},"announce":[],"urlList":[]}}