{"title":"Adriana Chechik - The Ultimate Slut (Split scenes)","uid":12956546,"size":6780543264,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:4819c51c2c571a67adf64aefd51bac3ff50a622c&amp;dn=Adriana+Chechik+-+The+Ultimate+Slut+%28Split+scenes%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"irealu69","files":8,"time":1449786213,"description":"Adriana Chechik - The Ultimate Slut (Split scenes)\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\n\r\nCast: Adriana Chechik, Alex Jones, Chris Cock, Dana Vespoli, Darwin Slimpoke, Isiah Maxwell, Jake Jace, John Strong, Jovan Jordan, Marcus Bay\r\n\r\nCategories: Airtight, Anal, Behind The Scene, Big Tits, Black, Blowbang, Blowjob, Brunette, Cum swallow, Cunilingus\r\n\r\nDescription: Stylish pornographer Jonni Darkko loves contrasting elegant beauty with graphic gutter filth. Glamorous, freaky Adriana Chechik so perfectly fits the ethic that Darkko has dedicated an entire movie to her utter debasement: 'Adriana Chechik The Ultimate Slut' presents four marathon scenes of spit-, sweat- and semen-drenched debauchery. Petite, natural-bodied Adriana kneels among seven surging hard-ons for a worshipful blow bang. The dudes collect spit and lube in a bowl, funnel it up her ass, and after her butthole belches it out, she eats the slop! A bukkake-style climax masks her pretty face. Studs Toni Ribas, Mick Blue and John Strong stretch Adriana's bald cunt in a lewd double vaginal fuck; they double-penetrate her and work her over in a double anal slam! Sexy Dana Vespoli and voluptuous Roxy Raye join Adriana for a kinky lesbian threesome with massive toys and quarts of thick, syrupy lube that looks like elephant cum! A rude, steel speculum opens Adriana's ass; the ladies tongue Adriana's prolapsing, crimson colon, and Roxy's gigantically gaping bunghole loudly farts gushers of gunk for the other sluts to chow down. Eight thick pricks manhandle Adriana in a 60-minute interracial gang bang with rough, double anal plowing, multiple facials and angrily blooming innards!\r\n\r\nScreenshots:\r\n~~~~~~~~~~~~ \nhttp://www.picturevip.com/x/clean/JyF\r\n \nhttp://www.picturevip.com/x/clean/JyI\r\n \nhttp://www.picturevip.com/x/clean/Jym\r\n \nhttp://www.picturevip.com/x/clean/Jyo\r\n\r\nVideos Info:\r\n~~~~~~~~~~~~\r\nSize: 6.315 GB\r\nResolution: 1280x720","torrent":{"xt":"urn:btih:4819c51c2c571a67adf64aefd51bac3ff50a622c","amp;dn":"Adriana+Chechik+-+The+Ultimate+Slut+%28Split+scenes%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4819c51c2c571a67adf64aefd51bac3ff50a622c","infoHashBuffer":{"type":"Buffer","data":[72,25,197,28,44,87,26,103,173,246,74,239,213,27,172,63,245,10,98,44]},"announce":[],"urlList":[]}}