{"title":"Rosetta 1999 DVDRip Sonata Premiere","uid":7742347,"size":732493957,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:48560e587dfed3bc936151f00bb50bb3315f8759&amp;dn=Rosetta+1999+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"klinho","files":4,"time":1350660772,"description":"From the directors of the critically acclaimed La Promesse (1996) comes this stark portrayal of a young woman coming of age at the edge of social oblivion. Rosetta (Ã‰milie Dequenne) lives in a tiny, beat-up trailer without toilets or running water with her alcoholic, irresponsible, and utterly dispirited mother, who requires her frequent care. Rosetta longs to have a &quot;normal&quot; life and become a productive member of society, but even this modest goal seems beyond her grasp. Quietly terrified that she will slide into the abyss like her mother, she wages a desperate, purely instinctive battle to lift herself out of her wretched, semi-feral existence. At the film's outset, she is bodily removed from her job at a food factory; for much of the rest of the film, her attempts to gain employment are thwarted by the callousness and indifference of others. The only person to show any kind of sympathy is Riquet (Fabrizio Rongione), who ekes out a pittance at a waffle stand while secretly skimming profits from his boss. Though his awkward attempts to gain her interest go unacknowledged by the barely socialized Rosetta, the two develop something like a friendship. Later in the movie, however, her loyalty to her new-found friend clashes with her all-consuming desire for a job. First-time actress Dequenne, who spent time in a similarly harsh environment to prepare for the role, won the Best Actress prize at the 1999 Cannes Film Festival. This film also won the coveted Palme d'Or at Cannes and was screened at the 1999 Toronto Film Festival. ~ Jonathan Crow, Rovi\n\n\nSubs srt: English / Portuguese / Spanish","torrent":{"xt":"urn:btih:48560e587dfed3bc936151f00bb50bb3315f8759","amp;dn":"Rosetta+1999+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48560e587dfed3bc936151f00bb50bb3315f8759","infoHashBuffer":{"type":"Buffer","data":[72,86,14,88,125,254,211,188,147,97,81,240,11,181,11,179,49,95,135,89]},"announce":[],"urlList":[]}}