{"title":"MTCDC-NMC 36 DC from Po-Rd (joshua13","uid":6680709,"size":14444033362,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:4969964555cfdad2c6f8faf5fd0117ef2a91f198&amp;dn=MTCDC-NMC+36+DC+from+Po-Rd+%28joshua13&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"joshua13","files":-1,"time":1316182901,"description":"The More than Complete DC-Now More Completerer!\n\nThis thirty-sixth alphabetical installment is: DC from Our Po-Rd\n\nWhat's This?\n     It's a project to upload everything that's been scanned that DC ever published or distributed, whatever name was on the cover. That's DC, Vertigo (ugghh!)Ã‚Â®, Wildstorm, Helix, Milestone, Minx, Paradox, Piranha, Tangent, America's Best Comics, Cliffhanger, CMX, Homage, Humanoids, and MC.Gaines among others.\n       Plus, for characters and titles DC picked up from other companies, as much of those &quot;Pre-DC&quot; comics as I can find. This includes many major and minor DC superheroes, war comics, romance comics and various licensed characters such as Tarzan, Star Trek, Loony Toons, Scooby-Doo etc. A few of the heros include Shazam!, Blue Beetle, Plastic Man, Gen13, The Web, The Shield, Phantom Lady, Captain Atom and many more. There may be a lot of things you didn't know started with a different company. There will some &quot;Post DC&quot; comics of characters like Fallen Angel that have moved on. But that will be arbitrarily selective on my part. Assorted related material will be included. It's going to be c.875-885gb in total. It will take as long as it takes. I've already done a 600+gb subset of this in an earlier project (MTCDC). So clearly, I'm insane, which is what you look for in a guy promising this. So here we go again, but bigger.\n\n\n=================================\n\nKeywords from the paragraphs below, in order of occurrence ( I am not making this up. ) Plastic, breasts, shazam! girl(s), porn, creepy. There seems to be almost some sort of story there.\n\n=================================\n\nToday's offering:  DC from  DC from Our Po-Rd\n\n\nEnjoy!\n\n\nPoint Blank 01-04 (WS(2002-2003)\n\n     Police Comics is the original home of Plastic Man, who also had his own Quality Comics title before his DC days. His last appearance in PC is #112, but I thought it best to include the remaining scanned issues because, I like to put up whole series as much as possible. It's definitely a boon to collectors.\nMany fiche scans were replaced by paper since last time I did the MTCDC. Some unscanned issues were scanned as well. This is a much better collection of this series.\n\nPolice Comics 001-127(i) (Quality(1941-1953)\n\nMillennium Edition 040-Police Comics 001 - reprint of PC#1\n\nPossessed, The 01-06 (WS(2003-2004)\n\nPower Company\n     The Power Company 01-18 (2002-2003)\n     The Power Company Advertisement (2002)\n     The Power Company Bork (2002)\n     The Power Company Josiah Power (2002)\n     The Power Company Manhunter ctc\n     The Power Company Saphire (alt) (03-2002)\n     The Power Company Sapphire ctc\n     The Power Company Skyrocket ctc\n     The Power Company Striker Z ctc\n     The Power Company Witchfire ctc (03 2002)\n\nIt's time to talk comic breasts.\n     Power Girl  is remarkable in recent years for her very large chest with the cutout costume to show it off.. Aside from the general trend of female comic heroes having enormous breasts and as little clothing as possible - apparently in a purely artistic no-commercial move by the creators and publishers, there are a couple of anecdotes about this with Power Girl.  Before I get to that let me share this. I once showed the over of an alternate earth Batwoman/Superwoman story to my wife and she just burst out laughing. You know you've gone to far when your characters's breasts are so huge they provoke laughter. I had to admit they looked rather ridiculous.\n     As for Power Girl, this revealing costume is actually addressed directly in the comics. Inside the DCU, she once explained  her  costume hole thusly to Superman &quot;The first time I made the costume, I wanted to have a symbol like you. I just... I couldn't think of anything. I thought eventually, I'd figure it out. And close the hole. But I haven't&quot;. (JSA: Classified #2) Some believe it was earlier implied or stated that she was just aggressively feminine and not afraid to show it, and this later quote was a minor retcon. Some fan edited version of the JSA statement has replaced her sad, forlorn  faced &quot;but I haven't&quot;  with a different 4 word quote which I will not repeat. It's juvenile. It is pretty funny, but it's juvenile and I have standards! (meaning I don't show in front of others how juvenile, gross, depraved and just plain sick-minded I really am inside, so even though this is mild, &quot;ribald&quot; humor by most standards go google it. Which would be easy if I told you what the phrase was. But you can find it. Some of you  know. I know you know.\n\tIn the real world, there are obvious reason why the artist/editors choose to do this, but one story that goes around (and I fell for it)  that one of her artists kept drawing her bigger and bigger to see how far he could go before the editor called a halt. This story in not authenticated by anyone in the know, or the artist, Wally Wood. Even if he did say it, it must have been a jokes the actual drawings do not support this &quot;growth theory&quot;\n\nPower Girl\n     Power Girl TPB (2006)\n     Power Girl v1 01-04 (1988)\n     Power Girl v2 01-27 (2009-2011)\n     Power Girl-48 amateur &amp; pro drawings\n\nPower Lords 01-03 (1983-1984)\n\n     Shazam!  - will always be Captain Marvel to me, but because Marvel started using the name while he went unpublished fro many years, DC could not use it when they brought him back. \nTo me naming him after his magic word seems just as odd as if the revived Green Lantern in the silver age had been called &quot;In brightest day&quot;. Of course I have no better ideas, but it's not my job. It was theirs.\n\nPower of Shazam!\n     The Power of Shazam 1,000,000\n     The Power of Shazam TPB (1994)\n     The Power of Shazam! 01-48 (1995-1999,2010)\n     The Power of Shazam! Annual 001 (1996)\n\nPower of the Atom 01-18 (1988-1989)\n\n     I looked for other comics featuring many of the people in this collection of DC comics, but in most cases they do not exist. This group from &quot;Our to Po-Rd&quot;  has  a lot of one shots and limited series of characters that have no wider existence. With Powerpuff Girls I succeeded, but they are not included here. I thought I found some PPG manga. I took a glance at it first, and i'm glad I did. I said I have standards but this goes way behind my &quot;sense of propriety&quot;  and concern that &quot;there are ladies present&quot;.  Lets's just say I have questions, given the age the PPGs are supposed to be, that some US jurisdictions might not be only too glad to indict me for distributing child porn if I had included them. Opinion differs as to whether drawings alone can violate the US statutes, but a man in my area was arrested just for writing unillustrated child porn. (I think the charges were later dropped.) It might not hold up in court - but if you get accused of that, you're pretty much screwed no matter if you are acquitted.\n\n     Personally I hate the Powerpuff Girls anyway. My daughter loved them. She had pictures of them on her walls. She had a board game with them. I saw more than I ever wanted to of them when she watched them on TV.  But here they are.\n     BTW this is another series where a bunch of issues have been scanned for the first time in the last year or so.\n\nPowerpuff Girls\n     Cartoon Network Starring 001-The Powerpuff Girls 001 40p (09-1999)\n     The Powerpuff Girls 001 (Burger King Edition)\n     The Powerpuff Girls 01-70(i) (2000-2005)\n     The Powerpuff Girls Double Whammy 001 (12-2000)\n     The Powerpuff Girls Movie Special\n     The Powerpuff Girls covers and misc art\n\nPray For Death Season 1 p01-p60 Zudacomics (DC Web(2007-2008)\n\nPreacher (Vertigo\n     Preacher 001 Special Edition cover\n     Preacher 001-Millennium Edition (2000)\n     Preacher 01-66 (1995-1996)\n     Preacher Flyer.jpg\n     Preacher Special-Cassidy-Blood &amp; Whiskey (1998)\n     Preacher Special-One Man's War ctc (1998)\n     Preacher Special-Saint of Killers 01-04 (1996)\n     Preacher Special-Tall in the Saddle-Ennis and Dillon (2000)\n     Preacher Special-The Good Old Boys ()8-1997)\n     Preacher Special-The Story of You-Know-Who 001 ctc (1996)\n     Preacher TPB covers\n     Preacher v1-Gone To Texas TPB-alternate cover.jpg\n     Preacher-Dead or Alive-The Collected Covers TPB\n     Preacher-Gone to Texas TPB extras (1996)\n\nPrelude to Infinite Crisis (2005)\n\n     Since I couldn't find &quot;presents&quot; (gifts) I give you the closest thing I could, a different horror Manga by the same author, &quot;School Zone&quot;. Look at the CMX covers. that is one creepy looking little girl.\n     Presents (CMX-covers only \n     Presents Author wrote this-School Zone-another horror manga\n\nPrez 01-05 (1973-1974)\nPrez 005-unpublished-Cancelled Comic Cavalcade\n\nPride &amp; Joy 01-04 (Vertigo(1997)\nPride of Baghdad (Vertigo(2006)\nPrimal Force 0 (10-1994)\nPrimal Force 01-14 (1994-1995)\nPrince-Alter Ego (Piranha Press(1991)\nPrincess Natasha 01-04 (2006)\nPrisoner, The (Shattered Visage) TPB (1990)\nProgramme, The 01-12 (WS(2007-2008)\nProject, The 01-02 (Paradox-covers only\n\nPromethea (ABC\n     Jess Nevins' Promethea Notes Web Archive.zip\n     Promethea 01-32 (ABC(1999-2005)\n     Promethea TPB covers\n     Promethea Timeline.txt\n     Promethea-Little Margie-From ABC Special\n\nPrometheus-New Year's Evil (02-1998)\nProposition Player 01-06 (Vertigo(1999-2000)\nPrototype 01-06 (WS(2009)\nPryzm-The Beginning-A Costly Peace TDK (Giveaway) ctc\nPsyba-Rats 01-03 (1995)\nPsycho (DC Covers onl-(Image TPB\nPulp Fantastic 01-03 V2K (Vertigo(2000)\nPulp Heroes, The Complete DCP Archive Edition\nPulp Heroes (DC Annuals 1997) Checklist.txt\nPunisher-Batman-Deadly Knights (1994)\nPuppet Makers 001 (Zudacomics-DC Web(2011)\nPush 01-06  (WS(2009)\nPsycho (DC-Covers only\nPsycho, The TPB (Image-Collecting the DC (Image\nQuest For Camelot (1998)\n\n     Yet another hero who began with another company. There's more of him scattered around this series. Wikipedia should give you a handy list of his comics if you are interested in what pre-dc stuff t look for.\n\nQuestion, The\n     Charlton Bullseye 005-Unpub Question-Annotated by Alex Toth (1967)\n     Charlton Bullseye 005-Unpub The Question (1975)\n     Charlton Bullseye v1 001-Blue Beetle &amp; The Question\n     Question-Poisoned Ground TPB-unscanned.jpg\n     Question-Zen and Violence TPB-unscanned.jpg\n     The Question Quarterly 01-05 (1990-1992)\n     The Question Returns (02-1997)\n     The Question v1 01-37 (1986-1990,2010)\n     The Question v1 Annual 01-02 (1988-1989)\n     The Question v2 01-06 (2005)\n     The Question v2 Extras\n\nQuitter, The TPB (Vertigo(2005)\nQuotable Sandman (Vertigo(2000)\nRaccoon Kids 52-64 (after Movie Town Animal Antics(1954-1957)\n\nRacer X (WS\n     Racer X (Now Comics\n     Racer X 01-03 (2000)\n\nRagman\n     Ragman v1 01-05 (1976)\n     Ragman v2 01-08 (1991)\n     Ragman-Cry of the Dead 01-06 (1993-1994)\n     Ragman-Suit of Souls 001 ctc (2010)\n     Ragman-The Essential Ragman v1-3 DCP Archive Edition\n\nRainbow Brite and the Star Stealer ctc (1985)\n\nRann-Thanagar\n     Rann-Thanagar Holy War 01-08  (2008)\n     Rann-Thanagar Holy War DCP Archive Edition 272p (2009)\n     Rann-Thanagar War 01-06 (2005)\n     Rann-Thanagar War-Infinite Crisis Special (2006)\n\nRat Catcher (2011) ctc\nRatchet &amp; Clank 01-05 (2010-2011)\n\nRay, The\n     Ray-In a Blaze of Glory-covers (1994)\n     The Ray v1 01-06 (1992)\n     The Ray v2 000 (10-1994)\n     The Ray v2 01-28 (1994-1996)\n     The Ray v2 Annual 001-Year One (1995)\n\nRazor's Edge-Warblade 01-05 (WS(2004-2005)\n\n\n========================================================================\n\nFeel free to post this to other sites if you know how and are so inclined\n\n========================================================================\n\nPlease Seed! Lots of people will start on the series months\nor even a year or two from now. You are their only hope to complete\ntheir downloads.\n\n=========================================================================\nThanks to the Scanners and editors, and thanks to the seeders, the\nanonymous folk that make the work of the scanners and uploaders multiply!\n=========================================================================\nUntil we once again don't actually meet,\n\nCordially,\n\n13\n\nYou can see my other torrents at \n\n\nd-e-m-o-n-o-id.me/files/?uid=1213225&amp;seeded=2\n\nor\n-h-3-3-t.com-/userdetails.php?id=72866\n\nor &lt;a href=&quot;\nhttp://thepiratebay.se/user/joshua13/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/joshua13/&lt;/a&gt;","torrent":{"xt":"urn:btih:4969964555cfdad2c6f8faf5fd0117ef2a91f198","amp;dn":"MTCDC-NMC+36+DC+from+Po-Rd+%28joshua13","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4969964555cfdad2c6f8faf5fd0117ef2a91f198","infoHashBuffer":{"type":"Buffer","data":[73,105,150,69,85,207,218,210,198,248,250,245,253,1,23,239,42,145,241,152]},"announce":[],"urlList":[]}}