{"title":"Downwell v1.0.64","uid":13328259,"size":49963683,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:49f5100c3c3509f70674008feaace0171001735e&amp;dn=Downwell+v1.0.64&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":1,"time":1453937503,"description":"Downwell is a curious game about a young boy venturing down a well in search of untold treasures with only his Gunboots to protect him. \r\n\r\nMake your way further and further down into the darkness filled with nasty creatures and mysterious secrets to collect the spectacular red gems scattered about the rocks. \r\n\r\nStep into precariously placed shops and buy some helpful items or level up between levels to battle well-dwelling monsters and uncover hidden caves filled with riches and relics. No two trips down the well are ever the same!\r\n\r\nSimple, Responsive Controls - Designed for mobile from the ground up, Downwell is presented with intuitive and elegant controls that allow for action-packed gameplay using just three buttons.\r\n\r\nThe Amazing Gunboots - The fashionable and lethal Gunboots allow players to unleash a torrent of firepower on the nasty creatures dwelling in the well and slow your decent with each shot.\r\n\r\nUnique Weapons &amp; Items - Get different weapons, shop for peculiar items and obtain powerful upgrades that all stack and affect the way you play!\r\n\r\nA New Adventure Every Time - Each level in Downwell is procedurally generated, so no two trips down the well are ever the same providing a fresh new adventure each time!\r\n\r\nMore info:\r\n \nhttps://play.google.com/store/apps/details?id=com.devolver.downwell","torrent":{"xt":"urn:btih:49f5100c3c3509f70674008feaace0171001735e","amp;dn":"Downwell+v1.0.64","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49f5100c3c3509f70674008feaace0171001735e","infoHashBuffer":{"type":"Buffer","data":[73,245,16,12,60,53,9,247,6,116,0,143,234,172,224,23,16,1,115,94]},"announce":[],"urlList":[]}}