{"title":"Robert M. Pirsig - Zen and the Art of Motorcycle Maintenance","uid":4895625,"size":429768601,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4a547958c0f8c59ad77cc8de3836fdd5dd3c3276&amp;dn=Robert+M.+Pirsig+-+Zen+and+the+Art+of+Motorcycle+Maintenance&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ill88eagle","files":-1,"time":1242312199,"description":"Zen and the Art of Motorcycle Maintenance: An Inquiry into Values by Robert M. Pirsig, Read by Michael Kramer\nAudiobook | Books on Tape, Inc. | 32 Chapters | Abridged | ISBN: 0736685243 | MP3 44100 Hz 64 kbps | 21 Files \n\nOne of the most important and influential books written in the past half-century\n\n\nThe extraordinary story of a man's quest for truth. It will change the way you think and feel about your life The cycle you're working on is a cycle called 'yourself,' Robert M. Pirsig says. The study of the art of motorcycle maintainence is really a study of the art of rationality itself. Working on a motorcycle, working well, caring, is to become part of a process, to achieve an inner peace of mind. The motorcycle is primarily a mental phenomenon. The book details a cross-country motorcycle trip by a man and his 11-year-old son, as well as his quest for truth.\n\n\nReview from amazon.com:\n\nOver 2000 Years of Wisdom in 373 Pages, May 2, 2000\nBy \tWalter V. Cicha &quot;Cichacech&quot;\nIn my (1/e)*100 years on this planet, during which I devoured at least ten times as many books, I have read only two more than once - &quot;Zen and the Art of Motorcycle Maintenance&quot; is one of them. In this monumental 1974 work, Robert Pirsig has achieved what few others have managed before him and, to the best of my knowledge, nobody else has accomplished since: a perfect unification of philosophy, adventure and mystery. His &quot;Chautauqua,&quot; or traveling tale, takes the reader on a profound tour of ancient Greek philosophy, the steppes of Montana, and even a little bit of Zen Buddhism, with endless surprises and much original if not truly inspired thought along the way. Through his self-portrayal by means of the unforgettable and eerily enigmatic character Phaedrus, Mr. Pirsig shares his far-reaching search for the meaning of life, and himself. His fundamental concern is with the following seemingly simple but in effect infinitely complex question: &quot;How can one distinguish &quot;good&quot; from &quot;bad?&quot; The question is posed and addressed in many different forms throughout the book, and in the process the concepts of truth, value and quality are dissected, reassembled, and again dissected and reassembled many times. Mr. Pirsig has an uncanny sense of timing, and he never allows the heavier passages to labor on too long. This is avoided by craftily interspersing his philosophical discourse amongst very down-to-earth and charming observations made during a motorcycle trip that takes the narrator and his seemingly troubled son Chris from the American Prairies to the Pacific, and forms the prevalent background for the entire &quot;Chautauqua.&quot; &quot;Zen and the Art of Motorcycle Maintenance&quot; is a totally unique creation. Not being one to lend himself easily to corny clichÃƒÆ’Ã‚Â©s, I nevertheless believe that this is one book that definitely could dramatically change your life, whether or not you believe in Zen or have ever sat on a motorcycle. If you love somebody, buy them this book.\t\n\n","torrent":{"xt":"urn:btih:4a547958c0f8c59ad77cc8de3836fdd5dd3c3276","amp;dn":"Robert+M.+Pirsig+-+Zen+and+the+Art+of+Motorcycle+Maintenance","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a547958c0f8c59ad77cc8de3836fdd5dd3c3276","infoHashBuffer":{"type":"Buffer","data":[74,84,121,88,192,248,197,154,215,124,200,222,56,54,253,213,221,60,50,118]},"announce":[],"urlList":[]}}