{"title":"Marvel September 1997","uid":4278915,"size":601016746,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:4aa9adfa7aea1b9dbc72626cbf8793ce8d297d43&amp;dn=Marvel+September+1997&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MarvChronoCoop","files":54,"time":1215315394,"description":"\n\n                             Marvel September 1997 \n                             Torrent Release Notes \n\n\nThis torrent contains comics published by Marvel with a cover date of September 1997. \n\nNew titles for the month are Gambit, Marvel Team-Up v2, Maverick v2, Venom: Sign of the Boss, and the one-shot Strong Guy Reborn. Conan: Stalker of the Woods takes this month off before finishing up next month. And What If? v2 reaches the venerable 100th issue stage. Nothing concludes its run this month. \n\nA few notes on how this was compiled: It started with fordor&amp;#039;s collection for the month (thank you fordor). Each issue was checked for errors, cover date and completeness. Filenames were altered accordingly and normalized. Where possible scans from the Official Marvel DVD set replaced the earlier versions (thank you Citaltras). \n\nA general search was made to locate either higher quality or c2c scans for all comics issued during the month. \n\nSearches were performed at Comic Book DB, at The Unofficial Handbook of Marvel Comics Creators and at CBDB. Marvel Age and/or Marvel Visions were also reviewed, depending on the month in question. Copies of the available issues were added to the collection. The proto-torrent was then made available to a group of editors and reviewers for comment and any resulting issues were addressed. \n\nThis month there is a fill sub-directory for July 1997 upgrades, as well as a bonus sub-directory. The bonus folder contains a few things encountered while compiling the collection that don&amp;#039;t belong in the main set. The July 1997 Fill directory contains an uncorrupted version of Beast 003 submitted to replace the issue posted in the Marvel Comics 1997 July torrent. \n\nThese are the September Marvel titles missing from the collection: \n[list] \n\nThe Further Adventures of Cyclops and Phoenix (TPB) \nMarvel Vision 021 \nGolden Age of Marvel (TPB) \nSpider-Man Cybercomic issues 058-061 were released in September \n\n\nFrom the Panini Reprint line (UK) \nThe Astonishing Spider-Man 025 \nEssential X-Men 025 \nWolverine Unleashed 012 \n\nStan&amp;#039;s Soapbox Stuff: \nFrom his soapbox Stan explained the delay in starting the Excelsior line of comics was because of his movie commitments. Under that name the launch never happened. \n\nThe live action TV series Conan the Barbarian began this month. In it Conan was re-envisioned as a muscle bound Robin Hood fighting to free his homeland. Marvel wasn&amp;#039;t involved (they are probably grateful for that). This is one of the shows that helps to define bad TV. \n\nFrom the MCC Mailbag: \nAlthough time constraints will prevent responding individually to comments and PMs, thank you for all the supportive words and messages, they are very much appreciated. Here are answers to the questions received since the last posting. \n\nBy far the most popular query was: &quot;Are you going to finish it?&quot; \nHope so, but only time and your continued interest will tell. \n\nThe number two question was: Where are the numbers? \nUnlike the DC Chronology, there is no external numerical system for Marvel to use as a reference. This makes any numbering system used for Marvel an ad hoc invention of the torrent creator. \n\nA simple system like adding sequence numbers to an alphabetical ordering by month doesn&amp;#039;t add information to the torrent (and in fact makes correcting mistakes, sorting, or identifying duplicates in a collection more difficult). \n\nA more complex numbering system, that would order books based on Marvel universe time continuity is well beyond the scope of this project. Therefore, no sequence numbers will be pre-pended to these filenames. \n\nAnd finally, to address another recently repeated question: \n\nThe Marvel Chronology Cooperative is not affiliated with any poster/group, under any name, on any site. The MCC endorses no opinions on any subject; the MCC uploads torrents of Marvel releases, by month, with no allegiance to any other agenda. The MCC makes no statements, only torrents, which speak for themselves. Please enjoy downloading and listening. \n\nAnd now, some requests: \n\nIf you have any interesting Marvel related information for a particular month in time, please PM the details. It may be included in a future torrent release notes issue. [/li] \n\nIf you locate a better quality scan of any issue, or when you find one of the errors, please send a PM with a pointer so it can be fixed in a future release. \n\nIf you have (or know where to find) any of the Marvel online cybercomics (originally an AOL exclusive) from the late 90s, please make them available to the community (either through this project or as an independent posting). \n\nA sincere thank you is owed to the legion of writers, artists, scanners, &amp; uploaders who made this possible. And to you, the downloader: \n\nThank you, Good Night and Good Luck \n\nNext up: October 1997. \n","torrent":{"xt":"urn:btih:4aa9adfa7aea1b9dbc72626cbf8793ce8d297d43","amp;dn":"Marvel+September+1997","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4aa9adfa7aea1b9dbc72626cbf8793ce8d297d43","infoHashBuffer":{"type":"Buffer","data":[74,169,173,250,122,234,27,157,188,114,98,108,191,135,147,206,141,41,125,67]},"announce":[],"urlList":[]}}