{"title":"O OLHO DE HORUS-EL OJO DE HORUS-DUBLADO","uid":4020107,"size":4396776748,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4afff05e07291811ddef9246cd08aa823673371b&amp;dn=O+OLHO+DE+HORUS-EL+OJO+DE+HORUS-DUBLADO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fjtheo","files":13,"time":1202621520,"description":"O OLHO DE HORUS:EL OJO DE HORUS\nEM 10 CAPITULOS : DIVX\nAUDIO: PORTUGUES BR\nLANCAMENTO: 2000 &lt;a href=&quot;\nhttp://www.fernandomalkun.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fernandomalkun.com/&lt;/a&gt;\n   \nDescreve algumas piramides e seus significados, sao 10 capiÃƒÂ­tulos ao todo, \nsendo os principais: 5 e 6 que se referem a piramide escalonada construida por Imotep considerado Hermes. \n   \nEssa piramide esta em Sacara no Egito, os sacerdotes a consideravam a chave para acelerar a evolucao humana, contatar seres de outras dimensoes, amplificar o campo do poder mental, permitindo que cheguem a caminhos superiores da realidade que ainda nao percebemos, e possÃƒÂ­vel fazer comunicacao e receber a informaÃƒÂ§ÃƒÂ£o, utilizam a energia do pensamento, a energia taquionica que se move mais rapido do que a luz. \nA construcao da piramide era com pedras intercaladas nas quinas e \nperfeitamente acopladas, sem nenhum vao. Ha uma piramide do nivel do chao para o ceu e uma menor dentro dela e ha uma piramide invertida, ou seja, do nivel do chao para baixo. E tinha o significado de conhecer primeiro o interno e depois o externo. Tambem tinha o significado de: &quot;assim como ÃƒÂ© em cima ÃƒÂ© em baixo&quot;\n   \nAo redor dessa piramide ha muro com fios de outro, no filme mostra que moviam pedras gigantes, com um tipo de energia como se faz com o trem do Japao, as pedras levitavam, nao era magia, era algum tipo de energia. \n   \nNum dos filmes ha uma esfinge que existe no Egito, e um corpo com cabeca de leao, servia como referencia de tempo, para saber as horas. \n   \nO filme traz muitas informaÃƒÂ§ÃƒÂµes e seria necessario ve-lo novamente, para dar mais detalhes.\n\n\nFernando Malkun\n1970 Bachiller, Colegio San Jose Barranquilla, Colombia \n1976 Arquitecto, Universidad de Los Andes, Bogota, Colombia \n2003 Discipulo, Universidad del Amor, Gerardo Schmedling, Bogota, Colombia\n","torrent":{"xt":"urn:btih:4afff05e07291811ddef9246cd08aa823673371b","amp;dn":"O+OLHO+DE+HORUS-EL+OJO+DE+HORUS-DUBLADO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4afff05e07291811ddef9246cd08aa823673371b","infoHashBuffer":{"type":"Buffer","data":[74,255,240,94,7,41,24,17,221,239,146,70,205,8,170,130,54,115,55,27]},"announce":[],"urlList":[]}}