{"title":"Shinedown - Second Chance","uid":4932745,"size":127850500,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4bde858a914609069c0df7275ffa40e56336d1e1&amp;dn=Shinedown+-+Second+Chance&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1244115539,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Second Chance&quot; is the second single by the rock band Shinedown from their 2008 album The Sound of Madness. It was released on September 9, 2008. The song has been used in promotion for the second season of Terminator: The Sarah Connor Chronicles. It was also used in the 2008 WWE Tribute To The Troops show. It does not feature on the UK release of The Sound of Madness. In May 2009, the song was used in a promo regarding the return of character Michael Corinthos on ABC's daytime drama General Hospital.\n\n&quot;Second Chance&quot; is Shinedown's biggest hit to date, becoming their first song to top both the Mainstream and Modern Rock charts, as well as their first top twenty hit on the Billboard Hot 100. It's their third single to top the Mainstream Rock Tracks chart, having spent 10 weeks at #1 beginning December 27, 2008. On the Modern Rock Tracks chart, it is their first #1 single, having spent three non-consecutive weeks at #1 beginning February 14, 2009. As of May, 2009 edition of Billboard, &quot;Second Chance&quot; has reached #14 on the Hot 100, making it the band's first Top-20 hit. It's also their debut single on the Canadian Hot 100 chart, where it peaked at #42. It's also their first single to debut on the Hot Adult Top 40 Tracks chart at #17. On March 29, 2009, Second Chance debuted at #20 on the VH1 Top 20 Video Countdown, becoming their first video to ever debut on the show, and on May 16, Second Chance hit #1; Brent &amp; Barry, the guests on the show at the time, introduced it themselves.\n\nThe Sound of Madness is the third studio album by American hard rock band Shinedown, released June 24, 2008. The album's lead single, &quot;Devour&quot;, was released to radio on May 5, 2008.\n\nThe album's lyrics explore diverse subject matter as opposed to their previous albums; &quot;Devour&quot; ventures into political territory while &quot;What a Shame&quot; tells a story about lead singer Brent Smith's uncle, who died during the recording of the album. The song &quot;If You Only Knew&quot; is about Smith's wife (then-girlfriend) and newborn child.\n\nShinedown's tour to support the album subsequently started with the band playing a few festival shows before the release of The Sound of Madness.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:4bde858a914609069c0df7275ffa40e56336d1e1","amp;dn":"Shinedown+-+Second+Chance","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4bde858a914609069c0df7275ffa40e56336d1e1","infoHashBuffer":{"type":"Buffer","data":[75,222,133,138,145,70,9,6,156,13,247,39,95,250,64,229,99,54,209,225]},"announce":[],"urlList":[]}}