{"title":"Stencyl  2.1.0. free game creation software","uid":8992647,"size":66543201,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4c28622e2104904c482be78bc6d9703f9efeaee6&amp;dn=Stencyl++2.1.0.+free+game+creation+software&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"reddemonflame","files":5,"time":1380824231,"description":" &lt;a href=&quot;http://www.stencyl.com/stencyl/overview/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.stencyl.com/stencyl/overview/&lt;/a&gt;\n\nDesign Once, Play Anywhere\nPublish to all the major platforms without code\n(but you can if you want!)\n\t\nGame Studio in a Box\n\nStencyl isn't your average game creation software; it's a gorgeous, intuitive toolset that accelerates your workflow and then gets out of the way. We take care of the essentials like physics and native APIs so you can focus on what's important - making your game yours.\n\n\t\nPublish Everywhere\n\nWith extensive platform support, you can rest assured that players will have access to your game no matter where they are. Today, we officially support:\n\n    Flash\n    iOS\n    Android*\n    Windows\n    Mac\n    HTML5*\n\n\n\t\nMake #1 Games\n\nStencyl games have reached top slots in the App Store, including Impossible Pixel (#2 in US) and BLiP (#1 in 18 countries). Your game could be next!\n\nDesign is a &quot;Snap&quot;\n\nOur drag-and-drop gameplay designer pays homage to the successful MIT Scratch project. We extend Scratch's simple block-snapping interface with new functionality and hundreds of ready-to-use blocks, including special blocks for native mobile features.\n\nPower users can create and share their own blocks, import existing code libraries and create custom classes that interact seamlessly with block-based Behaviors.\n\nThose who prefer to code may write code to create complex behaviors or extend the engine with additional functionality.\nMake Money\nRealize your game's full potential\n\t\nSell Your Game\n\nSelling your game on the App Store, Google Play or alternate stores such as Steam &amp; Chrome Web Store is a time-tested way to make money and reach millions of potential players. Several Stencyl games have placed in the top 5 slots on the App Store.\n\n\t\nSeek a Sponsorship\n\nSell rights to your game to a sponsor who will market the game on your behalf. Many Stencyl games have been proudly sponsored by big names (AppGratis, ArmorGames, Kongregate, Newgrounds) and small names alike.\n\nSponsorships can fetch anywhere from $500 - $10,000 depending on the quality of the game and the terms.\n\n\t\nGo Freemium\n\nGames that wish to adopt a &quot;freemium&quot; model can use in-app purchases to provide unlockable levels &amp; content. In addition, games can embed ads to supplement their revenue. We support iAds (iOS) and AdWhirl (Android) for mobile games, and for web games, we support Mochi, Newgrounds and CPMStar.\n\nImpossible Pixel, a Stencyl-powered game, reached #2 on the US App Store in February 2013.\n(Impossible Pixel, #2 in the US App Store, February 2013)\n","torrent":{"xt":"urn:btih:4c28622e2104904c482be78bc6d9703f9efeaee6","amp;dn":"Stencyl++2.1.0.+free+game+creation+software","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c28622e2104904c482be78bc6d9703f9efeaee6","infoHashBuffer":{"type":"Buffer","data":[76,40,98,46,33,4,144,76,72,43,231,139,198,217,112,63,158,254,174,230]},"announce":[],"urlList":[]}}