{"title":"Laser-Induced Breakdown Spectroscopy - Theory and Applications.p","uid":11469189,"size":17513558,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4c82c652735ed23c06b9363375e9171dff0c1e71&amp;dn=Laser-Induced+Breakdown+Spectroscopy+-+Theory+and+Applications.p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"interuniversal","files":1,"time":1416065437,"description":"Laser-Induced Breakdown Spectroscopy - Theory and Applications\n\nAuthors: Sergio Musazzi - Umberto Perini\n\nISBN: 9783642450853\n\nPublisher: Springer\n\n\nProvides readers with numerous examples of state-of-the-art applications with an almost complete scenario of the LIBS technique potentiality\nReviews the LIBS theoretical aspects\nHelps readers who are less familiar with the technique to understand basic principles\nIncludes examples of applications that may have strong impact on future industrial utilization (e.g. on line analysis of coal elemental composition)\n\nThis book deals with the Laser-Induced Breakdown Spectroscopy (LIBS), a widely used atomic emission spectroscopy technique for elemental analysis of materials. It is based on the use of a high-power, short pulse laser excitation. The book is divided into two main sections: the first one concerning theoretical aspects of the technique, the second one describing the state of the art in applications of the technique in different scientific/technological areas. Numerous examples of state of the art applications provide the readers an almost complete scenario of the LIBS technique. The LIBS theoretical aspects are reviewed. The book helps the readers who are less familiar with the technique to understand the basic principles. Numerous examples of state of the art applications give an almost complete scenario of the LIBS technique potentiality. These examples of applications may have a strong impact on future industrial utilization. The authors made important contributions to the development of this field","torrent":{"xt":"urn:btih:4c82c652735ed23c06b9363375e9171dff0c1e71","amp;dn":"Laser-Induced+Breakdown+Spectroscopy+-+Theory+and+Applications.p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c82c652735ed23c06b9363375e9171dff0c1e71","infoHashBuffer":{"type":"Buffer","data":[76,130,198,82,115,94,210,60,6,185,54,51,117,233,23,29,255,12,30,113]},"announce":[],"urlList":[]}}