{"title":"Magill's Choice Ancient Greece","uid":11737483,"size":14083799,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4deda25642176a48d96a5266d2bd720121631e41&amp;dn=Magill%27s+Choice+Ancient+Greece&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425615053,"description":"This title offers A-Z coverage of more than 300 major personages, wars, political and cultural subjects from Greece. &quot;Ancient Greece&quot; is an A-Z survey of Greek history, culture, and civilization, from its earliest archaeological remains until the Battle of Actium (31 B.C.E.), when Greek civilization merged with Roman to become Greco-Roman civilization. The more than 300 essays in this set include general overviews of art and architecture, daily life and customs, death and burial, education and training, government and law, language and literature, medicine and health, navigation and transportation, the performing arts, religion and ritual, science, settlements and social structure, sports and entertainment, technology, trade and commerce, war and weapons, women's life, and writing systems. Biographical entries cover statesmen, military leaders, writers, philosophers and performers. Descriptive entries examine works of literature, battles, and philosophical movements. Each entry includes a short list of additional resources for further study and a summation of the historical significance of the person, event, or topic. All three volumes contain a &quot;Complete List of Contents&quot;. Appendices include a time line, glossary, list of websites, list of literary works and list of historic sites. Three indexes provide multiple access to the text: Category Index, Personages Index, and Subject Index. Magill's Choice &quot;Ancient Greece&quot; is fully illustrated","torrent":{"xt":"urn:btih:4deda25642176a48d96a5266d2bd720121631e41","amp;dn":"Magill%27s+Choice+Ancient+Greece","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4deda25642176a48d96a5266d2bd720121631e41","infoHashBuffer":{"type":"Buffer","data":[77,237,162,86,66,23,106,72,217,106,82,102,210,189,114,1,33,99,30,65]},"announce":[],"urlList":[]}}