{"title":"The Triumph of Sociobiology (2001) by John Alcock","uid":10488708,"size":21778201,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4e1b2b77f32a4c93edcba708289d9c922fdd3d49&amp;dn=The+Triumph+of+Sociobiology+%282001%29+by+John+Alcock&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":-1,"time":1404516995,"description":"The Triumph of Sociobiology (2001) by John Alcock.pdf\n\nIn The Triumph of Sociobiology, John Alcock reviews the controversy that has surrounded evolutionary studies of human social behavior following the 1975 publication of E.O. Wilson's classic, Sociobiology, The New Synthesis. Denounced vehemently as an &quot;ideology&quot; that has justified social evils and inequalities, sociobiology has survived the assault. Twenty-five years after the field was named by Wilson, the approach he championed has successfully demonstrated its value in the study of animal behavior, including the behavior of our own species. Yet, misconceptions remain--to our disadvantage.\n\nIn this straight-forward, objective approach to the sociobiology debate, noted animal behaviorist John Alcock illuminates how sociobiologists study behavior in all species. He confronts the chief scientific and ideological objections head on, with a compelling analysis of case histories that involve such topics as sexual jealousy, beauty, gender difference, parent-offspring relations, and rape. In so doing, he shows that sociobiology provides the most satisfactory scientific analysis of social behavior available today.\n\nAlcock challenges the notion that sociobiology depends on genetic determinism while showing the shortcoming of competing approaches that rely on cultural or environmental determinism. He also presents the practical applications of sociobiology and the progress sociobiological research has made in the search for a more complete understanding of human activities. His reminder that &quot;natural&quot; behavior is not &quot;moral&quot; behavior should quiet opponents fearing misapplication of evolutionary theory to our species. The key misconceptions about this evolutionary field are dissected one by one as the author shows why sociobiologists have had so much success in explaining the puzzling and fascinating social behavior of nonhuman animals and humans alike.\n\n272 pages\nPublisher: Oxford University Press; 1St Edition edition (June 28, 2001)\nLanguage: English\nISBN-10: 0195143833\nISBN-13: 978-0195143836","torrent":{"xt":"urn:btih:4e1b2b77f32a4c93edcba708289d9c922fdd3d49","amp;dn":"The+Triumph+of+Sociobiology+%282001%29+by+John+Alcock","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e1b2b77f32a4c93edcba708289d9c922fdd3d49","infoHashBuffer":{"type":"Buffer","data":[78,27,43,119,243,42,76,147,237,203,167,8,40,157,156,146,47,221,61,73]},"announce":[],"urlList":[]}}