{"title":"Brutal Legend GOG","uid":8738692,"size":8237601387,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4e52fac2d2c075d38ea2b2c95326ddd1b6458dfd&amp;dn=Brutal+Legend+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"IAmsoICan","files":11,"time":1374730985,"description":"Genre: action / strategy / fantasy\nrelease date: October 13, 2009\ncompatible with: Windows (XP, Vista, 7, 8)\nlanguages: Audio and text: English, French, German, Spanish. Text only: Italian\ndeveloper / publisher: Double Fine Productions / Double Fine Productions\ngame modes: single-player\n\nBonus content included for FREE with purchase:\n3 wallpapers\n7 avatars\n15 concept arts\n57 artworks\n\nWhat's cool about it:\n\nYou have the freedom to walk, drive, or fly anywhere in a fully streaming open world whose art style is inspired by some of the most iconic and hilariously rad metal album covers ever created. Every vista in the beautiful universe of Brutal Legend looks like it was pulled from a Frank Frazetta painting.\nFight alongside Metal Gods--such as Lemmy Kilmister, Rob Halford, Lita Ford, and many, many others--while rocking out to the most epic heavy metal soundtrack in video game history.\nYour guitar is your weapon. Wield a demon-slaying, electricity-creating guitar and use the power of Metal to summon wild beasts into battle, buff your teammates, and melt faces!\n\nOverview:\n\nThe vivid and wildly creative world of Brutal Legend is brought to life through a spate of chrome, leather, rocker babes, epic music, fire-breathing/stud-wearing beasts, mountains made of guitar amps, and more. Follow Eddie as he embarks on a tour of epic destruction with an axe, a guitar, and his minions as he commands the power of rock in epic band battles. It's lighter-flicking awesomeness that will melt your face clean off.\n\nBrutal Legend is an action-adventure that marries visceral action combat with open-world freedom. Set in a universe somewhere between Lord of the Rings and Spinal Tap, it's a fresh take on the action/driving genre, which in this case is full of imitation cover bands, demons intent on enslaving humanity and Heavy metal tunes. Featuring the talents of comedian, actor and musician, Jack Black as super roadie Eddie Riggs, as well as cameos by some of the biggest names in metal music, it's a wild ride in the belly of the beast that is not to be missed!\n\nMultiplayer notice: The DRM free version of Brutal Legend is single-player only.\n\nAge requirements: ESRB Rating: MATURE with Blood and Gore, Intense Violence, Partial Nudity, Strong Language, Suggestive Themes. PEGI Rating: 18+ with Bad Language, Violence.\n\nMinimum system requirements: Windows XP / Vista / 7 / 8, Intel Core 2 Duo 2.5 GHz or Athlon X2 2.4 GHz processor or faster(Intel i5 Duo at 2.5 GHz, or AMD FX 3.5 GHz recommended), 1 GB RAM (2 GB RAM recommended), DirectX 9.0c-compatible video card with 512 MB VRAM, DirectX 9.0c-compatible sound card, 8 GB HDD, keyboard, mouse.\n\nInstallation\n\nInstall and play\n","torrent":{"xt":"urn:btih:4e52fac2d2c075d38ea2b2c95326ddd1b6458dfd","amp;dn":"Brutal+Legend+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e52fac2d2c075d38ea2b2c95326ddd1b6458dfd","infoHashBuffer":{"type":"Buffer","data":[78,82,250,194,210,192,117,211,142,162,178,201,83,38,221,209,182,69,141,253]},"announce":[],"urlList":[]}}