{"title":"Blazing Ice- Pioneering the Twenty-first Century's Road to the S","uid":11161731,"size":5913879,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4ea0e11b4a8052575b8130596febecf13b21a0d4&amp;dn=Blazing+Ice-+Pioneering+the+Twenty-first+Century%27s+Road+to+the+S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"gratefuldawg77","files":6,"time":1412558352,"description":"The Antarctic is the last vast terrestrial frontier. Just over a century ago, no one had ever seen the South Pole. Today odd machines and adventure skiers from many nations converge there every summer, arriving from numerous starting points on the Antarctic coast and returning some other way. But not until very recently has anyone completed a roundtrip from McMurdo Station, the U.S. support hub on the continental coast. The last man to try that perished in 1912. The valuable surface route from McMurdo remained elusive until John H. Wright and his crew finished the job in 2006.&quot;Blazing Ice&quot; is the story of the team of Americans who forged a thousand-mile transcontinental haul route across Antarctica. For decades airplanes from McMurdo Station supplied the South Pole. A safe and repeatable surface haul route would have been cheaper and more environmentally benign than airlift, but the technology was not available until 2000.As Wright reveals in this gripping narrative, the hazards of Antarctic terrain and weather were as daunting for twenty-first century pioneers as they were for Norway s Roald Amundsen and England s Robert Falcon Scott when they raced to be first to the South Pole in 1911 1912. Wright and his team faced deadly hidden crevasses, vast snow swamps, the Transantarctic Mountains, badlands of weird wind sculpted ice, and the high Polar Plateau.&quot;Blazing Ice&quot; will appeal to Antarctic aficionados, conservationists, field scientists, and adventure readers of all stripes.","torrent":{"xt":"urn:btih:4ea0e11b4a8052575b8130596febecf13b21a0d4","amp;dn":"Blazing+Ice-+Pioneering+the+Twenty-first+Century%27s+Road+to+the+S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ea0e11b4a8052575b8130596febecf13b21a0d4","infoHashBuffer":{"type":"Buffer","data":[78,160,225,27,74,128,82,87,91,129,48,89,111,235,236,241,59,33,160,212]},"announce":[],"urlList":[]}}