{"title":"Most Shocking - Season 1","uid":4006280,"size":2460184496,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4ee9c60be77c44ac303003ffcdbcb9d5d677b163&amp;dn=Most+Shocking+-+Season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Mr.MP4","files":13,"time":1201839538,"description":"Episode 1: High Speed Pursuits\nIn this episode of the ultimate &amp;#039;caught-on-camera&amp;#039; reality show, a runaway crook leads police on a surprising high-speed chase, a robber fires at police officers in a residential area and a fugitive steals the family RV, but his wild escape goes up in flames. All this plus a cop who has only one chance to successfully bring a crazed high-speed driver down. TV-14 V\n\n\nEpisode 2: Criminal Behavior\nIn this episode, drug suspects pull a gun on an officer and fire at point-blank range, a cop is ambushed by a drunken bar patron and then an armed man threatens a cashier at a grocery store. Will the store&amp;#039;s manager attempt to take matters into his own hands? Find out on this installment of the ultimate &amp;#039;caught-on-camera&amp;#039; reality show. TV-14 V\n\nEpisode 3: Wild Riots\nIn this episode of the reality show that is jam-packed with action-packed stories, there&amp;#039;s an NBA championship party at the Staples Center that threatens to erupt into a full-scale riot, a convicted murderer who goes berserk in court, and a metal band&amp;#039;s controversial song dedication that sends audience members into a violent frenzy. The &quot;Most Shocking&quot; part? It&amp;#039;s all 100% real. TV-14 V\n\n\nEpisode 4: Dangerous Drivers\nIn this episode, a mentally unstable man goes on a rampage in a dump truck and nearly crushes two children. Then, an officer making a routine traffic stop is blindsided by a passing vehicle. Plus, teens behind the wheel of a stolen car attempt to make a get-away but meet a brutal end with a semi. TV-14 V\n\n\nEpisode 5: Deadly Force\nIn this episode, an escaped convict runs cops off the road and finds himself exchanging bullets in a cemetery. Then, when a desperate fugitive refuses to surrender, a SWAT team has to take him down. Also, a violent crash puts an end to a chase but starts a furious gun battle with a teen.\n\n\nEpisode 6: Robberies &amp; Holdups\nIn this episode, a violent ex-con attacks an innocent customer at a restaurant and strikes again weeks later. Also, a thief with a mean thirst breaks in through the ceiling of a liquor store but bottoms out hard. Plus, gangsters armed with AK-47s open fire in a crowded jewelry shop. TV-14 L, V\n\n\nEpisode 7: Stopped By The Law\nThe stakes get high for police officers who find out that traffic stops are never routine.\n\n\nEpisode 8: Undercover Stings\nPolice officers go on the prowl to bust drug dealers and wanted criminals.\n\n\nEpisode 9: Under Siege\nPolice have to take life and death action to rid the streets of hostage-taking hooligans.\n\n\nEpisode 10: Criminal Behavior 2\nCrafty crooks and burglars go to the extreme to pull one over on the law.\n\n\nEpisode 11: Wild Riots 2\nTempers flare and fists fly in the most brutal brawls officers have ever seen.\n\n\nEpisode 12: High Speed Pursuits 2\nCrazed criminals take police on the wildest high speed pursuits ever caught on tape.\n\n\nEpisode 13: Stopped By The Law 2\nThe stakes get high for police officers who find out that traffic stops are never routine.\n\nMP4 so you can put it directly on your ipod, and mp4 saves lots of memory while being the same quality.\n\n","torrent":{"xt":"urn:btih:4ee9c60be77c44ac303003ffcdbcb9d5d677b163","amp;dn":"Most+Shocking+-+Season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ee9c60be77c44ac303003ffcdbcb9d5d677b163","infoHashBuffer":{"type":"Buffer","data":[78,233,198,11,231,124,68,172,48,48,3,255,205,188,185,213,214,119,177,99]},"announce":[],"urlList":[]}}