{"title":"TLC - Byzantium, the Lost Empire","uid":4255880,"size":153284,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:4f1f970ea6e3cad4f3e8bb8355437625d5af3a3a&amp;dn=TLC+-+Byzantium%2C+the+Lost+Empire&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BTMUF","files":6,"time":1214243215,"description":"For more than 1,000 years, the Byzantine Empire was the eye of the entire world the origin of great literature, fine art and modern government. Heir to Greece and Rome, it was the first Christian empire, spanning 11 centuries and three continents. In the end, plundered and sacked by invaders, Byzantium nearly became extinct.\n\nNow, after a year of filming on three continents, TLC unlocks this ancient region to uncover the great cultures that helped shape the Western world. Pass through the gates of Constantinople, the eye of the world, where East still meets West. Explore the magnificent mosque of Hagia Sophia. Visit the treasury of St. Mark&amp;#039;s in Venice and see antiquities never before filmed for television. You&amp;#039;ll be transported to a world that history has nearly forgotten. It&amp;#039;s a journey you won&amp;#039;t forget.\n\nHosted by noted historian John Romer.\n\n&quot;John Romer, the author and on-screen guide for the series, breathes life into the city and the powerful ideas that made the Byzantium a thriving cultural and commercial center while western Europe was slogging through the Dark Ages and the Middle Ages.\n\nAt its height, Byzantium housed the most precious Christian relics, including a piece of Christ&amp;#039;s cross. Located on the border of Europe and Asia, it ruled an empire that extended across Asia Minor and the Balkans. Then, after the rise of Islam, the empire shrank until little was left outside the city walls. Byzantium turned to Europe for help in fighting the infidels, only to have its own city sacked by the Crusaders whose help it sought. Venice, its erstwhile trading partner, carried off many of its artistic masterpieces.\n\nThe Hagia Sophia, originally built as a Christian church, became Istanbul&amp;#039;s most famous mosque. And the scholars who had kept alive the study of Greek for more than a millennium fled to Europe where they helped lay the groundwork for the Renaissance. Byzantium, the video, takes us on a visually sumptuous journey to key locations throughout the empire, while putting a human face on the key actors in the history of this unique and vital empire. I never suspected I would find this story as compelling as it turned out to be.&quot;\n-----------------------------------------------------------------------------------\n4 parts. Please note that this tracker contains four .torrents with the actual files. The seeds are tested and are properly working. Enjoy!","torrent":{"xt":"urn:btih:4f1f970ea6e3cad4f3e8bb8355437625d5af3a3a","amp;dn":"TLC+-+Byzantium%2C+the+Lost+Empire","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f1f970ea6e3cad4f3e8bb8355437625d5af3a3a","infoHashBuffer":{"type":"Buffer","data":[79,31,151,14,166,227,202,212,243,232,187,131,85,67,118,37,213,175,58,58]},"announce":[],"urlList":[]}}