{"title":"FlatOut 2 Portable - [Espera]","uid":6412933,"size":2639123811,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4f4c2697e420355ee5d58c8a9389336e83ff90bb&amp;dn=FlatOut+2+Portable+-+%5BEspera%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Arzanii","files":2,"time":1306059734,"description":"    //   / /                                            \n   //____     ___      ___      ___      __      ___    \n  / ____    ((   ) ) //   ) ) //___) ) //  ) ) //   ) ) \n //          \\ \\    //___/ / //       //      //   / /  \n//____/ / //   ) ) //       ((____   //      ((___( (   \n\n                     Presents\n\nINSTRUCTIONS\n1.Unrar\n2.Run &quot;REG1.exe&quot;\n3.Run &quot;FlatOut 2 - 1 Click.exe&quot;\n4.Enjoy\n\n\nWarning this is a PORTABLE verision of the game.\nAll portable versions brought to you by us most probably \nWILL NOT work with x64 versions of Windows, only with the x86 versions.\n\nFlatOut 2 is a racing video game developed by Bugbear Entertainment and published by Empire Interactive and Vivendi Universal Games. It is the sequel to the 2004-2005 release FlatOut.\n\nThis game is themed more on the street racing/import tuner scene than its predecessor. Another notable change is the tire grip; players can now take more control of their car, worrying less about skidding in tight turns. The game has three car classes: derby, race and street.\n\nIt was first released in Russia on June 29, 2006, then in Europe on June 30, 2006. The North American version was released August 1, 2006.\n\nOn October 3, 2008, A Mac OS X version was released by Virtual Programming. A playable demo is available from Apple's webpage.\n\nThe ragdoll physics in the sequel have been greatly updated. During the race, the driver may be thrown out of the car if slammed into a wall at a high speed. In the numerous Stunt minigames the goal is to shoot yourself out of the car and complete objectives like knocking down a set of bowling pins, hitting the designated spots on a dartboard, score a field goal or fly through flaming hoops. Players must use 'aerobatics' to control the driver in-flight, but overusing it will increase drag, which will slow the driver down and possibly prevent him/her from reaching the designated target. If the driver falls short of the target, players can use the &quot;nudge&quot;. This gives the driver a small upward boost and slightly reduces drag. In the Stone Skipping Stunt minigame, the players must use nudge just as the driver hits the surface of the water to skip the most efficiently and reach the furthest. There are unfortunately many glitches with this mode i.e. getting stuck in objects.\n\nWindows version:\n2.0 GHz Pentium 4 or AMD 2000+ CPU, 256 MB RAM, 1x DVD-ROM (CD-ROM for the US and Xplosiv releases) drive, 64MB Graphics Card supporting DirectX shader model 2, 3.5 GB free hard drive space, DirectX 9.0c, Windows 2000 SP4 or Windows XP SP2 or newer, 512kbs connection minimum for Internet play","torrent":{"xt":"urn:btih:4f4c2697e420355ee5d58c8a9389336e83ff90bb","amp;dn":"FlatOut+2+Portable+-+%5BEspera%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f4c2697e420355ee5d58c8a9389336e83ff90bb","infoHashBuffer":{"type":"Buffer","data":[79,76,38,151,228,32,53,94,229,213,140,138,147,137,51,110,131,255,144,187]},"announce":[],"urlList":[]}}