{"title":"Thomas Keating - The Contemplative Journey Volume 1","uid":11431301,"size":309544722,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:50b7caacd568b607bc21bcd247e0a94244b48f9c&amp;dn=Thomas+Keating+-+The+Contemplative+Journey+Volume+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_paddy","files":17,"time":1415727273,"description":"His teachings on Centering Prayer -- a path to God rooted in the &quot;Lost Christianity&quot; of medieval times -- has endeared Father Thomas Keating to many thousands of contemporary Christians. On The Contemplative Journey, Father Thomas teaches a brilliant synthesis of modern psychology and ancient spirituality, guiding listeners to the holy &quot;still point&quot; described in legendary Christians texts more than 600 years ago.\nWith The Contemplative Journey, Father Thomas -- author of the classics Open Mind, Open Heart; The Mystery of Christ; and Intimacy with God -- has created a long-awaited guide to the authentic tradition of Christian contemplation. In Centering Prayer, he explains, the listener engages beyond thinking, beyond emotions, connecting with God's infinitive love. Inherently and uniquely Christians, this &quot;divine therapy&quot; draws on a receptive meditation technique similar to those that have attracted many contemporary seekers to the Eastern mystical practices.\n\nThe Contemplative Journey is the fruit of Father Thomas' life as a devoted monastic, theologian, psychologist, and philosopher: a sweeping masterwork that points the way to the Christian ideal of unity with the divine.\n\n&quot;Profoundly human insights and classical spiritual, gems&quot;. -- Catholic Library World\n\nIncludes all MP3s and course PDF, and CD cover","torrent":{"xt":"urn:btih:50b7caacd568b607bc21bcd247e0a94244b48f9c","amp;dn":"Thomas+Keating+-+The+Contemplative+Journey+Volume+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50b7caacd568b607bc21bcd247e0a94244b48f9c","infoHashBuffer":{"type":"Buffer","data":[80,183,202,172,213,104,182,7,188,33,188,210,71,224,169,66,68,180,143,156]},"announce":[],"urlList":[]}}