{"title":"The Thirteenth Tale audiobook by Diane Setterfield EarReaders","uid":13192581,"size":225819529,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5141bb3fb7dd764a62c92b44cf540fdadc580395&amp;dn=The+Thirteenth+Tale+audiobook+by+Diane+Setterfield+EarReaders&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"jsk123","files":2,"time":1452454133,"description":"Written by Diane Setterfield \r\nFormat: MP3 \r\nUnabridged \r\n\r\nUnabridged version - I really liked this book! ^^\r\n\r\nBiographer Margaret Lea returns one night to her apartment above her father’s antiquarian bookshop. On her steps she finds a letter. It is a hand-written request from one of Britain’s most prolific and well-loved novelists. Vida Winter, gravely ill, wants to recount her life story before it is too late, and she wants Margaret to be the one to capture her history. The request takes Margaret by surprise — she doesn’t know the author, nor has she read any of Miss Winter’s dozens of novels.\r\n\r\nLate one night while pondering whether to accept the task of recording Miss Winter’s personal story, Margaret begins to read her father’s rare copy of Miss Winter’s Thirteen Tales of Change and Desperation. She is spellbound by the stories and confused when she realizes the book only contains twelve stories. Where is the thirteenth tale? Intrigued, Margaret agrees to meet Miss Winter and act as her biographer.\r\n\r\nAs Vida Winter unfolds her story, she shares with Margaret the dark family secrets that she has long kept hidden as she remembers her days at Angelfield, the now burnt-out estate that was her childhood home. Margaret carefully records Miss Winter’s account and finds herself more and more deeply immersed in the strange and troubling story.\r\n\r\nBoth women will have to confront their pasts and the weight of family secrets... and the ghosts that haunt them still","torrent":{"xt":"urn:btih:5141bb3fb7dd764a62c92b44cf540fdadc580395","amp;dn":"The+Thirteenth+Tale+audiobook+by+Diane+Setterfield+EarReaders","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5141bb3fb7dd764a62c92b44cf540fdadc580395","infoHashBuffer":{"type":"Buffer","data":[81,65,187,63,183,221,118,74,98,201,43,68,207,84,15,218,220,88,3,149]},"announce":[],"urlList":[]}}