{"title":"Paradise [Eng]","uid":5262210,"size":1485329389,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:517c86fae42863a7163d361f6d1bdb25f7a9b83d&amp;dn=Paradise+%5BEng%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"frank_pe","files":-1,"time":1262774787,"description":"From the creator of the award-wining series Syberia comes Benoit Sokal fascinating new work, Paradise. Sokal latest adventure game masterpiece is set in four different worlds in the heart of darkest Africa. From the arid lands of Madargane to the dense jungle of the Maurania River, the world is both primitive and contemporary. Fraught with political turmoil, the lush landscapes are beautiful and dangerous.\n\nYou play Ann Smith, a young woman suffering from amnesia struggling to make her way home and avoid the conflict surrounding her. To discover her true identity, she must escort a strange black leopard back to the land where it was born.\n\nFollow Ann through her journey as she finds clues to her identity and unravels the truth behind her mysterious past.\n\nUnparalleled artistry: Paradise presents a unique blend of a semi-realistic sub-Saharan world and an ethereal fantasy. Africa comes to life as a breathtaking visual experience. Both the cinematics and over 350 backgrounds include Sokal unique and visionary artistic direction.\n\nStoryline that plays like a movie:Ann Smith, a college student from Geneva, loses her identity and must journey through uncharted corners of Africa to unravel her past. How has Ann come to be in a place so wrought with turmoil? Why is her fate tied to that of a black leopard? Is Ann the daughter of a fierce dictator? Unlock those secrets and more as the story unfolds.\n\nSets the benchmark for adventure games to come: Puzzle solutions are seamlessly embedded into the story as players must interact with their environment and other characters to gain insight into clues that will help reveal Anns true identity and answer why shes in this strange African land.\n\nA touch of real-time 3D: Adding a new &quot;action&quot; element to the traditional slideshow style of play, the real-time 3D graphics take over as the player becomes the leopard, searching for a way home.","torrent":{"xt":"urn:btih:517c86fae42863a7163d361f6d1bdb25f7a9b83d","amp;dn":"Paradise+%5BEng%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"517c86fae42863a7163d361f6d1bdb25f7a9b83d","infoHashBuffer":{"type":"Buffer","data":[81,124,134,250,228,40,99,167,22,61,54,31,109,27,219,37,247,169,184,61]},"announce":[],"urlList":[]}}