{"title":"WordPerfect 5.1+","uid":3382147,"size":4652907,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:51c9286cba933391f4a325afb4871ccec83eebbe&amp;dn=WordPerfect+5.1%2B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tagidi","files":1,"time":1126491825,"description":"WordPerfect for DOS\n\nWordPerfect was originally produced by Satellite Software International, Inc. of Orem, Utah, which later renamed itself WordPerfect Corporation. Originally written for Data General minicomputers, in 1982 the developers ported the program to the IBM PC as WordPerfect 2.20, continuing the version numbering of the Data General series. The program's popularity took off with the introduction of WordPerfect 4.2 in 1986, with automatic paragraph numbering (important to the legal market), and the splitting of a lengthy footnote and its partial overflow to the bottom of the next page, as if it had been professionally typeset (valuable to the academic market). WordPerfect 4.2 became the first program to overtake the original market leader (WordStar) in a major application category on the DOS platform. In 1989, WordPerfect Corporation released the program's most successful version ever: WordPerfect 5.1 for DOS.\n\nWordPerfect used almost every possible combination of function keys with Ctrl, Alt, and Shift modifiers. This was in contrast to WordStar, which used only Ctrl, in conjuction with traditional typing keys. Many people still know the function key combinations from the DOS version, which were designed for the layout of the original 1981 IBM PC keyboard, with two columns of function keys at the left end of the keyboard. For example, the Tab key and the related F4 (Indent) functions were adjacent. This plethora of keystroke possibilities, combined with the developers' wish to keep the user interface free of &quot;clutter&quot; such as on-screen menus, made it necessary for most users to use a keyboard template showing each function. Infamously, WordPerfect used F3 instead of F1 for Help, F1 instead of Esc for Cancel, and Esc for Repeat (though a configuration option in later versions allowed these functions to be rotated to more standard locations).\n\nWordPerfect Corporation produced a variety of ancillary and spin-off products. WordPerfect Library (introduced in 1986) was a package of utilities that included a customizable memory-resident menu driven DOS shell called Shell, task switching (which allowed several programs to remain open and selectable by a hot-key combination under DOS), an open application interface (API) that other software developers could access, an advanced (for its time) macro processor, a Clipboard, a Calculator, a Calendar with a running to-do list and alarms, a flat-file database called Notebook that could be used by itself or in WordPerfect merges, and other features. LetterPerfect was a scaled down version of WordPerfect with the more advanced features removed but with file and (for the most part) keystroke compatibility.","torrent":{"xt":"urn:btih:51c9286cba933391f4a325afb4871ccec83eebbe","amp;dn":"WordPerfect+5.1%2B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51c9286cba933391f4a325afb4871ccec83eebbe","infoHashBuffer":{"type":"Buffer","data":[81,201,40,108,186,147,51,145,244,163,37,175,180,135,28,206,200,62,235,190]},"announce":[],"urlList":[]}}