{"title":"Strange Histories: The Trial of the Pig, the Walking Dead, and O","uid":6439561,"size":4653404,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:51cd3aff2bfd12d12b86c2925ba50e73cfd81250&amp;dn=Strange+Histories%3A+The+Trial+of+the+Pig%2C+the+Walking+Dead%2C+and+O&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Djofullinn","files":1,"time":1306941020,"description":"Strange Histories: The Trial of the Pig, the Walking Dead, and Other Matters of Fact from the Medieval and Renaissance Worlds\n\nDid you know that insects could be tried for criminal acts in pre-industrial Europe, that the dead could be executed, that statues could be subjected to public humiliation, or that it was widely accepted that corpses could return to life?\nWhat made reasonable, educated men and women behave in ways that seem utterly nonsensical to us today? Strange Histories presents for the first time a serious account of some of the most extraordinary occurrences of European history.\n\nThroughout the ages, people have held ideas and events have taken place which have baffled later societies. Religious disbelievers were thought deserving of death, insects were occasionally excommunicated, studying the biology of angels was a legitimate activity, and the pursuit of personal happiness was considered rather misguided as a life strategy.\n\nUsing case studies from the Middle Ages and the early modern period with some from the more recent past, this book provides fascinating insights into the world-view through the ages, and shows how such goings-on fitted in quite naturally with the &quot;common sense&quot; of the time. Explanations of these phenomena, riveting and ultimately rational, encourage further reflection on what really shapes our beliefs.\n\nIn the light of history, can we be sure of the validity of our own ideas? How many of our own beliefs might no longer &quot;make sense&quot; a few centuries from now? (Heres hoping for religion).\n &lt;a href=&quot;\nhttp://www.amazon.com/Strange-Histories-Walking-Medieval-Renaissance/dp/0415404924/ref=sr_1_1?ie=UTF8&amp;qid=1306933612&amp;sr=8-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Strange-Histories-Walking-Medieval-Renaissance/dp/0415404924/ref=sr_1_1?ie=UTF8&amp;qid=1306933612&amp;sr=8-1&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:51cd3aff2bfd12d12b86c2925ba50e73cfd81250","amp;dn":"Strange+Histories%3A+The+Trial+of+the+Pig%2C+the+Walking+Dead%2C+and+O","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51cd3aff2bfd12d12b86c2925ba50e73cfd81250","infoHashBuffer":{"type":"Buffer","data":[81,205,58,255,43,253,18,209,43,134,194,146,91,165,14,115,207,216,18,80]},"announce":[],"urlList":[]}}