{"title":"SetCPU for Root Users v3.1.0.Full","uid":8622212,"size":1710631,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:51e920862253d171b30ae483fcec1971a0903603&amp;dn=SetCPU+for+Root+Users+v3.1.0.Full&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"saifi2649","files":2,"time":1372406221,"description":"SetCPU for Root Users v3.1.0\n\nRequirements: Android OS 2.1+\n\nOverview: Supercharge your Android device with SetCPU. A must-have tool for root \n\nusers.\n\nSetCPU is a tool for changing the CPU settings on a rooted Android phone or tablet, \n\nincluding the Galaxy Nexus, HTC One series, Nexus S, Nexus One, Motorola Droid, \n\nSamsung Galaxy series, and most other devices. You're under control: SetCPU can \n\nimprove your performance, save battery, or both!\n\nAutomate SetCPU with profiles! SetCPU allows you to set up powerful profiles to \n\nchange your settings under certain conditions, such as what app is running, when \n\nthe phone is asleep or charging, when the battery level drops below a certain \n\npoint, when the phone's temperature is too high, or during certain times of day. \n\nSee the screenshots for examples of how you might set up profiles.\n\nSetCPU's wide feature set make it useful to Android beginners and enthusiasts \n\nalike. Accelerate your processor to unleash your phone's true multitasking \n\npotential, or dial your CPU's speed down to save battery.\n\nSetCPU also includes a &quot;voltage control&quot; menu, available to certain devices with \n\ncustom kernels that support it, to control undervolting to save even more battery. \n\nKeep in mind that undervolting is only available for certain kernels.\n\nRecent Changes:\n\nAdditional permission: Read logs is used for efficient app condition checking. That \n\nis currently all it's used for.","torrent":{"xt":"urn:btih:51e920862253d171b30ae483fcec1971a0903603","amp;dn":"SetCPU+for+Root+Users+v3.1.0.Full","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51e920862253d171b30ae483fcec1971a0903603","infoHashBuffer":{"type":"Buffer","data":[81,233,32,134,34,83,209,113,179,10,228,131,252,236,25,113,160,144,54,3]},"announce":[],"urlList":[]}}