{"title":"Never Back Down (2008) - 2Lions-Team","uid":5858947,"size":4682621982,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:52b542ee40b357eaaedc1ce32e11af17c42a7f7a&amp;dn=Never+Back+Down+%282008%29+-+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SAIMOR","files":-1,"time":1285888826,"description":"Verenigde Staten\nActie / 113 minuten\n\nRegisseur: Jeff Wadlow\nmet Sean Faris, Amber Heard, Djimon Hounsou, Evan Peters, Leslie Hope, Cam Gigandet, Wyatt Smith, Affion Crockett, Neil Brown Jr. en Lauren Leech\n\nBeschrijving:\n\nJake Tyler is een rebelse tiener die samen met zijn familie naar Florida verhuist, omdat zijn jongere broer daar een professionele tenniscariÃƒÂ«re begint. \nIn zijn vorige woonplaats was Jake een sterspeler in zijn footballteam, maar in zijn nieuwe woonplaats is hij een buitenstaander met geen goede reputatie. \nAls hij door zijn klasgenoot Baja wordt uitgenodigd op een groot feest lijkt Jake een kans te krijgen om misschien een beetje in te burgeren en vrienden te maken. \nEenmaal op het feest wordt Jake vernederd door Ryan McCarthy in een gevecht waar hij tegen zijn zin in is verwikkeld. \nNa deze vernedering maakt hij kennis met een andere klasgenoot die hem vertelt over vechtclub waar ze de sport Mixed Martial Arts beoefenen. \nJake is erg nieuwsgierig en gaat op zoek naar de vechtclub waar hij Jean Roqua ontmoet. \nIn eerste instantie is deze niet geinteresseerd in Jake, maar na een tijdje neemt hij hem toch onder zijn hoede en leert hij Jake de kneepjes van het vak.\n\n\n\nUitvoering   : Dvd, 1 disk, speelduur 113:00 minuten\nBeeldformaat : 2.35:1 \nKleur\t     : Color\nRegio\t     : 2\nTaal\t     : Engels \nAudio\t     : Dolby Digital 5.1 / DTS \nOndertiteling: Nederlands \n\n****************************************************************************\nUnited States\nAction / 113 minutes\n\nDirector: Jeff Wadlow\nSean Faris, Amber Heard, Djimon Hounsou, Evan Peters, Leslie Hope, Cam Gigandet, Wyatt Smith, Affion Crockett, Neil Brown Jr.. and Lauren Leech\n\nDescription:\n\nJake Tyler, a rebellious teenager who lives with his family to Florida move, because his younger brother as a professional tenniscariÃƒÂ«re begins.\nIn his previous home Jake was a star athlete on the football team, but in his new home he is an outsider with a reputation.\nWhen his classmate Baja is invited to a big party looks Jake a chance to maybe get a little bit to naturalise and friends to make.\nOnce at the party humiliated by Jake Ryan McCarthy in a battle where he is engaged in reluctantly.\nAfter this humiliation he meets a classmate who tells him about fight club where they practice the sport known as Mixed Martial Arts.\nJake is very curious and go looking for the fight club where he became Roqua met.\nAt first Jake is not interested in, but after a while he takes him under his wing and yet Jake learns the tricks of the trade.\n\n\n\nModel       : DVD, one disc, playing time 113:00 minutes\nAspect ratio: 2.35:1\nColor       : Color\nRegion      : 2\nLanguage    : English\nAudio       : 5.1 Dolby Digital / DTS\nSubtitles   : Dutch\n\n*****************************************************************************\nBrought to you by \nROMIAS\n\n2Lions Team \n\nmeer zien?? \nKom dan eens kijken op ons forum \n    &lt;a href=&quot;\nhttp://www.2lions-site.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions-site.nl&lt;/a&gt;\n \n\n2Lions-Team for all your Dutch MOVIES and more \n\n****************************************************************************** \nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding.\n\n******************************************************************************\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\n*******************************************************************************\t\n \n \n \n","torrent":{"xt":"urn:btih:52b542ee40b357eaaedc1ce32e11af17c42a7f7a","amp;dn":"Never+Back+Down+%282008%29+-+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52b542ee40b357eaaedc1ce32e11af17c42a7f7a","infoHashBuffer":{"type":"Buffer","data":[82,181,66,238,64,179,87,234,174,220,28,227,46,17,175,23,196,42,127,122]},"announce":[],"urlList":[]}}