{"title":"Gillian Rose - Love's Work: A Reckoning with Life (1995)","uid":8732551,"size":7695192,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:52cfe3347a548fc4ec6bbecebe1af6001715083c&amp;dn=Gillian+Rose+-+Love%27s+Work%3A+A+Reckoning+with+Life+%281995%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"workerbee","files":-1,"time":1374630402,"description":"Gillian Rose - Love's Work: A Reckoning with Life (Schocken Books, 1995).\n\nISBN: 0805241353 | 144 pages | PDF\n\n\nLove's Work is at once a memoir and a work of philosophy. Written by the English philosopher Gillian Rose (1947-1995) as she was dying of cancer, it is a book about both the fallibility and the endurance of love, love that becomes real and lasting through an ongoing reckoning with its own limitations. \n\nRose looks back on her childhood, the complications of her parents' divorce and her dyslexia, and her deep and divided feelings about what it means to be Jewish. She tells the stories of several friends also laboring under the sentence of death. From the sometimes conflicting vantage points of her own and her friends' tales, she seeks to work out (seeks, because the work can never be complete--to be alive means to be incomplete) a distinctive outlook on life, one that will do justice to our yearning both for autonomy and for connection to others. \n\nWith droll self-knowledge (&quot;I am highly qualified in unhappy love affairs,&quot; Rose writes, &quot;My earliest unhappy love affair was with Roy Rogers&quot;) and with unsettling wisdom (&quot;To live, to love, is to be failed&quot;), Rose has written a beautiful, tender, tough, and intricately wrought survival kit packed with necessary but unanswerable questions.\n\n\nReviews\n\n&quot;I struggle to think of a finer, more rewarding short autobiography than this. Gillian Rose, professor of social and political thought at Warwick University, and dying of cancer at the age of 48, managed to complete and publish this before her time was up.&quot; -- Nicholas Lezard, The Guardian\n\n&quot;This is not a pastel reverie, but a work in which the author, an English philosopher, feminist, and Marxist, not only bares her soul but carefully dissects it. . . Rose develops by contrast her notion of love's work: the obligation to go on thinking and caring in spite of the certainty of physical and moral defeat. Gillian Rose died shortly after completing this rigorous and lyrical book.&quot; -- The Boston Review\n\n&quot;Powerful . . . a miracle.&quot; -- The New York Times Book Review\n\n&quot;This beautiful memoir comes right from a genuinely thoughtful heart. It is good to find that philosophizing can offer its age-old consolations so present tensely.&quot; -- Elisabeth Young-Bruehl\n\n&quot;In its emphasis on the work of living, suffering, and loving, this is a masterpiece of the autobiographer's art, intense and rationally decorous at the same time.&quot; -- Edward Said\n\n&quot;Magnificent. . . Makes whatever else has been written on the deepest issues of human life by the philosophers of our time seem intolerably abstract and even frivolous.&quot; -- Arthur Danto\n\n&quot;This small book contains multitudes. . . It provokes, inspires, and illuminates more profoundly than many a bulky volume, and it delivers what its title promises, a new allegory about love.&quot; -- Marina Warner, London Review of Books\n\n&quot;A poetic and highly intellectual memoir that encourages us to read the mare's nest of grotesqueries that is our world of pain, illness, and trauma as a birthing-ground for the complex beauty of human relationships.&quot; -- Kirkus Reviews\n\n&quot;Part intellectual coming-of-age tale and part spiritual memoir, Rose's search for the soul takes her on a wildly dizzying ride through despair and hope, sickness and healing, love and death.&quot; -- Library Journal\n","torrent":{"xt":"urn:btih:52cfe3347a548fc4ec6bbecebe1af6001715083c","amp;dn":"Gillian+Rose+-+Love%27s+Work%3A+A+Reckoning+with+Life+%281995%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52cfe3347a548fc4ec6bbecebe1af6001715083c","infoHashBuffer":{"type":"Buffer","data":[82,207,227,52,122,84,143,196,236,107,190,206,190,26,246,0,23,21,8,60]},"announce":[],"urlList":[]}}