{"title":"DVD-Lab Pro v2.3 (Full Vista Support)","uid":3680646,"size":24165733,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:53146e954125af8fc36a77d28e9b231985995b08&amp;dn=DVD-Lab+Pro+v2.3+%28Full+Vista+Support%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bingoweb","files":1,"time":1178294382,"description":"The DVD-lab PRO version 2.0 is a next step in DVD authoring (See Comparison) for advanced users who need accessible and easy to learn tool with full range of DVD features.\n\nMost of the existing tools are either very expensive and hard to master or are limited in implementing DVD specifications. Many tools that are often marketed as advanced or for professional use are actually only more expensive consumer applications with pre-cooked DVD structure and questionable user interface.\n\nDVD-lab PRO is based on the idea of original DVD-lab. Instead of insulting the users with an overdone flashy interface, DVD-lab and DVD-lab PRO put strong emphasis on the usability of it. The Modern Windows GUI can be tweaked and reorganized to everybody taste even across multiple monitors.\n\nDVD-lab PRO is also one of the very few applications on the market that grows with your requirements and knowledge. Users of other applications usually either outgrow them very soon or they need to study a long time before they are able to create even simple project.\n\nWe put a lot of effort to the DVD-lab PRO so it offers benefits of both worlds. It is easy to start making first DVD&amp;#039;s but it doesn&amp;#039;t stop there. As you continue to master the craft you will realize that DVD-lab PRO offers an unlimited range of design flexibility and delivers the goods even for most demanding designers.","torrent":{"xt":"urn:btih:53146e954125af8fc36a77d28e9b231985995b08","amp;dn":"DVD-Lab+Pro+v2.3+%28Full+Vista+Support%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53146e954125af8fc36a77d28e9b231985995b08","infoHashBuffer":{"type":"Buffer","data":[83,20,110,149,65,37,175,143,195,106,119,210,142,155,35,25,133,153,91,8]},"announce":[],"urlList":[]}}