{"title":"Yoko Tsuno 1-4 (danish language)","uid":3842183,"size":130199598,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:5323e440a4cabb818bf5ca7cc66918d0a5792dac&amp;dn=Yoko+Tsuno+1-4+%28danish+language%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Hesten","files":4,"time":1192393737,"description":"Yoko Tsuno is a comic book series created by the Belgian writer Roger Leloup published by Dupuis and in Spirou since its debut in 1970. Through twenty-four volumes, the series tell the adventures of Yoko Tsuno, a female electrical engineer of Japanese origin surrounded by her close friends, Vic and Pol. Their adventures bring them to, among other places, Germany, Scotland, Japan, Hong Kong, Indonesia and also into outer space. The stories are heavily technology driven, with concepts like robot dragons (Le Dragon de Hong Kong), suspended animation (La FrontiÃƒÂ¨re de la vie), time travel (La Spirale du temps and others), and even an alien species called the Vineans. Despite the often exotic settings, the stories remain very realistic and friendship, love and spirituality are some of the key themes of the series. The art is drawn in Ligne claire style. When depiciting real-world settings, Leloup aspires to be as true to reality as possible, with places like Burg Katz or Rothenburg ob der Tauber depicted with almost photographic skill.\n\n\n\nIm in the process of scanning all of the Yoko Tsuno albums, so there will be more torrents with the rest, as i get to scan them.\nAlso check out my other danish comic torrents.","torrent":{"xt":"urn:btih:5323e440a4cabb818bf5ca7cc66918d0a5792dac","amp;dn":"Yoko+Tsuno+1-4+%28danish+language%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5323e440a4cabb818bf5ca7cc66918d0a5792dac","infoHashBuffer":{"type":"Buffer","data":[83,35,228,64,164,202,187,129,139,245,202,124,198,105,24,208,165,121,45,172]},"announce":[],"urlList":[]}}