{"title":"The Anthony Cumia Show 2015-03-05 MP4 MP3 combo","uid":11738501,"size":271479172,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:5367d536a1a7907071d9b3a87832dd6be85c0044&amp;dn=The+Anthony+Cumia+Show+2015-03-05+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mothergoose58","files":2,"time":1425656021,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest: Adam Corolla\n\nEpisode 122: TACS week ends with a much healthier looking Anthony (thanks Rat!) who gets right into talking with Adam Corolla about how he got his start in the industry, his new movie &quot;Road Hard&quot;, the beginning days and slow process of starting a podcast, and how his podcast ultimately helped his life. After the call, Ant praises Corolla's motivation, mentions one day he could possibly write a book or movie, expresses his love for beer and video games, explains he's off H1Z1 and onto &quot;EVE Online&quot;, and we hear from a few of the listeners. Ant tells us about a dream he had that of course ended with &quot;dream rape&quot;, talks about ads that run before ISIS videos, the callers have at it once again, we see a plane that slid off the runway at LaGuardia Airport, hear a prank call on the news, and talk briefly about Conan doing a show in Cuba. Ant admits he used to make the &quot;Seaview Submarine&quot; with his dick when he was a kid, KtC calls in to rip Ant a new one for saying he took a snow day, we're treated to new lackluster entries for the &quot;Most Offensive Song&quot; contest, watch a pussy painting video, and Sydney Leathers is back in the news claiming kinky messages from another politician. Ant says power and money get you out of situations and jumps into Conrad Hilton's plea deal, he touches a bit more on &quot;EVE Online&quot;, and a caller questions TACS's ability to remain completely uncensored when a studio in NYC is up and running.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\n\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:5367d536a1a7907071d9b3a87832dd6be85c0044","amp;dn":"The+Anthony+Cumia+Show+2015-03-05+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5367d536a1a7907071d9b3a87832dd6be85c0044","infoHashBuffer":{"type":"Buffer","data":[83,103,213,54,161,167,144,112,113,217,179,168,120,50,221,107,232,92,0,68]},"announce":[],"urlList":[]}}