{"title":"Ann Hampton Callaway - 2006 - Blues In The Night (SACD 24 88.2) ","uid":10017929,"size":1247248936,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:54de66231c10b408f9cdf1252796514a962365c2&amp;dn=Ann+Hampton+Callaway+-+2006+-+Blues+In+The+Night+%28SACD+24+88.2%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1398175614,"description":"Ann Hampton Callaway - 2006 - Blues In The Night\nSACD rip at 24 bits, 88.2 KHz\n\nAnn Hampton Callaway is not your typical jazz songbird. For one thing, she's an accomplished and award-winning songwriter, which is unusual in a field dominated by interpreters. But what's most surprising is her voice -- it's a low alto instrument with a rich, dark, butterscotchy tone, and when she gets way down into her lower range the effect can be downright startling. Her latest album is a pleasing mixture of originals and standards, some performed with a small combo that includes bassist Christian McBride and drummer Lewis Nash, others with the all-female Diva Jazz Orchestra. The big-band pieces pack the most wallop, which is no surprise given both the quality of the band and the fact that the arrangements were written by the great Tommy Newsom; a powerhouse rendition of her own &quot;Swingin' Away the Blues&quot; opens the program with a serious bang, and her small-scale but equally powerful take on the chestnut &quot;Blue Moon&quot; carries the energy forward nicely. The rest of the album is a mix of tender ballads and vibrant uptempo numbers, most with a theme related to the blues, either in a mood of resigned acceptance (&quot;Spring Can Really Hang You Up the Most,&quot; &quot;Willow Weep for Me&quot;) or defiant opposition (the Callaway original &quot;Hip to Be Happy&quot;). She imbues most of these songs with a smoldering, torchy quality that brings new energy to old material, and her new songs stand up very nicely next to the established standards. Highly recommended. (AllMusic)\n\nTrack list:\n01 - Swingin' Away the Blues\n02 - Blue Moon\n03 - Spring Can Really Hang You Up The Most\n04 - Lover Come Back To Me\n05 - Stormy Weather-When The Sun Comes Out\n06 - The I'm-Too-White-To-Sing-The-Blues Blues\n07 - Willow Weep For Me\n08 - Hip To Be Happy\n09 - It's All Right With Me\n10 - No One Is Alone\n11 - Blues In the Night\n12 - The Glory of Love\n\nPersonnel:\nAnn Hampton Callaway: vocals; Ted Rosenthal: piano; Christian McBride: double bass; Lewis Nash: drums; Liz Callaway: vocals; David Gilmore: guitar. Sherrie Maricle and the Diva Jazz Orchestra (1, 4, 6, 11): Sherrie Maricle: drums, leader; Noriko Ueda: double bass; Kristy Norter: alto saxophone, flute; Erica von Kleist: alto saxophone, clarinet, flute; Anat Cohen, Scheila Gonzalez: tenor saxophone, clarinet; Lisa Parrott: baritone saxophone; Tanya Darby, Jami Dauber, Nadje Noordhuis, Alicia Rau: trumpet; Deborah Weisz, Jennifer Krupa: trombone; Leslie Havens: bass trombone.\n\nEnjoy and share!","torrent":{"xt":"urn:btih:54de66231c10b408f9cdf1252796514a962365c2","amp;dn":"Ann+Hampton+Callaway+-+2006+-+Blues+In+The+Night+%28SACD+24+88.2%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54de66231c10b408f9cdf1252796514a962365c2","infoHashBuffer":{"type":"Buffer","data":[84,222,102,35,28,16,180,8,249,205,241,37,39,150,81,74,150,35,101,194]},"announce":[],"urlList":[]}}