{"title":"Decline and Fall of the Sasanian Empire (History Ebook).pdf","uid":8820871,"size":6181010,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:54f84c08cc4300cedc55a3e85862410ea24921d6&amp;dn=Decline+and+Fall+of+the+Sasanian+Empire+%28History+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":-1,"time":1376700629,"description":"Decline and Fall of the Sasanian Empire: The Sasanian-Parthian Confederacy and the Arab Conquest of Iran by Parvaneh Pourshariati \nEnglish | May 13, 2008 | ISBN: 1845116453 | 552 pages | PDF | 5.9 MB\n\nDecline and Fall of the Sasanian Empire has already been praised as one of the most intellectually exciting books about ancient Persia to have been published for years. It proposes a convincing contemporary answer answer to an ages-old mystery and conundrum: why, in the seventh century CE, did the seemingly powerful and secure Sasanian empire of Persia succumb so quickly and disastrously to the all-conquering Arab armies of Islam? Offering an impressive appraisal of the Sasanians' nemesis at the hands of the Arab forces which scythed all before them, the author suggests a bold solution to the enigma. On the face of it, the collapse of the Sasanians--given their strength and imperial power in the earlier part of the century--looks startling and inexplicable. But Professor Pourshariati explains their fall in terms of an earlier corrosion and decline, and as a result of their own internal weaknesses. The decentralized dynastic system of the Sasanian empire, whose backbone was a Sasanian-Parthian alliance, contained the seeds of its own destruction. This confederacy soon became unstable, and its degeneration sealed the fate of a doomed dynasty.","torrent":{"xt":"urn:btih:54f84c08cc4300cedc55a3e85862410ea24921d6","amp;dn":"Decline+and+Fall+of+the+Sasanian+Empire+%28History+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54f84c08cc4300cedc55a3e85862410ea24921d6","infoHashBuffer":{"type":"Buffer","data":[84,248,76,8,204,67,0,206,220,85,163,232,88,98,65,14,162,73,33,214]},"announce":[],"urlList":[]}}