{"title":"(PSX-PSP) King's Field 1 &amp; 2 converted properly (Kingdom-game","uid":4888199,"size":545058429,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:5698e8bd30a1c9ebddd23e8edb9b00b1a0c8434b&amp;dn=%28PSX-PSP%29+King%5C%27s+Field+1+%26+2+converted+properly+%28Kingdom-game&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"toxicjuggalo","files":3,"time":1241827521,"description":"KING'S FIELD:\n\nThe kingdom of Verdite is under attack. Its last hope is the legendary Moonlight sword. The Royal Knights are sent to the sword's resting place on the island of Melanat. Unfortunately, the ship carrying the knights encounters a storm and sinks. You take the role of Alexander, the doomed ship's sole survivor. All you have to do is find the Moonlight sword and escape the island. As a stroke of bad luck, the residents of Melanat are not too happy to see you, so it looks like you've got a fight on your hands. However, there are few residents who are willing to give you advice and sell you items that will aid you in your quest. You will not miss a second of the action thanks to a first-person perspective that lets you see every nook of every scene. Only you can help Alexander find the Moonlight sword and save the kingdom in KING'S FIELD.\n\nKING'S FIELD 2:\n\nWithout warning, the kingdom of Verdite is battered by a terrible storm. Unfortunately, the storm steals the protective Moonlight sword. Along with the sword, the King's soul has been taken as well. Only the King's son, Lyle, can find the source of the storm, recover the sword, and return peace to the Kingdom. You take control of Lyle as he searches the world for the sword and his father's soul. In order to be successful, Lyle must listen to the advice of the various characters he meets throughout the adventure. However, when push comes to shove, Lyle will fight back with an assortment of weapons and magic spells. You will not miss a second of the action thanks to the first-person perspective that allows exploration of every inch of the world. Play KING'S FIELD II, and help Lyle save his father.\n\n\nBoth games tested and working on all CFW's 5.00 m33 and above using the 500 popsloader pack set on 3.72 POPS...KloWn ","torrent":{"xt":"urn:btih:5698e8bd30a1c9ebddd23e8edb9b00b1a0c8434b","amp;dn":"%28PSX-PSP%29+King%5C%27s+Field+1+%26+2+converted+properly+%28Kingdom-game","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5698e8bd30a1c9ebddd23e8edb9b00b1a0c8434b","infoHashBuffer":{"type":"Buffer","data":[86,152,232,189,48,161,201,235,221,210,62,142,219,155,0,177,160,200,67,75]},"announce":[],"urlList":[]}}