{"title":"The Westminster Cardinals: The Past and the Future _F1_","uid":6496906,"size":917882,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:57017c5bd21b8b07f37f8f354f26f762da7e7997&amp;dn=The+Westminster+Cardinals%3A+The+Past+and+the+Future+_F1_&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"_F1_","files":-1,"time":1309107375,"description":"Michael J. Walsh, &quot;The Westminster Cardinals: The Past and the Future&quot;\nBur ns &amp; Oa tes | 2009 | ISBN: 0860124592 | 264 pages | PDF | 1 MB\n\nThis is a fascinating and topical biography of the lives of ten men appointed by Rome to head the Roman Catholic Church in the UK.This book will look at the lives of ten men who have been appointed by Rome to head the Roman Catholic Church in this country. The biographies will be set against the background of four main topics: in 1850 RCs were still a marginalized community, an uneasy amalgam of recusant families Irish immigrants and distinguished converts (The challenge was to create an indigenous Catholicism); the Church in Britain had to contend with a constituency which tended to be poor and illiterate (Part of the Archbishops drive was to boost education and thus drive Catholics out of poverty); relations with the Church of England and the wish to preserve Catholic identity; and, Catholics were and are increasingly a significant identifiable section of British society.The Archbishops of Westminster has attempted to express their voice in the national debates - whether successfully or not is an issue discussed in this fascinating book. The present Catholic hierarchy have often taken issue with the diktats coming from Rome on many issues - liturgy, divorced and remarried Catholics, the ordination of married men. If Rome appoints a man who is more inclined to kowtow to Rome this could be bad news for liberal minded progressive people of any religious belief or none. It is generally agreed that Hume outshone Carey as a national spiritual leader. How will the new appointment rate with the Chief Rabbi and Rowan Williams also is in contention.","torrent":{"xt":"urn:btih:57017c5bd21b8b07f37f8f354f26f762da7e7997","amp;dn":"The+Westminster+Cardinals%3A+The+Past+and+the+Future+_F1_","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57017c5bd21b8b07f37f8f354f26f762da7e7997","infoHashBuffer":{"type":"Buffer","data":[87,1,124,91,210,27,139,7,243,127,143,53,79,38,247,98,218,126,121,151]},"announce":[],"urlList":[]}}