{"title":"Wonders Are Many the making of Doctor Atomic (2007)","uid":8038792,"size":774562102,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5862a43db87c08a6eef7efc0da9d1c3d5c92d395&amp;dn=Wonders+Are+Many+the+making+of+Doctor+Atomic+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"loninappleton","files":3,"time":1358575326,"description":"Wonders Are Many  (2007)\nA Documentary on the Making of the Opera Doctor Atomic\nruntime: 1:32\n\nIMDb:  tt0912601\n\n  Wiki excerpt about the opera Doctor Atomic:\n\n&quot;Doctor Atomic is an opera by the contemporary American composer John Adams, with libretto by Peter Sellars. It premiered at the San Francisco Opera on 1 October 2005. The work focuses on the great stress and anxiety experienced by those at Los Alamos while the test of the first atomic bomb (the &quot;Trinity&quot; test) was being prepared. In 2007, a documentary was made about the creation of the opera, titled Wonders Are Many.&quot;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Doctor_Atomic&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Doctor_Atomic&lt;/a&gt;\n\nMy notes:\n\n  This for persons who do not like opera moreso than those who do.  I came to listening to opera by way of extraordinary pieces like Doctor Atomic from radio broadcasts of the Metropolitan Opera.  Because I say the documentary is for persons who do not like opera, I leave the getting of Doctor Atomic to you.\n\n  Why is this important?  \n\n  Doctor Atomic is about the most significant event in history: the splitting of the atom and the creation of the atomic bomb.  Because it was chosen as a subject for opera it becomes part of the repertoire of an art form which deals with situations and emotions exteme in nature and history.\n\n  And it introduces the viewer to Peter Sellars.  Sellars is seen as director and librettist.  He is important because he is the only director of opera who works with subjects political and sensitive that most artistic directors would not even try.  \n\n  The Metropolitan Opera and Mr. Adams should also be complimented on the risk they take with this subject matter.  \n\n  Doctor Atomic, the opera, is available on cd and dvd from The Met sources.\n\n  For me, this documentary stands on it's own in showing the development of &quot;music theater&quot; which is the formal description of opera.  Music Theater brings together all the art and craft of both music and theater.  The documentary shows this process.  I present it here to make it available to wider audience.\n\n  If you find it valuable, see that your libraries have it, teach it, and talk about it.\n\n\n  Notes written February 15th, 2012\n\nThis torrent was orphaned for a while.  A new torrent is made and will be maintained now.\n\nJanuary 18th,  2013\n\n","torrent":{"xt":"urn:btih:5862a43db87c08a6eef7efc0da9d1c3d5c92d395","amp;dn":"Wonders+Are+Many+the+making+of+Doctor+Atomic+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5862a43db87c08a6eef7efc0da9d1c3d5c92d395","infoHashBuffer":{"type":"Buffer","data":[88,98,164,61,184,124,8,166,238,247,239,192,218,157,28,61,92,146,211,149]},"announce":[],"urlList":[]}}