{"title":"Dead Can Dance - Serpent's Egg (lossless/FLAC)","uid":3839878,"size":214260231,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:59f8979bf9cf21e0b21ae8ca9f0b2b20e4a6b62b&amp;dn=Dead+Can+Dance+-+Serpent%5C%27s+Egg+%28lossless%2FFLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Marzin","files":18,"time":1192236877,"description":"Perry and Gerrard continued to experiment and improve with The Serpent&amp;#039;s Egg, as much a leap forward as Spleen and Ideal was some years previously.As with that album, The Serpent&amp;#039;s Egg was heralded by an astounding first track, &quot;The Host of Seraphim.&quot; Its use in films some years later was no surprise in the slightest -- one can imagine the potential range of epic images the song could call up -- but on its own it&amp;#039;s so jaw-droppingly good that almost the only reaction is sheer awe. Beginning with a soft organ drone and buried, echoed percussion, Gerrard then takes flight with a seemingly wordless invocation of power and worship -- her vocal control and multi-octave range, especially towards the end, has to be heard to be believed. Nothing else achieves such heights, but everything gets pretty darn close, a deserved testament to the band&amp;#039;s conceptual reach and abilities. Slow plainsong chants such as &quot;Orbis De Ignis&quot; mix with the harpischord and overlaid vocals of &quot;The Writing on My Father&amp;#039;s Hand&quot; and the slow build and sweep of &quot;In the Kingdom of the Blind the One-Eyed Are Kings.&quot; Two of Perry&amp;#039;s finest vocal moments occur here. The first, &quot;Severance,&quot; is a slow, organ/keyboard led number that showcases his rich, warm vocals exquisitely -- it&amp;#039;s no wonder that Bauhaus chose to cover it some years later on its reunion tour. &quot;Ullyses,&quot; the album&amp;#039;s closing track, makes for a fine ending as much as &quot;The Host of Seraphim&quot; did an opening, Perry&amp;#039;s delivery almost like a reading from a holy book, the arrangement of strings and percussion rhythmic, addictive and lovely.","torrent":{"xt":"urn:btih:59f8979bf9cf21e0b21ae8ca9f0b2b20e4a6b62b","amp;dn":"Dead+Can+Dance+-+Serpent%5C%27s+Egg+%28lossless%2FFLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59f8979bf9cf21e0b21ae8ca9f0b2b20e4a6b62b","infoHashBuffer":{"type":"Buffer","data":[89,248,151,155,249,207,33,224,178,26,232,202,159,11,43,32,228,166,182,43]},"announce":[],"urlList":[]}}