{"title":"[FSX/P3D] Zinertek - Natural Tree Environment X","uid":9325705,"size":17380485,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5b4e16ba428b099e310b892e6cea658be146134e&amp;dn=%5BFSX%2FP3D%5D+Zinertek+-+Natural+Tree+Environment+X&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_SnakEye","files":-1,"time":1386627431,"description":"Natural Tree Environment X is the most realistic and complete vegetation texture package ever released for FSX and Prepar3D. This product features over 170 new and detailed realistic tree textures in High Definition that greatly enhances your environments in Microsoft Flight Simulator X and Prepar3D by introducing new and detailed trees across all continents!\n\nIf you are new to the hobby or a seasoned veteran you will appreciate how all the new trees and vegetation instantly enhance the environments in the simulator by changing the appearance of cities, forests, rainforests, jungles, mountains, savannas and the countryside.\n\nWhether you are flying over a rainforest in South America or over small town in Europe you will see new and realistic vegetation during spring, summer, autumn, and winter!\n\nEven if you have a low-end system or a high-end system, this product adjusts to your performance and quality needs. You can choose between 2 different texture quality options and select whichever set is best for your system.\n\nThis product is compatible with your favorite sceneries and add-ons as it replaces all the auto-gen trees with detailed and realistic ones.\n\nFeatures:\n\n    Over 170 new tree textures in high definition!\n    New trees for spring, summer, autumn, winter and hard winter.\n    Improves the appearance of all auto-gen trees around the world.\n    Option to install trees in high definition or standard definition.\n    FSX and Prepar3D versions included in one package.\n    Compatible with your favorite sceneries.","torrent":{"xt":"urn:btih:5b4e16ba428b099e310b892e6cea658be146134e","amp;dn":"%5BFSX%2FP3D%5D+Zinertek+-+Natural+Tree+Environment+X","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b4e16ba428b099e310b892e6cea658be146134e","infoHashBuffer":{"type":"Buffer","data":[91,78,22,186,66,139,9,158,49,11,137,46,108,234,101,139,225,70,19,78]},"announce":[],"urlList":[]}}