{"title":"Babybird - Ugly Beautiful [1996]","uid":9772936,"size":435706102,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5b764e111d65ca5430f6d062525bd2a8ea0d6a3e&amp;dn=Babybird+-+Ugly+Beautiful+%5B1996%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"GenXRock","files":-1,"time":1394984064,"description":"Review by Stephen Thomas Erlewine\nMoving to a major label and switching to a full backing band for Ugly Beautiful is both a positive and negative development for Baby Bird. In the positive sense, Stephen Jones' songs -- including a handful of tracks that were on his indie releases -- are given a clarity they were lacking in the past, and the full-bodied arrangements reveal songs like &quot;Good Night&quot; and &quot;You're Gorgeous&quot; as effortlessly catchy pop singles. However, the sonic clarity and larger arrangements also reveal that Jones is neither as clever nor as strange as his lo-fi albums suggested. Indeed, he often sounds like he's stuck in 1985, replicating the quirky charms of Robyn Hitchcock and Echo &amp; the Bunnymen, and he lacks the wit or the adventure of either artist. So, Ugly Beautiful often treads close to cutesy nostalgia, of all things, yet it's saved by the sporadic surfacing of his songcraft. Even in this radio-ready setting, &quot;I Didn't Want to Wake You Up&quot; has a disquieting power, and &quot;You're Gorgeous&quot; positively radiates with twisted sexuality. But the long, &quot;ironic&quot; jams and unfocused material that end the record suggest that instead of representing the first flowering of his full talent, Ugly Beautiful may be the peak of it. (4.5/5)","torrent":{"xt":"urn:btih:5b764e111d65ca5430f6d062525bd2a8ea0d6a3e","amp;dn":"Babybird+-+Ugly+Beautiful+%5B1996%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b764e111d65ca5430f6d062525bd2a8ea0d6a3e","infoHashBuffer":{"type":"Buffer","data":[91,118,78,17,29,101,202,84,48,246,208,98,82,91,210,168,234,13,106,62]},"announce":[],"urlList":[]}}