{"title":"Coast to Coast AM February 13 2013","uid":8143754,"size":56347087,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5bca9c6fe75baf6edc738b80a606ae84a05a046c&amp;dn=Coast+to+Coast+AM+February+13+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1360863195,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t02-13-13\nHost: \tGeorge Noory\nGuests: \tJohn Gray\n\nExpert in the fields of communication and relationships, Dr. John Gray, discussed how men and women react differently to stress, the changing nature of relationships, the crisis facing young boys, and various supplements that can be taken for different conditions. He also spoke about how Valentine's Day is an important holiday for women, and that men should do something out of the ordinary for their wives or girlfriends, &quot;and show them a little more specialness than they usually do.&quot; Men and women have different needs biologically, and different methods of lowering stress, he explained. For example, women produce the stress-relieving hormone oxytocin when they are able to talk about their problems, while men try to solve rather than talk about problems, and this helps them produce testosterone, which reduces stress for them.\n\nWhile these days, relationships tend to last for shorter periods before a breakup, men and women are connecting more than ever before, but don't necessarily have role models for these interactions, he noted. Gray cited a kind of warning sign cycle that a relationship is growing worse-- beginning with resistance, moving to resentment, and ending with rejection. Regarding what he called the &quot;Boy Crisis,&quot; he said that many young men have a &quot;failure to launch,&quot; and that twice as many girls as boys graduate high school, and boys are much likelier than girls to have ADD/ADHD. Further, boys are 8 times more likely to commit suicide than girls, and 60 out of 61 mass murderers in the US have been boys or men. In many of these cases, the boys came from homes without a father, and were on prescription medications-- factors, he believes, that played into their problems.\n\nGray suggested alternatives to pharmaceuticals for conditions such as ADD, by naturally raising the level of dopamine with supplements such as Lithium Orotate and L-Tyrosine. For sinus infections, inflammatory problems, and other conditions, he spoke about a supplement called serrapeptase that reduces mucous in the body, and is commonly used in Europe and Japan. For products that regulate blood sugar and can help people lose weight, he recommended the popular green coffee extract, as well as brown seaweed supplement.\nThe Number 13 &amp; Symbology\n\nFirst hour guest, author &amp; clairvoyant Betsey Lewis talked about some of the esoteric symbology related to the number 13, and how various unusual events such as the Fatima apparitions of 1917, and the Phoenix Lights of 1997 fell on the 13th day of the month. The number 13 is important to the Illuminati and secret societies, and refers to the 13 wealthiest bloodlines in the world, she noted. Lewis also foresees &quot;mega events&quot; happening in 2013, with possibly a damaging solar flare hitting the planet.\n\nNews segment guests: Charles R. Smith, Dr. Peter Breggin\nWebsite(s):\n\n    marsvenus.com\n    betseylewis.com\n\nBook(s):\n\n    Men Are from Mars, Women Are from Venus\n    Why Mars and Venus Collide\n    Venus on Fire, Mars on Ice\n    Angels, Aliens and Prophecy: The Connection\n\n","torrent":{"xt":"urn:btih:5bca9c6fe75baf6edc738b80a606ae84a05a046c","amp;dn":"Coast+to+Coast+AM+February+13+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bca9c6fe75baf6edc738b80a606ae84a05a046c","infoHashBuffer":{"type":"Buffer","data":[91,202,156,111,231,91,175,110,220,115,139,128,166,6,174,132,160,90,4,108]},"announce":[],"urlList":[]}}