{"title":"Little House on the Prairie: THE LITTLE HOUSE YEARS (special) (D","uid":4913290,"size":1320514490,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5c774902838274e1837bf6667fe9a47085d1cc08&amp;dn=Little+House+on+the+Prairie%3A+THE+LITTLE+HOUSE+YEARS+%28special%29+%28D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chesterzeigt","files":1,"time":1243288948,"description":"Little House on the Prairie: THE LITTLE HOUSE YEARS (special) (TVrip)\n\nSOURCE\nTVrip\n(dodgy) analog cable\n\nVIDEO\ncodec: DivX 5 (avi container)\nvideo size: 640x480\nframe rate: 29.97 fps\ndata rate: 1400+ kbps\ncolor\n\nAUDIO\naudio format: MPEG layer 3\nsampling rate: 44.1 kHz\ndata rate: 160 kbps\nstereo (2-channel mono)\n\nPROGRAM INFO\noriginal air date: November 15, 1979\nproduction no.: 6680\nlength: 1:59:39 (3 parts put back together, without commercials; originally aired as 3-hour special)\n\nDESCRIPTION\nThis Thanksgiving special from season 6 of Little House on the Prairie has not been released on DVD. It originally aired separately from the series and consists mainly of flashbacks with some new scenes. Laura reads from her remembrance book (new scenes), as the Ingalls reminisce about their past years in Walnut Grove for the benefit of Albert (flashbacks). Stories include: how their Little House came to be built on Plum Creek (from S01E01), Pa's 100 Mile Walk to get work (S01E03), Laura and her friend finding &quot;gold&quot; in a stream (S02E10), Laura's guilt over the loss of her baby brother (S01E13/14), Nellie's horse accident on Bunny (S03E02), the horse race (S03E03), the death of Grandma Ingalls and visit by Grandpa Ingalls (S03E06/07).\n\nNOTES\nThis is from a recent TV rebroadcast and features on-screen promos for other shows, a network bug and TV-G logo in the corners, etc. The 3 hour-long syndicated episodes have been recombined back into 1 show, how it originally aired in 1979. The network ran promos during the final credits and reduced the credits to a sliver. The credits have been expanded back to fullscreen and different theme music was used to replace the promo audio. (The result is crude.) This is the first mention of Laura deciding to write down their family stories and thus should have been included on the DVD release.","torrent":{"xt":"urn:btih:5c774902838274e1837bf6667fe9a47085d1cc08","amp;dn":"Little+House+on+the+Prairie%3A+THE+LITTLE+HOUSE+YEARS+%28special%29+%28D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c774902838274e1837bf6667fe9a47085d1cc08","infoHashBuffer":{"type":"Buffer","data":[92,119,73,2,131,130,116,225,131,123,246,102,127,233,164,112,133,209,204,8]},"announce":[],"urlList":[]}}