{"title":"Shallow Hal(2001)DVDRip.AC3(ENG)-DROCK","uid":6663812,"size":734125472,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5cb041c2628d6a333632b580c1a2b99bec524205&amp;dn=Shallow+Hal%282001%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1315609610,"description":"Jack Black continues his march to stardom with this typical Farrelly brothers blend of broad comedy and a heartfelt message. Black is Hal Larsen, a shallow man rapidly approaching middle age whose superficiality can be attributed to his father's deathbed admonition to only date young, beautiful women. Hal and his best friend, Mauricio (Jason Alexander), have taken the advice to heart, but Hal finds all of his physically impressive girlfriends consistently lacking in other qualities that would make them ideal mates. When he bumps into self-help guru Tony Robbins (playing himself), the motivational entrepreneur is intrigued by Hal's predicament and hypnotizes him so that he'll only see the inner beauty of women. Hal is quickly smitten with Rosemary Shanahan (Gwyneth Paltrow), a blonde Peace Corps volunteer who's tenderhearted, funny, and intelligent. She is also gorgeous and meets Hal's basic criteria of outer perfection, but what he doesn't realize is that Robbins' spell is working and he cannot see that Rosemary actually weights 300 pounds. When Mauricio is finally able to snap Hal out of his charmed state, Hal's in love with the inwardly perfect woman and must overcome his obsession with beauty. The script for Shallow Hal (2001) was developed when Peter Farrelly enjoyed the humorous letters written to a mutual friend by Sean Moynihan, a computer software executive who followed the filmmaker's advice to take up screenwriting.\n\nRipped with Handbrake.\n\nLength: 1 Hour 53 Minutes\n\nFile Type: MP4\n\nFrame Width: 720\n\nFrame Height: 400\n\nFrame Rate: 23fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:5cb041c2628d6a333632b580c1a2b99bec524205","amp;dn":"Shallow+Hal%282001%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cb041c2628d6a333632b580c1a2b99bec524205","infoHashBuffer":{"type":"Buffer","data":[92,176,65,194,98,141,106,51,54,50,181,128,193,162,185,155,236,82,66,5]},"announce":[],"urlList":[]}}