{"title":"The Dark Doctrines of Sat-Tanism","uid":4950155,"size":507627849,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5cd5e82d340a631ecceabf71b9814f0c58663da3&amp;dn=The+Dark+Doctrines+of+Sat-Tanism&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hellisreal","files":1,"time":1244848398,"description":"The &quot;Dark Doctrines&quot; are the invention of Tani Jantsang and Philip Marsh, who began a study of the occult in the late 1960es or early 1970es.  The Dark Doctrines appear to be a development of Helena Blavatsky's _The Secret Doctrine_, mixed with concepts found elsewhere.  The underlying assumption is that if concepts from other traditions are similar to those of _The Secret Doctrine_, then both _The Secret Doctrine_ and those traditions share a common past: the Dark Doctrines.\n\nJantsang and Marsh claim membership of this original tradition and strongly defend their position as the only authority on the subject.  When Blavatsky or other authors are shown to precede Jantsang or Marsh, then those authors are dismissed as mere students that were shown superficial parts, but not the inner secret, of the Dark Doctrines.\n\nThe Dark Doctrines themselves require a significant amount of acceptance of religious dogma; for example, some premises are founded on a belief in the Christian Bible's myths about Jesus.\n\nTani Jantsang and Philip Marsh held titles of Magistra and Magister of the Church of Satan, and in the second half of the 1990es the Church of Satan embraced many of the concepts provided by the Dark Doctrines, using expressions and concepts of the Dark Doctrines in its official writings.  Tani Jantsang was excommunicated from the Church of Satan a few years later, however, in part because of Tani Jantsang's fierce opposition to the at that time fascist leanings of the Church of Satan, and possibly in part because the Church of Satan had lost its fascination with the Dark Doctrines.","torrent":{"xt":"urn:btih:5cd5e82d340a631ecceabf71b9814f0c58663da3","amp;dn":"The+Dark+Doctrines+of+Sat-Tanism","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cd5e82d340a631ecceabf71b9814f0c58663da3","infoHashBuffer":{"type":"Buffer","data":[92,213,232,45,52,10,99,30,204,234,191,113,185,129,79,12,88,102,61,163]},"announce":[],"urlList":[]}}