{"title":"Stossel.2016.01.22.Econ.Myths.720p.webrip.BREACH","uid":13447810,"size":792120381,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5d60385fb2609abbd6b5e32b0b94f9fa23ee0e22&amp;dn=Stossel.2016.01.22.Econ.Myths.720p.webrip.BREACH&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BBreach","files":1,"time":1454765603,"description":"Economic Myths of the Presidential Candidates\r\nJohn Stossel | January 20, 2016\r\n\r\nHillary Clinton: &quot;Of course we want to raise the minimum wage!&quot;\r\n\r\nDonald Trump: If we trade with China, &quot;they suck us dry ... take everything. We get nothing!&quot;\r\n\r\nBernie Sanders: &quot;Ordinary Americans are working longer hours for lower wages.&quot;\r\n\r\nBut it's not true! Politicians are so ignorant about economics.\r\n\r\nOn his blog, Cafe Hayek, George Mason University professor Donald Boudreaux says his main job is showing students that much of what they believe about economics is wrong. I wish he taught presidential candidates.\r\n\r\nSen. Sanders simply gets facts wrong. Today Americans work fewer hours—down from about 2,000 hours per year to 1,800 over the past 60 years—and earn more. It's true that the rich got even richer, but the poor and middle class have done better, too, with about 40 percent higher salaries for the middle class and 48 percent more for the poor over the past 35 years. Politicians lie.\r\n\r\nDonald Trump doesn't understand trade. Even if China &quot;dumps&quot; goods on America, we don't &quot;get nothing&quot;—we get the goods. As Trevor Woolley posted on mypage, &quot;The fact that the free market is based on consensual transaction means that no trade can decrease anyone's wellbeing.&quot;\r\n\r\nRight. Since trade is voluntary, no trade happens unless both sides think they will gain. Trade may eliminate jobs in some industries, but it creates jobs elsewhere, more jobs, and creates wealth for the vast majority.\r\n\r\nHelping some American companies by restricting foreign imports, as Donald Trump vows to do, sounds nice, but you can't restrict goods available to American consumers without reducing competition. Protected from competition, companies get lazier, less productive. They innovate less. Prices rise.\r\n\r\nHillary Clinton's minimum wage will help some workers, but overall, it should be obvious it's a job kille. If a minimum really could increase wages without harm, why are politicians so cheap? Let's have a $1,000 minimum wage! But it's just basic economics: If you increase the price of something, people buy less of it. That applies to workers hired, not just goods.\r\n\r\nMore myths:\r\n\r\n    Prices and wages are simply &quot;set&quot; by businesses.\r\n    The rich get richer at the expense of the poor.\r\n    Price increases after natural disasters are caused by &quot;greed&quot; and should be stopped by laws against &quot;gouging.&quot;\r\n    Rent control makes housing affordable.\r\n    Business taxes are paid by business.\r\n    Supporters of free markets are &quot;pro-business&quot; and (hence) &quot;anti-consumer.&quot;\r\n\r\nThese are simple notions about economics into which our brains lazily fall. But none is true.\r\nFor example, supporters of free markets (like me) don't necessarily support business. I won 19 Emmy awards criticizing businesses. Corporations can be enemies of free markets because they don't want competition. They routinely lobby politicians to squelch it.\r\n\r\nBoudreaux says his students arrive on the first day of class thinking businesses just &quot;set&quot; prices and wages. But businesses can't do that. Companies lose customers if they price goods higher than competitors do.\r\n\r\nWages can't be set at will either. Sure, what boss wouldn't like to pay a workforce one dollar per year? But other companies need laborers too, and those that underpay lose good workers. So the bidding process continues endlessly—it's why the median household income in the U.S. is more than $50,000 a year. That wouldn't happen if bosses could just wake up and decide, &quot;Let's pay workers less!&quot;\r\n\r\nThe credit for good wages doesn't go to labor unions or politicians' passing a minimum wage, though they sure hog the credit. The credit goes to market competition and a growing economy. After all, 95 percent of workers earn more than minimum wage, and most jobs aren't unionized.\r\n\r\nPoliticians can't see the wonders that the market provides, but they somehow see everything government does as a blessing—taxes that cut into people's pay and regulations that make it more expensive to produce. They don't see that their well-intended &quot;pro-consumer&quot; rules raise prices and reduce choice.\r\n\r\nI wish more Americans learned basic economics from economists like Boudreaux—or from me! At StosselintheClassroom.org, I offer teachers free videos that illustrate economic principles and debunk myths like the ones listed above.\r\n\r\nPoliticians, on the other hand, are lousy teachers","torrent":{"xt":"urn:btih:5d60385fb2609abbd6b5e32b0b94f9fa23ee0e22","amp;dn":"Stossel.2016.01.22.Econ.Myths.720p.webrip.BREACH","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d60385fb2609abbd6b5e32b0b94f9fa23ee0e22","infoHashBuffer":{"type":"Buffer","data":[93,96,56,95,178,96,154,187,214,181,227,43,11,148,249,250,35,238,14,34]},"announce":[],"urlList":[]}}