{"title":"American_Top_40_1973_June_23rd","uid":10422662,"size":108853132,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5d8e050d9173eb3545d238bbfb2c77e94513d795&amp;dn=American_Top_40_1973_June_23rd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"RocketMan999","files":-1,"time":1403661637,"description":"&quot;You're hearing the hottest hits in the USA. My name is Casey Kasem. We broadcast from Hollywood and the countdown goes on.&quot;\n\n\nAmerican Top 40 with Casey Kasem aired on radio from July 4, 1970 until August 6, 1988. This recording is one I found on the internet.\n\nIn this countdown:\n\nA listener noticed that in 4 weeks, there were four different number one hits. She wants to know if there was ever a longer span of time with new number 1's each week. Casey says in 1963 there were six weeks each with its own new number one.\n\nThere is a song by a group that sounds different on their record than they do live because their lead singer (Gerry Rafferty) quit the band before the record became a hit.\n\nThere is a song by the star who once averaged a top 30 hit every three weeks for an entire year (in 1949 when only the top 30 were listed).\n\nBette Midler is at number 21 with her hit &quot;Boogie Woogie Bugle Boy.&quot; Casey mentions the 1941 performance of this song by the Andrews Sisters in the Bud Abbout &amp; Lou Costello film &quot;Buck Privates.&quot; It had some great original comedy bits and the Andrews Sisters sing harmonies every bit as tight as ABBA ever would. I am seeding someone else's copy of it for at least a month AND to a ratio of 30 (whichever comes last), so you can download and run with a clear conscience. Get your copy at the link provided in the notepad text.\n\nA listener asks, &quot;Has there ever been an instance where a foreign language song was represented on the chart by more than one version at the same time?&quot; Casey says this only happened once in 1959 when there were three versions of an Italian song on the chart.\n\nThree Dog Night is at number 11 with their song &quot;Shambala.&quot; Casey plays part of another song they recorded with the lead vocal being sung from the men's room for acoustic affect.\n\n40:    Doin' It To Death - Fred Wesley &amp; The J.B.'S\n39:    Satin Sheets - Jeanne Pruett\n38:    Give You Baby A Standing Ovation - The Dells        \n37:    Little Willy - The Sweet     \n36:    Let's Pretend - The Raspberries     \n35:    Stuck In The Middle With You - Stealers Wheel     \n34:    No More Mr. Nice Guy - Alice Cooper\n33:    Money - Pink Floyd\n32:    You Are The Sunshine Of My Life - Stevie Wonder\n31:    And I Love You So - Perry Como\n30:    Give It To Me - J. Geils Band\n29:    Diamond Girl - Seals &amp; Crofts    \n28:    Behind Closed Doors - Charlie Rich\n27:    So Very Hard To Go - Tower Of Power\n26:    Leaving Me - The Independents\n25:    Wildflower - Skylark\n24:    Daddy Could Swear I Declare - Gladys Knight &amp; The Pips\n23:    You'll Never Get To Heaven (If You Break My Heart) - The Stylistics\n22:    Drift Away - Dobie Gray\n21:    Boogie Woogie Bugle Boy - Bette Midler\n20:    Smoke On The Water - Deep Purple\n19:    Hocus Pocus - Focus\n18:    Tie A Yellow Ribbon 'Round The Ole Oak Tree - Dawn featuring Tony Orlando\n17:    I'm Doing Fine Now - New York City\n16:    Yesterday Once More - The Carpenters\n15:    Natural High - Bloodstone\n14:    Bad, Bad Leroy Brown - Jim Croce\n13:    Frankenstein - The Edgar Winter Group\n12:    One Of A Kind (Love Affair) - The Spinners\n11:    Shambala - Three Dog Night\n10:    Right Place, Wrong Time - Dr. Hook\n9:    Long Train Running - The Doobie Brothers\n8:    Daniel - Elton John\n7:    Kodachrome - Paul Simon\n6:    Pillow Talk - Sylvia\n5:    Give Me Love (Give Me Peace On Earth) - George Harrison\n4:    Will It Go Round In Circles - Bily Preston\n3:    I'm Gonna Love You Just A Little More Baby - Barry White\n2:    Playground In My Mind - Clint Holmes\n1:    My Love - Paul McCartney &amp; Wings\n","torrent":{"xt":"urn:btih:5d8e050d9173eb3545d238bbfb2c77e94513d795","amp;dn":"American_Top_40_1973_June_23rd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d8e050d9173eb3545d238bbfb2c77e94513d795","infoHashBuffer":{"type":"Buffer","data":[93,142,5,13,145,115,235,53,69,210,56,187,251,44,119,233,69,19,215,149]},"announce":[],"urlList":[]}}