{"title":"Tickle Chicks-------tkl086.wmv","uid":7203974,"size":516515901,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:5dfd6092d0c77ff26f32771a12ad4e0de7c67548&amp;dn=Tickle+Chicks%5C-------tkl086.wmv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1335031071,"description":"Tickle Chickstkl086.wmv\n\n\nWunder w0man (Rachel Steele) has been sent on a mission to enforce positive attitudes in the community. When she finds Addie, a rebellious citizen, spreading nasty rumors around town and behaving badly, its her duty to give her an attitude adjustment! She has captured the young w0man, tied her legs to the ceiling and spread them wide open with a spreader bar. She heard a rumor that Addie has VERY ticklish feet and knows that most young women have very ticklish inner thighs, so this is SURE to teach her a lesson! Addie is, in fact, Extrâ‚¬meLY ticklish, however she is still so negative and bad-mouthed. She sasses her superheroine elder and calls her a bitch! Wunder w0man just isnt going to stand for that! She gives the girl a good, hard tickling while lecturing her on the benefits of having a positive attitude and being a good girl. When Addie continues to respond rebelliously and make threats, Wunder w0man decides that shes going to have to REALLY torture her to get her to learn some respect. She brings out a vibrating magic wand and presses it to the outside of Addies panties. She cant close her legs, so she must endure the powerful vibrations! Instead of letting her cum, the superheroine MILF brings her close and then starts tickling her feet again. This piÂ§Â§es Addie off, but she begins to realize whos in charge. She is allowed to reach orgasm, but afterward, when asked if she will now be an upstanding citizen, she still mouths off! There is ONE more thing that may turn her around, but Wunder w0man hoped that it wouldnt come to this. Tickling AFTER orgasm. While Addie is now super relaxed and sensitive after her orgasm, she is suprised and shocked when Wunder w0man starts tickling her again, but this time more viciously than before! Now she is sensitive to the point where she can no longer take it. She begs and pleads for mercy, but Wunder w0man must hear the magic words before stopping.Are you going to have a good attitude from now on? She asks. Yes, yes! I will! Ill do anything, just stop the tickling! Addie pleads without hesitation. She has reached her limit and now must submit to Wunder w0mans wishes!\n\n\nScreens &lt;a href=&quot; http://bayimg.com/dAomDaAdC&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bayimg.com/dAomDaAdC&lt;/a&gt;\n\n\nCheers  :-)","torrent":{"xt":"urn:btih:5dfd6092d0c77ff26f32771a12ad4e0de7c67548","amp;dn":"Tickle+Chicks%5C-------tkl086.wmv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5dfd6092d0c77ff26f32771a12ad4e0de7c67548","infoHashBuffer":{"type":"Buffer","data":[93,253,96,146,208,199,127,242,111,50,119,26,18,173,78,13,231,198,117,72]},"announce":[],"urlList":[]}}