{"title":"Handbook of Fillers, Extenders, and Diluents Second Edition","uid":12426115,"size":22884993,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5e69c2778d17ef84ebb36ba1b3f14a5bfc80cf5a&amp;dn=Handbook+of+Fillers%2C+Extenders%2C+and+Diluents+Second+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1442379330,"description":"Handbook of Fillers, Extenders, and Diluents Second Edition - Michael and Irene Ash (Synapse Information Resources, 2008).pdf\n\nISBN: 978-1-934764-27-5\n\nUse this comprehensive resource and find answers to questions like: What fillers what fillers are safe to use in tablets and capsules for pharmaceuticals? What fillers are available for a tire application? What extenders are suitable for a specific paint or coating application? What diluents will satisfy requirements for an adhesive formulation? This is the first update of this important reference in nine years. It describes more than 3000 trade names, generic chemicals, and materials that serve the dual functions of lowering the overall cost and improving the effectiveness of the end products to which they are added. The distinction between fillers, extenders, and diluents varies from industry to industry In the paper industry they are used to improve brightness, increase opacity, and reduce porosity. In paints, often referred to as inerts, extenders, and supplemental pigments, they are used to increase color, hiding power, weatherability and control viscosity. Fillers in plastics and polymers impart impact strength, lubricity, electrical and thermal properties. Diluents, besides supplying bulk to detergents, cosmetics, and pharmaceuticals, act to adjust dose or concentration. In general, they share essential commercial functions increasing the bulk weight of products, diluting expensive materials, and/or acting as delivery systems for active ingredients. This group of products, therefore, is treated in this single reference source","torrent":{"xt":"urn:btih:5e69c2778d17ef84ebb36ba1b3f14a5bfc80cf5a","amp;dn":"Handbook+of+Fillers%2C+Extenders%2C+and+Diluents+Second+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e69c2778d17ef84ebb36ba1b3f14a5bfc80cf5a","infoHashBuffer":{"type":"Buffer","data":[94,105,194,119,141,23,239,132,235,179,107,161,179,241,74,91,252,128,207,90]},"announce":[],"urlList":[]}}