{"title":"Matthew Barney - Cremaster 2 (1999)","uid":3737733,"size":734510821,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5e827f3351c2b296da72e02776eda4b5f0d61035&amp;dn=Matthew+Barney+-+Cremaster+2+%281999%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Beksinski","files":4,"time":1184073306,"description":"Title: Cremaster 2\nDirector: Matthew Barney\nYear: 1999\nLanguage: English\nSubtitles: n/a\nSize: 700 MB (or 717,212 KB or 734,425,088 bytes)\nVideo Codec: Xvid\nVideo Bitrate: 1024 kb/s\nResolution: 720x376 (1.91:1) [~23:12]\nQf: 0.126 bits/pixel\nFramerate: 29.970\nAudio Specs: 0x0055(MP3) ID&amp;#039;d as MPEG-1 Layer 3\nAudio Bitrate: 200 kb/s (100/ch, stereo) VBR \nFs: 48000 Hz\nRuntime: 01:19:23 (142,735 fr)\nSource: DVD\n\nDescription: CREMASTER 2 is rendered as a gothic Western that introduces conflict into the system. On the biological level it corresponds to the phase of fetal development during which sexual division begins. In Matthew Barney&amp;#039;s abstraction of this process, the system resists partition and tries to remain in the state of equilibrium imagined in Cremaster 1. Cremaster 2 embodies this regressive impulse through its looping narrative, moving from 1977, the year of Gary Gilmore&amp;#039;s execution, to 1893, when Harry Houdini, who may have been Gilmore&amp;#039;s grandfather, performed at the World&amp;#039;s Columbian Exposition. The film is structured around three interrelated themes - the landscape as witness, the story of Gilmore (played by Barney), and the life of bees - that metaphorically describe the potential of moving backward in order to escape one&amp;#039;s destiny. Both Gilmore&amp;#039;s kinship to Houdini (played by Norman Mailer) and his correlation with the male bee are established in the seance/conception scene in the beginning of the film, during which Houdini&amp;#039;s spirit is summoned and Gilmore&amp;#039;s father expires after fertilizing his wife. Gilmore&amp;#039;s sense of his own doomed role as drone is expressed in the ensuing sequence in a recording studio where Dave Lombardo, former drummer of Slayer, is playing a solo to the sound of swarming bees. A man shrouded by bees with the voice of Steve Tucker, lead vocalist of Morbid Angel, growls into a telephone. Collectively these figures allude to Johnny Cash, who is said to have called Gilmore on the night of his execution in response to the convict&amp;#039;s dying wish.\n     Barney depicts Gilmore&amp;#039;s murder of a Mormon gas station attendant in both sculptural and dramatic forms. Inferring that Gilmore killed out of a longing for union with his girlfriend, Nicole Baker, he represents their relationship through two conjoined cars: the blue and the white 1966 Mustangs that they coincidentally both owned. In the murder sequence, Gilmore shoots his victim in the back of the head. This act sets in motion the trial and verdict that will condemn him to death, a sentence he embraces despite all efforts to overturn it. Barney stages the judgment of Gilmore in the Mormon Tabernacle Choir. Gilmore welcomes death, refusing to appeal his sentence and opting for execution by firing squad, in a literal interpretation of the Mormon belief that blood must be shed in order for a sinner to obtain salvation. His execution is staged as a prison rodeo in a cast-salt arena in the middle of the flooded Bonneville Salt Flats. Gilmore is lowered onto a bull and he rides to his death. In Barney&amp;#039;s interpretation of the execution, Gilmore was less interested in attaining Mormon redemption than in performing a chronological two-step that would return him to the space of his alleged grandfather, Houdini, with whom he identified the notion of freedom through self-transformation. Seeking escape from his fate, he chose death in an act of ultimate self-will. Gilmore&amp;#039;s metaphoric transportation back to the turn of the century is rendered in a dance sequence featuring the Texas two-step. The film ends in the Columbian Exposition hall where Houdini is approached by Gilmore&amp;#039;s grandmother Baby Fay La Foe who will seduce him, an act that sets in motion the circular narrative of Cremaster 2. &lt;a href=&quot;\nhttp://www.cremaster.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cremaster.net/&lt;/a&gt;\n\n\n********************************* FREAKYFLICKS **********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing\ncinematic art in the digital era. Our goal is to disseminate such works of art\nto the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional\nrole in the history of cinema and its progression in becoming a great art. Films\nthat are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate\nin our community. All you need do is include this tag in your upload and join us\nat the forum to announce your release.\n\n\t\t &lt;a href=&quot;\thttp://www.freakyflicks.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://www.freakyflicks.tk&lt;/a&gt;\n\n\t\t &lt;a href=&quot;\thttp://freakyflicks.proboards54.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://freakyflicks.proboards54.com/&lt;/a&gt;\n\n&amp;#039;If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&amp;#039;","torrent":{"xt":"urn:btih:5e827f3351c2b296da72e02776eda4b5f0d61035","amp;dn":"Matthew+Barney+-+Cremaster+2+%281999%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e827f3351c2b296da72e02776eda4b5f0d61035","infoHashBuffer":{"type":"Buffer","data":[94,130,127,51,81,194,178,150,218,114,224,39,118,237,164,181,240,214,16,53]},"announce":[],"urlList":[]}}