{"title":"Game Keeper Omnibus (2011 SC TPB) (Pudgy-Novus Year One) [NVS-D]","uid":9107080,"size":266874977,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:5ec2ce8d968e48dc5e5d1eb49147ec86741b44f9&amp;dn=Game+Keeper+Omnibus+%282011+SC+TPB%29+%28Pudgy-Novus+Year+One%29+%5BNVS-D%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackcanary","files":-1,"time":1382901219,"description":"English | CBR | 262 Pages\n\nGuy Ritchie's Game Keeper Omnibus\nPublisher:  Dynamite Entertainment\nPublication Date:  April 20, 2011\n\nWriters:  Guy Ritchie, Andy Diggle, and Jeff Parker\nArtists:  Mukesh Singh, Ron Randall, and Ron Chan\nColorists:  Mukesh Singh and S. Sundarakannan\nLetterers:  Ravikiran B. S., Nilesh S. Mahadik, Rakesh B. Mahadik, and Sudhir B. Pisal\nCover Artists:  John Cassaday with Laura Martin\n\nAn original graphic novel created by filmmaker Guy Ritchie, (Lock, Stock &amp; Two Smoking Barrels, Snatch, and Sherlock Holmes). Now in development as a feature film with Warner Bros. and Joel Silver (producer of The Matrix Trilogy)! Collecting issues #1-10 from the comic book series and featuring and introduction by Guy Ritchie. For ten years he has lived a lie, telling himself that he nurtures life, when once he merely took it. But only now does he finally embrace the truth...that he is closer to the wild than he is to his own humanity. He is nature's remedy to man's disease. The man known only as Brock lives a quiet existence as gamekeeper a secluded Scottish estate, until paramilitary mercenaries storm the estate and kill Jonah Morgan - the owner and Brock's friend. Now, Brock faces his dark past and the events he had sworn he'd forget. Obliged to avenge Jonah's death, Brock must leave his tranquil life and journey deep into an unfamiliar, urban underworld. But as he gets pulled in deeper, it's difficult to tell who has more power, Brock, the man, or the animal within.\n\nThanks goes to Pudgy for this release.\n\nDon't know how to view this comic book?  Use CDisplayEx or another comic book reader application. &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8956400&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8956400&lt;/a&gt;","torrent":{"xt":"urn:btih:5ec2ce8d968e48dc5e5d1eb49147ec86741b44f9","amp;dn":"Game+Keeper+Omnibus+%282011+SC+TPB%29+%28Pudgy-Novus+Year+One%29+%5BNVS-D%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ec2ce8d968e48dc5e5d1eb49147ec86741b44f9","infoHashBuffer":{"type":"Buffer","data":[94,194,206,141,150,142,72,220,94,93,30,180,145,71,236,134,116,27,68,249]},"announce":[],"urlList":[]}}