{"title":"Monty Python's Flying Circus, Season 1 [Part I]","uid":3273092,"size":691081216,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5f15df2295588a4f53eebe58f28a80ecb9e6d113&amp;dn=Monty+Python%5C%27s+Flying+Circus%2C+Season+1+%5BPart+I%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pippin","files":3,"time":1104884383,"description":"From Amazon.com:\n\nIn 1969, five overeducated British comics and an American illustrator invaded the homes of unsuspecting BBC viewers with a brand of comedy that was, at the very least, odd. &amp;quot;Absurd,&amp;quot; &amp;quot;bizarre,&amp;quot; and &amp;quot;incomprehensible&amp;quot; are other descriptions that jump to mind. Nonetheless, this wacky sextet inaugurated an absurd tradition that continued through three and a half seasons of half-hour TV episodes, a series of live performances, a handful of movies, and a legacy of dead parrots and upper-class twits. Monty Python's Flying Circus, Set 1 features the first episodes foisted on a still-reeling public, introducing running gags (&amp;quot;And now for something completely different&amp;quot;) and recurring characters (an armor-clad Terry Gilliam wielding a rubber chicken, Graham Chapman's pompous Colonel intruding on sketches he deems simply too silly, and of course Michael Palin's &amp;quot;It's a Man&amp;quot; wandered through the entire season). Among the sketch highlights in the first three shows are Nudge Nudge, the Funniest Joke in the World, How to Defend Yourself from a Man Attacking You with Fresh Fruit, Confuse a Cat, and The Dull Life of a City Stockbroker, all interspersed with various and sundry cut-out animation sequences by Terry Gilliam. These early episodes may lack the consistency and stream-of-consciousness flow of their later, more assured work, but they're packed with some of the most memorable moments of the group's brief but brilliant history.\n\nThis is the first 3 episodes - last three coming soon. They have been encoded to fit on 1 cd. I have 39 episodes and if the interest is there, I'll upload them but I can only do roughly 3 at a time due to lack of HD space.\n\nEnjoy.","torrent":{"xt":"urn:btih:5f15df2295588a4f53eebe58f28a80ecb9e6d113","amp;dn":"Monty+Python%5C%27s+Flying+Circus%2C+Season+1+%5BPart+I%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f15df2295588a4f53eebe58f28a80ecb9e6d113","infoHashBuffer":{"type":"Buffer","data":[95,21,223,34,149,88,138,79,83,238,190,88,242,138,128,236,185,230,209,19]},"announce":[],"urlList":[]}}