{"title":"Rubicon1X01.HDTV.Xvid.Spanish.By.Ainhdesi","uid":6022276,"size":399822044,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5fb98e51184d4123402c4d8d87cfa5f3ed821c92&amp;dn=Rubicon1X01.HDTV.Xvid.Spanish.By.Ainhdesi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ainhdesi","files":3,"time":1291835423,"description":"1X01 - Piloto\n\n'Rubicon' es una serie creada y producida por (Pentagon Papers, Medical Investigation) para el canal americano AMC con James Badge Dale ('The Departed'), Lili Taylor ('A dos metros bajo tierra', 'High Fidelity'), Dallas Roberts ('Walk the Line', 'Flicka', 'The L Word'), Jessica Collins ('The Nine', 'C.S.I.'), Christopher Evan Welch ('Vicky Cristina Barcelona'), Lauren Hodges ('Ley y orden'), Paul Butler ('The Insider', 'Reign Over Me') with Arliss Howard ('Full Metal Jacket', 'Natural Born Killers', 'The Sandlot') y Miranda Richardson ('Sleepy Hollow') en el elenco.\nÃ‚Â¿La supersticiÃƒÂ³n es un medio de sentirse vivo reconociendo a priori la presencia constante de un peligro? Ã‚Â¿O es un simple juego del espÃƒÂ­ritu que consiste en conceder sentido a acontecimientos que no tienen ninguno? En ambos casos, lo primero tuvo relaciÃƒÂ³n con la existencia y con lo imaginario, luego con la articulaciÃƒÂ³n de uno en el otro. SegÃƒÂºn los individuos, esta articulaciÃƒÂ³n puede ser flexible o extremadamente rÃƒÂ­gida, pero es bastante comÃƒÂºn en casi todos ellos.\n'Rubicon', la serie de AMC, es una sumersiÃƒÂ³n en la paranoia colectiva americana con una variaciÃƒÂ³n sobre el tema del complot, doblegado bajo la forma de un bonito rompecabezas cuyas piezas son distribuidas con cuidado y parsimonia. La advertencia que sirve de prÃƒÂ³logo para el primer episodio titulado Gone in the Teeth es clara: 'Un imperio invisible ha sido establecido bajo la forma de la democracia'.\nYa antes de ver la primera escena, sentimos en nuestras nucas la amenaza de sufrir un ataque de triscaidecafobia, afecciÃƒÂ³n de la que es vÃƒÂ­ctima David Hadas, un analista de una agencia federal, con base en Nueva York. Para despistados un anexo: La triscaidecafobia es el miedo irracional al nÃƒÂºmero 13. Se considera normalmente una supersticiÃƒÂ³n. La fobia especÃƒÂ­fica al viernes 13 se llama paraskavedekatriafobia o friggatriscaidecafobia, mientras que la fobia al martes 13 se llama trezidavomartiofobia.\nAdemÃƒÂ¡s de lo que le ocurre con el nÃƒÂºmero 13, David alimenta un montÃƒÂ³n de supersticiones. Una escoba estÃƒÂ¡ enganchada a la pared de su oficina porque un empleado del servicio de mantenimiento frotÃƒÂ³, sin querer, su zapato con ella. Este ritual sirve para apartar la mala suerte que puede llevarle a la muerte. A pesar de la seriedad que muestra David con respecto a este gÃƒÂ©nero de cosas, tenemos ganas de burlarnos amablemente de ÃƒÂ©l. Hasta que ÃƒÂ©l fallece en un accidente ferroviario el dÃƒÂ­a siguiente y que se encuentra su coche aparcado sobre el estacionamiento nÃƒÂºmero 13 del aparcamiento de coches de la estaciÃƒÂ³n. Su yerno, Will Travers, que trabajaba con ÃƒÂ©l, estÃƒÂ¡ convencido que no puede tratarse de un error. Su suegro nunca habrÃƒÂ­a dejado su vehÃƒÂ­culo en este lugar, no habrÃƒÂ­a cometido tal atolondramiento. El coche ha sido desplazado necesariamente despuÃƒÂ©s del accidente.\nWill (James Badge Dale, 'The Pacific') es una especie de pequeÃƒÂ±o genio. Resuelve enigmas, 'rompe cÃƒÂ³digos', levanta el velo sobre misterios y complots con los cuales nadie mÃƒÂ¡s podrÃƒÂ­a enfrentarse. AsÃƒÂ­, en vÃƒÂ­speras de la muerte de David, anotÃƒÂ³ que cuatro enrejados de crucigramas, publicados por varios periÃƒÂ³dicos, poseÃƒÂ­an correspondencias, exactamente como las cuatro hojas de un trÃƒÂ©bol, simbolizando los tres tipos de poder tradicionales (ejecutivos, legislativos y judiciales) mÃƒÂ¡s el cuarto identificado. Justamente uno de los crucigramas incluye marsilea quadrifolia, nombre en latÃƒÂ­n del trÃƒÂ©bol de cuatro hojas, a menudo considerado como un amuleto. ","torrent":{"xt":"urn:btih:5fb98e51184d4123402c4d8d87cfa5f3ed821c92","amp;dn":"Rubicon1X01.HDTV.Xvid.Spanish.By.Ainhdesi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fb98e51184d4123402c4d8d87cfa5f3ed821c92","infoHashBuffer":{"type":"Buffer","data":[95,185,142,81,24,77,65,35,64,44,77,141,135,207,165,243,237,130,28,146]},"announce":[],"urlList":[]}}