{"title":"The Ocean Blue - Ultramarine (2013) [FLAC]","uid":8291718,"size":322875091,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5fe34a77045f9c8532528767d47ce995f3bf480e&amp;dn=The+Ocean+Blue+-+Ultramarine+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1364059313,"description":"\n  The Ocean Blue - Ultramarine (2013) [FLAC]\n\n  Released: 2013\n  Duration: 43:59\n  Genre: Pop/Rock\n  Style: Alternative, Dream Pop, Indie\n  Source: WEB\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 Give it a Try \n  02 Sad Night, Where Is Morning?\n  03 New York 6AM \n  04 Blow My Mind \n  05 Latin Blues \n  06 Fast Forward Reverse \n  07 A Rose is a Rose\n  08 If You Don't Know Why \n  09 Sunset - Moonrise \n  10 Whatever You Say, it Breaks My Heart \n  11 Ground Gives Way \n  12 Touch Down on Earth\n\n  The Ocean Blue's first full album of new material since 1999's Davy Jones' Locker, 2013's Ultramarine, is a mature, bittersweet collection of melodic guitar and synth-driven pop that ranks among the best of the band's work. What's kind of a revelation here is that The Ocean Blue, who had their biggest success in the late '80 and '90s with such alt-rock hits as &quot;Drifting, Falling&quot; and &quot;Ballerina Out of Control,&quot; haven't really attempted to tinker with or contemporize their sound. Essentially, the album picks up on the immaculately crafted sound the band showcased on its 2005 comeback EP, Waterworks. Much like that album, tracks here such as &quot;Sad Night, Where Is Morning?&quot; and &quot;Sunset-Moonrise&quot; mix melodic Peter Hook-style basslines, shimmery synthesizer backgrounds, and sparkling guitar parts in much the same way as they've always done. In the past, the youthful band, which was signed by Sire Records while the members were still in high school, often drew criticism as a slavish imitator of its influences, including groups like New Order and the Smiths. \n\n  Ultramarine reveals The Ocean Blue to have matured into a more assured ensemble, whose melodic lyricism and post-new wave poignancy now sound almost classicist in tone. It also doesn't hurt that lead singer/songwriter David Schelzel has developed into a confident singer, with a weightier vocal presence on record. In that sense, the album repositions them less as '80s-'90s also-rans, and more as journeymen and melodic pop stalwarts, much in the same way that acts like Teenage Fanclub, Belle &amp; Sebastian, and former Smashing Pumpkins guitarist James Iha have forged careers around their humble but indisputably well-crafted albums. However, Ultramarine isn't just a return to form; it's one of The Ocean Blue's best albums.","torrent":{"xt":"urn:btih:5fe34a77045f9c8532528767d47ce995f3bf480e","amp;dn":"The+Ocean+Blue+-+Ultramarine+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fe34a77045f9c8532528767d47ce995f3bf480e","infoHashBuffer":{"type":"Buffer","data":[95,227,74,119,4,95,156,133,50,82,135,103,212,124,233,149,243,191,72,14]},"announce":[],"urlList":[]}}