{"title":"Dick Dale And His Del-Tones - Greatest Hits 1961-1976 (1992)","uid":8400524,"size":367582836,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6243f0bef57643bd746301b47a7426ad35d84f97&amp;dn=Dick+Dale+And+His+Del-Tones+-+Greatest+Hits+1961-1976+%281992%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":36,"time":1366682991,"description":"This is the same torrent that was uploaded to Demonoid in September 2008.\n\n\nDick Dale And His Del-Tones - Greatest Hits 1961-1976 (1992)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/510B23YKFSL._SL500_AA240_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/510B23YKFSL._SL500_AA240_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nTracks have full tags (including embedded thumbnail).\nAll artwork in jpgs at 300 d.p.i. Rotated and cropped losslessly using jpegcrop. (Includes 9 page folder.)\nAMG Bio.txt\nAMG Review.txt\nNotes.txt (which is simply these notes included in the torrent)\n\nBio Excerpt from All Music:\n\nDick Dale wasn't nicknamed &quot;King of the Surf Guitar&quot; for nothing: he pretty much invented the style single-handedly, and no matter who copied or expanded upon his blueprint, he remained the fieriest, most technically gifted musician the genre ever produced. Dale's pioneering use of Middle Eastern and Eastern European melodies (learned organically through his familial heritage) was among the first in any genre of American popular music, and predated the teaching of such &quot;exotic&quot; scales in guitar-shredder academies by two decades. The breakneck speed of his single-note staccato picking technique was unrivalled until it entered the repertoires of metal virtuosos like Eddie Van Halen, and his wild showmanship made an enormous impression on the young Jimi Hendrix. But those aren't the only reasons Dale was once called the father of heavy metal. Working closely with the Fender company, Dale continually pushed the limits of electric amplification technology, helping to develop new equipment that was capable of producing the thick, clearly defined tones he heard in his head, at the previously undreamed-of volumes he demanded. He also pioneered the use of portable reverb effects, creating a signature sonic texture for surf instrumentals. And, if all that weren't enough, Dale managed to redefine his instrument while essentially playing it upside-down and backwards -- he switched sides in order to play left-handed, but without re-stringing it (as Hendrix later did). ...\n\nTo read the entire bio: &lt;a href=&quot; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:kifqxqe5ld6e~T1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:kifqxqe5ld6e~T1&lt;/a&gt;\n\nAll Music Album Review:\n\nThe records Dick Dale made with a shifting lineup of Del-Tones during the early '60s simultaneously defined surf music and redefined rock &amp; roll. The guitarist's tone, a rapid-fire, six-string staccato snarl drenched in Fender reverb, remains one of the most instantly recognizable sounds in all of popular music. Though this Greatest Hits collection from GNP Crescendo spans the years 1961-1976, the fact is that Dale's career was greatly curtailed upon being diagnosed with cancer in 1966. Though he performed sporadically during the 1970s, he would not record again until the late '80s. The bulk of the set, then, is drawn from the albums Surfer's Choice (1962) and Checkered Flag (1963), Dale's first and third outings for Capitol Records. Included are &quot;Let's Go Trippin',&quot; the first surf instrumental ever recorded, and other classic bursts of guitar adrenaline like &quot;Surf Beat,&quot; &quot;The Victor,&quot; &quot;Mr. Eliminator,&quot; &quot;Night Rider,&quot; &quot;The Wedge,&quot; and &quot;Miserlou.&quot; The latter, the guitarist's finest recorded moment, is a six-string performance for the ages. Dale's lines seem almost too fast and manic for the music to handle, threatening at nearly every point to break through the song itself. Unfortunately, the vocal performances that make up a third of Greatest Hits are not nearly as impressive as the early, seminal instrumentals, ushering Dale's guitar to the sidelines. Still, while Rhino's Better Shred Than Dead may be more definitive (GNP misses &quot;Shake 'N' Stomp&quot; and &quot;Take It Off,&quot; for example), this is a fine single disc that contains most of the essentials.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:hnftxqtgldae&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:hnftxqtgldae&lt;/a&gt;\n\nReviews and samples at Amazon: &lt;a href=&quot; http://www.amazon.com/dp/B000001OV4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B000001OV4&lt;/a&gt;\n\nTrack List:\n\n01. The Scavenger\n02. Surf Buggy\n03. Hot Rod Racer\n04. Misirlou\n05. Surf Beat\n06. Grudge Run\n07. The Victor\n08. Peppermint Man\n09. Mr. Eliminator\n10. Surfing Drums\n11. Mag Wheels\n12. Sloop John B\n13. Night Rider\n14. Let's Go Trippin'\n15. King of the Surf Guitar\n16. The Wedge\n17. Those Memories of You\n18. Del-Tone Rock\n19. Death of a Gremmie\n20. Get Back the Feelin'\n21. Peter Gunn\n\n","torrent":{"xt":"urn:btih:6243f0bef57643bd746301b47a7426ad35d84f97","amp;dn":"Dick+Dale+And+His+Del-Tones+-+Greatest+Hits+1961-1976+%281992%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6243f0bef57643bd746301b47a7426ad35d84f97","infoHashBuffer":{"type":"Buffer","data":[98,67,240,190,245,118,67,189,116,99,1,180,122,116,38,173,53,216,79,151]},"announce":[],"urlList":[]}}