{"title":"Lalola 1x42[DVB][Spansih].avi","uid":4377737,"size":366770176,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6274994375bfc81cbf138f817a3432fb83760f6c&amp;dn=Lalola+1x42%5BDVB%5D%5BSpansih%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"webchella","files":1,"time":1220495174,"description":"Sinopsis\nNatalia, celosa, amenaza a Lola con conseguir su despido si sigue acosando a Sergio. Mientras, todos los empleados de la agencia sufren las consecuencias del reportaje, realizado por el equipo de periodistas.\n\nEn el reportaje tambiÃƒÂ©n aparece cÃƒÂ³mo Lola admite estar enamorada de Sergio y Romina, que tambiÃƒÂ©n lo vio, se alegra. Lola y Sergio se encuentran en el ascensor y ella se niega a reconocer lo que saliÃƒÂ³ en la televisiÃƒÂ³n, pues lo achaca a un montaje. SofÃƒÂ­a tambiÃƒÂ©n estÃƒÂ¡ enfadada con Pato, pero a Victoria parece no importarle las declaraciones machistas de Gustavo.\n\nAguirre, que ha pillado a Carol con Mateo, le dice a su mujer que el pacto de divorcio acordado no se va a realizar, sino que se van a endurecer las condiciones, a pesar de que Carol le confiesa que conocÃƒÂ­a a Mateo desde antes de conocerle a ÃƒÂ©l. Mateo y Aguirre se pelean y Mateo le amenaza diciendo que, junto a Carol, tiene el control de la agencia.\n\nEl comisario le dice a Paula que ya han averiguado la identidad de Federico. Mientras, Aguirre se auto invita a cenar a casa de Lola y cuando llega Paula lo confunde con Federico y le atiza con un frutero. Cuando ÃƒÂ©l se va suena de nuevo la puerta y aparece Federico. ","torrent":{"xt":"urn:btih:6274994375bfc81cbf138f817a3432fb83760f6c","amp;dn":"Lalola+1x42%5BDVB%5D%5BSpansih%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6274994375bfc81cbf138f817a3432fb83760f6c","infoHashBuffer":{"type":"Buffer","data":[98,116,153,67,117,191,200,28,191,19,143,129,122,52,50,251,131,118,15,108]},"announce":[],"urlList":[]}}