{"title":"Avatar Media Pack 2.0 - HD Music, Trailers, Wallpapers - Games -","uid":5290123,"size":6193876554,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:635b843cca3f6422e8fe9e82c8a02fd0bd13c1d8&amp;dn=Avatar+Media+Pack+2.0+-+HD+Music%2C+Trailers%2C+Wallpapers+-+Games+-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Rewt528491","files":373,"time":1263869713,"description":"AVATAR MEDIA PACK 2.0\n\nThis has about 4GB MORE brand new data compared to my first release.\n\nThis has all the same data as my first release, with the following being the BRAND NEW additions!!!!\n\nAvatar - Creating the World of Pandora BEHIND THE SCENES 1080p HD!!! This aired on FX on Saturday\n\nSNL S35E12 hosted by Sigourney Weaver with special guest James Cameron in a segment parodying every single one of his major movies, and a skit parodying the love scene in Avatar. This is the whole episode ripped from an HD source.\n\nTwo Colbert Report Episodes where Stephen Colbert talks Avatar. Also Ripped from HD\n\nThe Daily Show with Jon Stewart with guest Sigourney Weaver where they talk Avatar\n\nThe New Avatar Screenplay Script PDF\n\nThe COMPLETE Trailer Music for Avatar. Two new FLAC songs were added that are songs from the 28 Weeks Later Soundtrack. They were played in the Teaser Trailer. The songs are:\nAudiomachine - Akkadian Empire\nAudiomachine - Akkadian Empire (Drums Only)\nAudiomachine - Akkadian Empire (No Choir)\nAudiomachine - Guardians at the Gate\nAudiomachine - Guardians at the Gate (No Choir)\nSteve Jablonsky - My Name is Lincoln FLAC FORMAT\nJohn Murphy - Helicopter Mayhem FLAC FORMAT\nJohn Murphy - Crowd Breaks Out FLAC FORMAT\n\nNEW Avatar HD Trailer Featurette\n\nHBO First Look Behind the Scenes Special on Avatar HD ripped\n\n60 minutes Episode with an Interview with James Cameron\n\nG4TV Interview with James Cameron on the Avatar Game and future of Gaming\n\nThe Entire 67th Golden Globes Awards\n\nBackstage Golden Globes Press Conference with James Cameron and cast of Avatar\n\nMP3 File with James Cameron answering a question about plot similarities between Avatar and other films and books\n\nAvatar Nintendo DS Game US version rom (WORKS! Confirmed it with my CycloDS Evolution on my DS Lite..beat the game too...hard game but fun)\n\nNEW HD Wallpapers made from the HD Avatar Trailers\n\nA Collection of Animated Avatar GIFs and JPEGs (didn't know jpeg supported animation but there they are...)\n\nAvatar the Game PC Demo\n\nLeona Lewis Avatar Theme Song &quot;I See You&quot; Music Video HD Rip\n\nLeona Lewis Avatar Theme Song &quot;I See You&quot; Music Video 1280p (slightly better quality than the above. Smaller file size so I left both in there)\n\nLeona Lewis - Making of &quot;I See You&quot; Music Video 1280p\n\nAvatar Official Soundtrack in FLAC format composed by James Horner\n\nThe Avatar Scriptment (aka Project 880)...the original material James Cameron wrote in PDF Format\n\nHD Teaser and Final Trailers (1280p)\n\nAnd My personal High Definition Scan and photoshop touch ups of Entertainment Weekly's Feature Article on AVATAR. This is a BRAND NEW Scan that I personally did and I personally photoshopped all of them to correct the colors, fixed some 'errors' the scanner made, etc. All scans are 2320x3120 resolution (or approximately 7.2 megapixel scans). All jpegs are uncompressed full scan resolution.\n\nI think I covered all the files that are in this... Enjoy!!! Please seed at least 100%...preferably 150%.\n\nIf you do not want to download any of the same files again, do target downloads.","torrent":{"xt":"urn:btih:635b843cca3f6422e8fe9e82c8a02fd0bd13c1d8","amp;dn":"Avatar+Media+Pack+2.0+-+HD+Music%2C+Trailers%2C+Wallpapers+-+Games+-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"635b843cca3f6422e8fe9e82c8a02fd0bd13c1d8","infoHashBuffer":{"type":"Buffer","data":[99,91,132,60,202,63,100,34,232,254,158,130,200,160,47,208,189,19,193,216]},"announce":[],"urlList":[]}}