{"title":"The Throne of Fire - Rick Riordan - Kane Chronicles - (.mobi)","uid":8007048,"size":791812,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:63c2412a34165f4bbb069d1bc19b8a88b524245c&amp;dn=The+Throne+of+Fire+-+Rick+Riordan+-+Kane+Chronicles+-+%28.mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NamPr05","files":1,"time":1357914822,"description":"Ever since the gods of Ancient Egypt were unleashed in the modern world, Carter Kane and his sister Sadie have been in trouble. As descendants of the House of Life, the Kanes have some powers at their command, but the devious gods haven't given them much time to master their skills at Brooklyn House, which has become a training ground for young magicians. \n\nAnd now their most threatening enemy yet - the chaos snake Apophis - is rising. If they don't prevent him from breaking free in a few days' time, the world will come to an end. In other words, it's a typical week for the Kane family.\n\nTo have any chance of battling the Forces of Chaos, the Kanes must revive the sun god Ra. But that would be a feat more powerful than any magician has ever accomplished. \n\nFirst they have to search the world for the three sections of the Book of Ra, then they have to learn how to chant its spells. Oh, and did we mention that no one knows where Ra is exactly?\n\nNarrated in two different wisecracking voices, featuring a large cast of new and unforgettable characters, and with adventures spanning the globe, this second installment in the Kane Chronicles is nothing short of a thrill ride.\n\n","torrent":{"xt":"urn:btih:63c2412a34165f4bbb069d1bc19b8a88b524245c","amp;dn":"The+Throne+of+Fire+-+Rick+Riordan+-+Kane+Chronicles+-+%28.mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63c2412a34165f4bbb069d1bc19b8a88b524245c","infoHashBuffer":{"type":"Buffer","data":[99,194,65,42,52,22,95,75,187,6,157,27,193,155,138,136,181,36,36,92]},"announce":[],"urlList":[]}}