{"title":"Terabyte Image for Windows 2.76","uid":7735944,"size":12169256,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6444e08105fb5c13308f8d8f29438953f896dd46&amp;dn=Terabyte+Image+for+Windows+2.76&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wallpwallpapers","files":-1,"time":1350487183,"description":"Image for Windows is an affordable, reliable drive image backup and restore solution that provides an easy and convenient way to completely backup all your hard drive's data and operating systems. Your backups can be saved directly to external USB and FireWireâ„¢ drives, to internal or network drives, and even directly to CD or DVD. The Image for Windows package includes an easy-to-use MakeDisk wizard for creating a recovery boot disk. To restore your data and operating systems back to the way they were when the backup was created, simply boot the recovery disk and restore the partition(s) or drive(s) you need to recover. It's that easy.\n\nFeatures:\n* Total Reliability - allows you to check each and every byte it backs up.\n* Convenience - Runs directly from Windows and when used with the addition PHYLock â„¢, create a true image of the Windows partition itself, without requiring a reboot.\n* Security - Your backups can be secured using simple password protection, or full 256-bit encryption AES.\n* Backup Changed Data - Differential backup option allows you to backup only data that has changed since the last full backup was created.\n* Simple, Wizard-Driven interface - handy for the first time and every time.\n* Maximum Compression - By default, compression is applied to the drive images you create.\n* Maximum Speed ??- If backup speed is paramount, you can bypass compression entirely.\n* Optical Drive Support - You can save directly to a CD, DVD, DVD-DL.\n* Bootable Rescue Discs - whenever you save directly to a CD, DVD, DVD-DL, it will automatically become a bootable restore disc.\n* Restore Individual Files or Folders - Using the free add TBIView, you can view the contents of files, and optionally restore individual files or folders.\n* Compatibility - Automatically recognizes and supports the area used FAT16, FAT32, NTFS, Ext2, Ext3, ReiserFS, and separation of XFS. Partitions with other file system types can be supported fully. Supports all standard partitions in an MBR, EMBR, or GPT\n* Windows Servers - Supports both Workstation and Server Windows.\n* Cost Effectiveness - Includes Image for DOS and Image for Linux, making it a uniquely affordable and complete disk imaging solution.\n* Flexibility - Restore partitions, regardless of the file system on the partition being restored. This allows you to restore NTFS partitions from Windows 98 or even DOS.\n* Wide-Ranging Device Support - Compatible with USB 2 and IEEE 1394 external drives. Image for DOS supports these drives directly, without requiring complicated driver installation. (Image for Windows simply uses the drivers already available under Windows).\n\nInstall:\n\n- run application\n- use keygen","torrent":{"xt":"urn:btih:6444e08105fb5c13308f8d8f29438953f896dd46","amp;dn":"Terabyte+Image+for+Windows+2.76","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6444e08105fb5c13308f8d8f29438953f896dd46","infoHashBuffer":{"type":"Buffer","data":[100,68,224,129,5,251,92,19,48,143,141,143,41,67,137,83,248,150,221,70]},"announce":[],"urlList":[]}}