{"title":"The Anthony Cumia Show 2015-03-19 MP4 MP3 combo","uid":11766149,"size":329526007,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:64820bb3b743d7e8e7bde98e6dbcd669f5cf746d&amp;dn=The+Anthony+Cumia+Show+2015-03-19+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mothergoose58","files":2,"time":1426860580,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest(s): &quot;Back in Time&quot; film-makers\n\nEpisode 130 &quot;TACS to the Future&quot;: As another TACS week comes to a close, Ant talks about his evening at Dennis Hof's book release party, Bobo's show taping yesterday, he checks out some of the lovely ladies from the Moonlite BunnyRanch as well as the Chicken Ranch, and KtC recalls a hairy situation at the Chicken Ranch. We get a follow-up on the &quot;gun store&quot; (propaganda) video, watch a &quot;lemonade liberation&quot; video (that Ant doesn't quite &quot;get&quot;), see a man being fucked over by an off duty officer, hear feedback from the callers, and listen to three new entries in the &quot;Most Offensive Song&quot; contest. Ant reads a news story on hangover-free booze, plays a news clip about an odd stabbing, and relocates to the poker table to meet with the filmmakers of the documentary &quot;Back in Time&quot;. The guys talk about being inspired by a DeLorean, deciding to make a movie based on the impact &quot;Back to the Future&quot; had, the research involved in it, and what they learned from the interviews compiled. They also talk about what they thought 2015 would look like 30 years ago, parties that will be held on the films anniversary, their plans for releasing &quot;Back in Time&quot;, and some of the players from &quot;Back to the Future&quot; not participating in the making of their documentary. They then chat about &quot;Back to the Future&quot; at Universal Studios, show some items you can claim on their Kickstarter by supporting, the importance of fundraising platforms, they break down &quot;Back to the Future III&quot;, and Ant reminds everyone about the live stream from the No Limits Tattoo Show. You can get all of the info on the documentary at www.BackInTimeFilm.com.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:64820bb3b743d7e8e7bde98e6dbcd669f5cf746d","amp;dn":"The+Anthony+Cumia+Show+2015-03-19+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64820bb3b743d7e8e7bde98e6dbcd669f5cf746d","infoHashBuffer":{"type":"Buffer","data":[100,130,11,179,183,67,215,232,231,189,233,142,109,188,214,105,245,207,116,109]},"announce":[],"urlList":[]}}