{"title":"ApexVideoConverterSuper 6.62 latest release","uid":4400003,"size":15775986,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:65d1fdea06b3249bca60f52ebd9e7561be411d97&amp;dn=ApexVideoConverterSuper+6.62+latest+release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Deceitful","files":1,"time":1221638337,"description":"Key Features of Apex Video Converter Super: \n \n Support MOV, MPEG, VCD, DVD, WMV, ASF, RM, RMVB, AVI, DIVX, PPC, iPod, Flash SWF, Flash FLV, Gif Animation, PSP, 3GP, Xbox, PMP video converter;\n\nSupport converting video from AVI, Divx, ASF, WMV, WMA, MPEG, MOV, QT, RM, RMVB, VCD, DVD file to Apple iPod, Sony PSP, Cell Phone 3GP, Microsoft Zune Player, Microsoft Xbox, Pocket PC, Portable Media Player ect. Mobile video.\n\nSupport converting video from AVI, Divx, ASF, WMV, WMA, MPEG, MOV, QT, RM, RMVB, VCD, DVD file to AVI, Divx, Xvid, MPEG, MOV, WMV, RM, RMVB etc. PC Video.\n\nSupport converting video from AVI, Divx, ASF, WMV, WMA, MPEG, MOV, QT, RM, RMVB, VCD, DVD file to Flash SWF, Youtube FLV, Flash FLV .\n\nVCD Ripper -- Support ripper VCD movies from dat to any pop video formats\n\nDVD Ripper -- Support ripper unprotected DVD movies from vob to any pop video formats \n\nSupport converting video from AVI, Divx, ASF, WMV, WMA, MPEG, MOV, QT, RM, RMVB, VCD, DVD file to MP3, WMA, WAV, MP2 Audio \n\nSupport converting video from AVI, Divx, ASF, WMV, WMA, MPEG, MOV, QT, RM, RMVB, VCD, DVD file to Gif Animation and GIF, BMP, EPS, JPG, PCX, PSD, PDF, TIFF, WMF, EMF, PNG, J2K IMAGE\n\nSupport converting video from AVI, Divx, ASF, WMV, WMA, MPEG, MOV, QT, RM, RMVB, VCD, DVD file to Apple TV, iPhone\n \nName and code in .txt file\n\nEnjoy!\n\n","torrent":{"xt":"urn:btih:65d1fdea06b3249bca60f52ebd9e7561be411d97","amp;dn":"ApexVideoConverterSuper+6.62+latest+release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65d1fdea06b3249bca60f52ebd9e7561be411d97","infoHashBuffer":{"type":"Buffer","data":[101,209,253,234,6,179,36,155,202,96,245,46,189,158,117,97,190,65,29,151]},"announce":[],"urlList":[]}}