{"title":"Mo' Horizons [2001] Remember Tomorrow","uid":4016260,"size":81676834,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:67bef5dfa6a130b90cebab3d33ec7ce52afad5bb&amp;dn=Mo%5C%27+Horizons+%5B2001%5D+Remember+Tomorrow&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"@strospliff","files":11,"time":1202381154,"description":"Ralf Droesenmayer and Ralf Wetzler aka Mo&amp;#039;Horizons, deliver their second full length. This won&amp;#039;t stand back behind the high expectations! Highly Latin influenced, this release takes you right on a Carribean island and offers you all the sweet fruits of life. Moody smooth Downtempo groovers, Bossa pearls and gentle dancefloor movers? there is just nothing missing on this one. Grande!!!\n\nWithin a short time after releasing their first album &amp;#039;Come Touch The Sun&amp;#039; Mo`Horizons had shot into the modern dance &amp; listening music scene. Every 12&quot; went straight into the DCC- Charts. Their diverse repertoire of sounds would be used from background music in TV documentaries to innovative Radio stations who played just about every track from the album...\nThe second album from Mo`Horizons &quot;Remember Tomorrow&quot; sticks itself seamlessly on the first but beware of being too complacent this baby will make you want to shake your bootie on any dancefloor.\n\nRalf Droesemeyer and Mark &quot;Foh&quot; Wetzler have been working on the 12 tracks that make up this album since the beginning of 2001, using such an array of styles from brazil, latin, jazz and soul, afro, funk, dub to name but a few. and for the first time enriched with a little boogaloo just for good measure.\nMo`Horizons integrate effortlessly all the elements from the 50`s to the 90`s in what has become their distinguishable sound all with live musicians and vocals emerging to form a wide ranging multicultural sound that can only be classed as Mo`Horizons so diversive and refreshing that producers such as Nicola Conte, SWAG and Skeewiff.\n\nThey had already started to put their own unique touches to remixes before general release with &quot;Remember Tomorrow&quot;. Ralf &amp; Foh didnÂ´t want to remove themselves from the electro-bossa-brazil sound they so endear to, they merely expand the borders of their musical preferences and loves.","torrent":{"xt":"urn:btih:67bef5dfa6a130b90cebab3d33ec7ce52afad5bb","amp;dn":"Mo%5C%27+Horizons+%5B2001%5D+Remember+Tomorrow","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67bef5dfa6a130b90cebab3d33ec7ce52afad5bb","infoHashBuffer":{"type":"Buffer","data":[103,190,245,223,166,161,48,185,12,235,171,61,51,236,124,229,42,250,213,187]},"announce":[],"urlList":[]}}