{"title":"How to Succeed in Business Without Really Trying (1967) (Robert","uid":3998341,"size":828676366,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:68178b2f91c3113bab2da9d30f65ff7b1f72ca36&amp;dn=How+to+Succeed+in+Business+Without+Really+Trying+%281967%29+%28Robert&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JayRay","files":-1,"time":1201430890,"description":"HOW TO SUCCEED IN BUSINESS WITHOUT REALLY TRYING - 1967\n\n  One of the most often overlooked movie musicals of the 1960s is also one of its most successful: the screen version of the Broadway smash HOW TO SUCCEED IN BUSINESS WITHOUT REALLY TRYING, which delivers a sharp comic rap across the corporate knuckles in its tale of a nobody (Robert Morse) who uses a self-help book to rocket up the corporate ladder, and by the time our hero reaches the heights, romantic complications leads him to wonder what price corporate success.\n\n  Although the business world has changed quite a bit since 1967, SUCCEED is so dead-on with its attack that even modern corporate leaders will be bloodied from the fray. The company is just large enough so that no one knows what is actually going on, leadership cries out for creative solutions then promptly fires any one who shows a talent for it, and promotion doesn't hinge so much upon ability as it does upon [kissing] up, backstabbing, and looking like you know what you're doing. There are jabs at dressing for success, the idea that employees don't engage in sexual hankypanky, hidden nepotism, and the importance of belonging to the &quot;right&quot; clubs. And along the way our hero meets the classic business crowd: the company man, the bombshell secretary, the boss' nephew, and a host of largely incompetent yes-men VPs.\n\n  HOW TO SUCCEED IN BUSINESS WITHOUT REALLY TRYING is sure to appeal to any one who has had the misfortune to graple with the idiocies of Corporate Life.\n\n  Starring: Robert Morse, Michele Lee, Rudy Vallee, Anthony Teague, Maureen Arthur.\n\n  Directed by: David Swift.\n\n  Quality: Very Good Xvid from DVD.\n\n  Length: 2hr. 1min.\n\n  Language: English.\n\n  Size: 720 x 336","torrent":{"xt":"urn:btih:68178b2f91c3113bab2da9d30f65ff7b1f72ca36","amp;dn":"How+to+Succeed+in+Business+Without+Really+Trying+%281967%29+%28Robert","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68178b2f91c3113bab2da9d30f65ff7b1f72ca36","infoHashBuffer":{"type":"Buffer","data":[104,23,139,47,145,195,17,59,171,45,169,211,15,101,255,123,31,114,202,54]},"announce":[],"urlList":[]}}