{"title":"Retro Christmas Classics - Something Weird Video DVDRIP XviD","uid":4535432,"size":782854144,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6861b5367a3beae02fc64e1ba8a9be771a1ad383&amp;dn=Retro+Christmas+Classics+-+Something+Weird+Video+DVDRIP+XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"frit0","files":1,"time":1227720957,"description":"* 1. Trailer for K. GORDON MURRAYs Santa Claus (1960)!\n   \n* 2. Intermission Ad: Merry Christmas!\n   \n* 3. Intermission Ad: Christmas Seals (1957)  Santa Claus and CLARK GABLE want you to buy Christmas Seals and help fight tuberculosis!\n   \n* 4. Short: A Christmas Dream  Through the miracle of stop-motion animation, Santa makes a little girls unwanted doll come to life and run amok all over her bedroom: Please dont throw me away! Wow.\n   \n* 5. Short: A Present for Santa Claus (1947)  Two greedy brats attempt to get the Christmas gifts they want by bribing Santa with cups of hot chocolate! And it works! Santa gives them lots of presents and a puppy!\n   \n* 6. Cartoon: Rudolph the Red Nosed Reindeer  MAX FLEISCHERs classic featuring everyones favorite luminescent caribou!\n   \n* 7. Trailer for the 1959 animated feature The Snow Queen!\n   \n* 8. Short: The Night Before Christmas  In the dead of night, Santa not only invades another living room, but lights up his filthy pipe and starts smoking in this retelling of the classic holiday poem!\n   \n* 9. Short: Silent Night  Join the ADA CRUSADERS QUARTET and sing along to the holiday classic with the aid of this Hymnalogue!\n   \n* 10. Short: A Visit to Santa (color)  Santa sends a young elf to escort little Dick and Ann to his castle at the North Pole where they hang with Mr. Claus, watch him in various parades, and take a tour of his Toy Shop. Santa shows Ann an array of dolls to wash, dress, and spank, then takes them to Toy Train Town where Dick nearly pees his pants with excitement! Whoopee!\n   \n* 11. Trailer for Santas Christmas Circus (1966) starring Whizzo the Clown!\n   \n* 12. Short: Santa and the Fairy Snow Queen  SID DAVIS, the mastermind behind such classroom scare films as The Dangerous Stranger, tries to persuade youngsters to take better care of their toys by showing a bleary-eyed Santa (who looks like a skid-row bum dragged in from the gutter) attempting to deal with a rebellion of toys that have come to life (played by a bunch of adults who should be ashamed of themselves)! Jaw-dropping.\n   \n* 13. Short: The Three Little Dwarves  In this delightful Rankin-Bass-style puppet production, an Asian-looking Santa drags his pals Hardrock, Coco, and Joe along with him on Christmas Eve!\n   \n* 14. Short: Santa in Animal Land  Puppet animals are upset that Santa Claus only brings gifts to kids, so Kitty Kat seeks out Santa, is made the Official Santa Claus for Animals Always, and delivers gifts for all his animal/puppet friends! As mind-numbingly goofy as it is oddly disturbing.\n   \n* 15. Short: The Spirit of Christmas  The Night Before Christmas is lovingly re-enacted by creepy marionettes!\n   \n* 16. Short: Christmas Rhapsody (1948)  A little fir tree feels inferior to all the larger trees in the forest until a forest ranger and his family choose it to be their Christmas tree! Get out those hankies.\n     \n-- Lisa Petrucci, Santas Little Helper\n\nprops to reptilicus","torrent":{"xt":"urn:btih:6861b5367a3beae02fc64e1ba8a9be771a1ad383","amp;dn":"Retro+Christmas+Classics+-+Something+Weird+Video+DVDRIP+XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6861b5367a3beae02fc64e1ba8a9be771a1ad383","infoHashBuffer":{"type":"Buffer","data":[104,97,181,54,122,59,234,224,47,198,78,27,168,169,190,119,26,26,211,131]},"announce":[],"urlList":[]}}