{"title":"Sustainable Food Processing (gnv64)","uid":9200779,"size":19972698,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:69105043aa7dc270f8ed4f1549a583147d14c525&amp;dn=Sustainable+Food+Processing+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":-1,"time":1384592090,"description":"Sustainable Food Processing \nby Brijesh K. Tiwari, Tomas Norton and Nicholas M. Holden\nWiley-Blackwell | December 2013 | ISBN-10: 0470672234 | PDF | 576 pages | 19 mb &lt;a href=&quot;\nhttp://www.amazon.com/Sustainable-Food-Processing-Brijesh-Tiwari/dp/0470672234&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Sustainable-Food-Processing-Brijesh-Tiwari/dp/0470672234&lt;/a&gt;\n\nWith global inequalities becoming more pronounced, ingredient costs climbing, and global warming a major political issue, food producers must now address environmental concerns, social responsibility and economic viability when designing their food processing techniques for the future. Sustainable food processing is all about finding new ways of meeting present needs without comprising future viability, given constantly changing economic and environmental conditions. This is not just a corporate social responsibility issue, but relates directly to efficiency, cost-saving and profitability, and so the food industry must increasingly embrace sustainable food processing in order to succeed.\nThis book provides a comprehensive overview on both economic sustainability and environmental concerns relating to food processing. It promotes ways of increasing sustainability in all the major sectors of the food industry, and will establish itself as a standard reference book on sustainable food processing. It will be of great interest to academic and industrial professionals.\nOpening chapters cover the concept and principles of sustainable food processing, with reference to various food processing sectors (dairy, meat, seafood, grain, fruit and vegetables). Further chapters on brewing, cold chain, consumption and packaging provide a comprehensive guide to making these key processes more sustainable. Issues such as cleaning, sanitation, and carbon footprint are discussed, before dedicated chapters covering energy and water consumption in the food industry address economic sustainability. Environmental impact assessment and food processing, waste utilization, risk assessment, and regulatory and legislative issues are also addressed.\nContributors include a combination of leading academic and industrial experts, to provide informed and industrially relevant perspectives on these topics.\n\nCONTENTS\nList of Contributors vii\nList of Figures xi\nList of Tables xv\n1 Introduction 1\nSection 1: Principles and Assessment 9\n2 Current Concepts and Applied Research in Sustainable Food Processing 11\n3 Environmental Sustainability in Food Processing 39\n4 Life Cycle Assessment and Sustainable Food Processing 63\n5 Environmental Impact Assessment (EIA) 93\n6 Risk Analysis for a Sustainable Food Chain 103\nSection 2: Food Processing Applications 125\n7 Dairy Processing 127\n8 Meat Processing 169\n9 Seafood Processing 195\n10 Sustainable Processing of Fresh-Cut Fruit and Vegetables 219\n11 Sustainable Food Grain Processing 269\n12 Sustainable Brewing 295\n13 Sustainable Processed Food 313\nSection 3: Food Manufacturing Operations 337\n14 Concept of Sustainable Packaging System and Its Development 339\n15 Sustainable Cleaning and Sanitation in the Food Industry 363\n16 Energy Consumption and Reduction Strategies in Food Processing 377\n17 Water Consumption, Reuse and Reduction Strategies in Food Processing 401\n18 Food Industry Waste Management 435\n19 Sustainable Cold Chain 463\nSection 4: Food Distribution and Consumption 497\n20 National and International Food Distribution: Do Food Miles Really Matter? 499\n21 Sustainable Global Food Supply Networks 521\n22 Sustainable Food Consumption 539\nIndex 557","torrent":{"xt":"urn:btih:69105043aa7dc270f8ed4f1549a583147d14c525","amp;dn":"Sustainable+Food+Processing+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69105043aa7dc270f8ed4f1549a583147d14c525","infoHashBuffer":{"type":"Buffer","data":[105,16,80,67,170,125,194,112,248,237,79,21,73,165,131,20,125,20,197,37]},"announce":[],"urlList":[]}}