{"title":"Skating on Stilts -- Why We Aren`t Stopping Tomorrow`s Terrorism","uid":6383746,"size":18837299,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:69a86da5ae274f638231c32f5f0ad71c58f15802&amp;dn=Skating+on+Stilts+--+Why+We+Aren%60t+Stopping+Tomorrow%60s+Terrorism&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Bluetack","files":18,"time":1305123484,"description":"A cold drizzle is falling on the Pentagon parking lot. The memorial \nfor those who died here on 9/11 was dedicated in 2008--just a \nyear ago--but it`s almost deserted. In nearly four years at the Depart-\nment of Homeland Security (DHS), I never managed to visit any of \nthe 9/11 memorials. Now that I`m out of office, along with the rest of \nthe Bush Administration, I have time to pay a quiet visit.\n\n  I don`t like the place. Flat and unadorned, it feels like an exten-\nsion of the vast Pentagon parking lot. The trees are scrawny, and \nthe grounds are a utilitarian expanse of gravel and rain-slick paving \nstones. Beyond the sparse vegetation and a concrete wall, traffic hisses \nand thrums on a highway.\n\n  I think I know what the designers had in mind. They wanted \neverything understated and austere. There`s a bench and a lighted pool \nof water for each victim who died here. Each bench bears a victim`s \nname. The benches and the paths trace the course that Flight 77 must \nhave taken--smack into the massive west wall of the Pentagon that \nlooms nearby, gray in the rain. \n\n  The site is all about good taste and minimalism. Security is tight. \nThe grounds look as though they`re swept clean each night to remove \nany trace of the day`s visitors, their litter, their mess, their grief.\n\n  But I`m not in the mood for good taste. The place feels cold and \nrunic. Some benches arc toward the building; others arc away. Some \nof the pools have names in them; most don`t. The benches are arranged \nby year, from 1998 to 1930. \n\n  I`ve come for a memorial; instead I`ve found some kind of puzzle.\n\nI practice law for a living, but off and on I`ve spent years in govern-\nment. This last tour has been a tough one. DHS was a startup, begun \nin the wake of disaster and assembled on the fly. two years in, DHS \nsuddenly realized that it needed a policy office, and I got the job. A \nstartup within a startup, the office had to be built from scratch. \n\n  Everything was up for grabs--policies, procedures, authorities, per-\nsonnel. I knew that wouldn`t last; slowly the demand for routine would \ncrowd out innovation. So in the midst of chaos--uncertain budgets, \nborrowed staff, no backup--I felt the pressure to push new ideas and \npolicies into place as quickly as possible. Early on, what matters is how \ngood your ideas are. later, what matters is whether your ideas have \nbeen vetted with every office that thinks it has a stake in the decision. \n\n  So all at the same time, I had to build the office, recruit great peo-\nple, solidify the budget, and put a solid policy structure under much \nof what DHS did. \n\n  I did that.  Now I`m tired. I need time to clear my head.\n\n========================================================================\n\nStewart A. Baker  was the first assistant secretary for policy at the Department of Homeland Security from 2005 to 2009.  He now practices law at Steptoe &amp; Johnson in Washington, D.C., and is a visiting fellow at the Hoover Institution.  His law practice covers homeland security, international trade, cybersecurity, data protection, and foreign investment regulation.  Baker has also served as general counsel of the Robb Silberman Commission investigating intelligence failures before the Iraq war (2004-5), as general counsel of the National Security Agency (1992-94), and as deputy general counsel of the Education Department (1979-81).   He clerked for Justice John Paul Stevens on the Supreme Court and Judge Frank M. Coffin on the First Circuit Court.","torrent":{"xt":"urn:btih:69a86da5ae274f638231c32f5f0ad71c58f15802","amp;dn":"Skating+on+Stilts+--+Why+We+Aren%60t+Stopping+Tomorrow%60s+Terrorism","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69a86da5ae274f638231c32f5f0ad71c58f15802","infoHashBuffer":{"type":"Buffer","data":[105,168,109,165,174,39,79,99,130,49,195,47,95,10,215,28,88,241,88,2]},"announce":[],"urlList":[]}}