{"title":"Famous Russian Aircraft Tupolev Tu-22M (amitks93)","uid":5903241,"size":41743539,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:69c3f35eeef119c5e2402cade0d71262bfbe669f&amp;dn=Famous+Russian+Aircraft+Tupolev+Tu-22M+%28amitks93%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"amitks93","files":3,"time":1287707712,"description":"The Tupolev Tu-22M(NATO reporting name: Backfire) is a supersonic, swing-wing, long-range strategic and maritime strike bomber developed by the Soviet Union. Significant numbers remain in service with the Russian Air Force.\nDuring the Cold War, the Tu-22M was operated by the VVS (Soviet Air Force) in a strategic bombing role, and by the AVMF (Aviatsiya Voyenno-Morskogo Flota,Soviet Naval Aviation) in a long-range maritime anti-shipping role.\n \n\nTu-22M3 in 2004 at Monino near Moscow\n\n\nThe Tu-22M saw its first combat use in Afghanistan from 1987 to 1989. A Tu-22m during landing and taxing can be seen here.\n\n\nIts usage was similar to the United States Air Force deployment of B-52 Stratofortress bombers in Vietnam War, dropping large tonnages of conventional ordnance.\n\n\nThe Russian Federation used the Tu-22M3 in combat in Chechnya in 1995, carrying out strikes near Grozny.\n\n\nAt the time of the break-up of the USSR, some 370 remained in CIS service. Production ended in 1993. The current strength was about 162 aircraft in 2008, with an additional 93 in reserve.\n\n\nRussian military officially acknowledged the loss of a Tu-22MR bomber to Georgian air defenses early in the 2008 South Ossetia war.\n\n\nOne of its crew members was captured (Major Vyacheslav Malkov), two others were killed and crew commander is missing in action as of August 2009.\n\n\nPlease seed after downloading and comment.","torrent":{"xt":"urn:btih:69c3f35eeef119c5e2402cade0d71262bfbe669f","amp;dn":"Famous+Russian+Aircraft+Tupolev+Tu-22M+%28amitks93%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69c3f35eeef119c5e2402cade0d71262bfbe669f","infoHashBuffer":{"type":"Buffer","data":[105,195,243,94,238,241,25,197,226,64,44,173,224,215,18,98,191,190,102,159]},"announce":[],"urlList":[]}}