{"title":"Wounds (Rane) - Serbian muve with english title","uid":3500420,"size":711699968,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:6a0320e247fe31fe10195bba4709e8d82fe2c0f7&amp;dn=Wounds+%28Rane%29+-+Serbian+muve+with+english+title&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"losmi200","files":1,"time":1151877302,"description":"Pinki and Kraut are a pair of Serb teenagers who begin as simple petty thieves and work their way up into the heart of the Yugoslav underworld. As war surrounds them in Bosnia, the boys become increasingly callous and violent, ultimately overthrowing their mentor, a powerful black marketer, before turning on each other. A savage and powerful gangster movie from a war-torn part of the world.\n\nAbout: http://www.rottentomatoes.com/m/wounds/\nIMG: http://members.optushome.com.au/thesquiz/rane.jpg\n\n\nFilm je posvecen generacijama rodjenim posle Tita. Baziran na istinitom dogadjaju, film prati sudbinu dvojice decaka, Pinkija i Svabe, koji odrastaju na Novom Beogradu, u periodu 1991 - 1996. Detinjstvo glavnih junaka determinisano je sankcijama, blizinom rata i kriminalizacijom citavog drustva, koji udruzeni stvaraju sasvim nov sistem vrednosti. Kao i mnogi njihovi vrsnjaci, Pinki i Svaba vec sa cetrnaest godina ulaze u svet kriminala, prihvatajuc? vrednosti Srbije iz tog perioda, ex-komunisticke zajednice u hiper-tranziciji?, koja, zbog rata i sankcija, podseca na teatar apsurda. Idoli glavnih junaka su poznati beogradski kriminalci i TV talk-show ?Puls asfalta? koji takvu felu ljudi dovodi u goste i stvara od njih medijske zvezde. Pinki i Svaba mastaju da jednog dana gostuju u svojoj omiljenoj emisiji i trude se, zlocinima, da to zasluze. Nakon sto uspevaju u tome, njihov uspon u svetu kriminala se prekida medjusobnim sukobom. Svaba ispaljuje pet metaka u Pinkija, nesvestan toga da svog najboljeg prijatelja ranjava u ista ona mesta u koja je Hrist ranjen dve hiljade godina ranije. Pinki uspeva da prezivi i nakon izvesnog vremena bezi iz bolnice, te poziva svog prijatelja na pomirenje. Pomirenje je vise nego uzasno -a zasto? To ostavljamo Vama da otkrijete! DVD je radjen za zonu 2 (Evropa). Ako ste u USA, jedina mogucnost je ako ga gledate preko PC-DVD uredjaja. \n\n\n\n\n\n","torrent":{"xt":"urn:btih:6a0320e247fe31fe10195bba4709e8d82fe2c0f7","amp;dn":"Wounds+%28Rane%29+-+Serbian+muve+with+english+title","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a0320e247fe31fe10195bba4709e8d82fe2c0f7","infoHashBuffer":{"type":"Buffer","data":[106,3,32,226,71,254,49,254,16,25,91,186,71,9,232,216,47,226,192,247]},"announce":[],"urlList":[]}}