{"title":"Philip K Dick - Galactic Pot Healer","uid":7643526,"size":151360107,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6bd676dd1bd98763b66455a0df06b4166bf4ee12&amp;dn=Philip+K+Dick+-+Galactic+Pot+Healer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Dexter191","files":-1,"time":1347841698,"description":"General Information\n===================\n Title:                  Galactic Pot Healer\n Author:                 Philip K. Dick\n Copyright:              1969\n Genre:                  Audiobook\n Abridged:               No\n\nOriginal Media Information\n==========================\n Source:                 Warez Forum\n Condition:              Good\n\nFile Information\n================\n Number of MP3s:         8\n Total Duration:         5:15:01\n Total MP3 Size:         144.29\n Parity Archive:         Yes\n Encoded At:             CBR 64 kbit/s 44100 Hz Mono\n ID3 Tags:               Set, v1.1, v2.3\n\nBook Description\n================\nFrom the Inside Flap\nWhat could an omnipresent and seemingly omnipotent entity want with \na humble pot-healer? Or with the dozens of other odd creatures it has \nlured to Plowman's Planet? And if the Glimmung is a god, are its ends \npositive or malign? Combining quixotic adventure, spine-chilling horror, \nand deliriously paranoid theology, Galactic Pot-Healer is a uniquely \nDickian voyage to alternate worlds of the imagination. \n\n\nAmazon Reviewer\nAccording to the author's biographer, Laurence Sutin, Dick didn't much \ncare for this book. I can't imagine why, except that in his more determinedly \nresolute moments he may have considered the ending too patly pessimistic. \nI agree with Sutin's rating: Pot-Healer is a gem. Rarely for Dick, it \nhas only a single point-of-view character, the pot-healer (not mender), \nstranded in a Stalinist USA of the 2040s, who is somewhat circuitously \napproached by the Glimmung - a possibly divine, certainly whimsical \nentity of faraway Plowman's Planet. The Glimmung is putting together \na collaborative enterprise of life-forms from around the galaxy in order \nto raise a sunken cathedral, and along the way our hero meets with some \nspectacular inconveniences, including his own corpse and a book in which \nhis future (or one of them) is inscribed (possibly), occasionally in \nlanguage he can understand. This is one of Dick's funniest and most \nenjoyable books, putting a light touch to many of his favourite issues. \nIt's as packed with energy and invention as any of his more famous works \nand, perhaps because of the single point of view, feels more focused \nand coherent than many - and this in spite of the fact that its epic \nplot and impressive special effects all take place within the space \nof less than a hundred and eighty pages.\n","torrent":{"xt":"urn:btih:6bd676dd1bd98763b66455a0df06b4166bf4ee12","amp;dn":"Philip+K+Dick+-+Galactic+Pot+Healer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bd676dd1bd98763b66455a0df06b4166bf4ee12","infoHashBuffer":{"type":"Buffer","data":[107,214,118,221,27,217,135,99,182,100,85,160,223,6,180,22,107,244,238,18]},"announce":[],"urlList":[]}}