{"title":"TimeBell v13.0 with Key-LAXiTY [TorDigger]","uid":10379397,"size":8506354,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6c18221b75106f0326c4f1f52cf9a5b15db67db1&amp;dn=TimeBell+v13.0+with+Key-LAXiTY+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":11,"time":1403050963,"description":"TimeBell 13\n\nNeed a reminder? No problem! Set it up easily with TimeBell !\nTimeBell - program reminders of events. Is there an important event you don't want to miss? Use TimeBell to remind you! \nBut TimeBell doesn't stop there.\nNeed a site opened at a certain time? What about a program you need up and running, open file or close a program at a certain time? TimeBell does it for you, automatically! \nTimeBell automates reminders and many repetitive computer actions for you. Once created in TimeBell, you will never have to worry about them again! What a time saver, your computer will remember to have that program up and running, even if you can't be there! TimeBell with its reminders and advanced capabilities, makes it simple! The TimeBell program is easy to understand, even someone new to computers will find it easy to get started. There is even a convenient desktop calendar.\n\nNew in this version TimeBell:\n\n- Function Countdown Timer.\n\nAt predefined time TimeBell can: \n\n- open a reminder window with your text (image can even be added to it) \n- start up predefined program or open a file \n- close selected a program \n- open a predefined website \n- switch off monitor, shutdown, put it to sleep or put it to standby mode, change PC user. \n- show window with countdown 1 minute before action with powerPC \n- change the wallpaper of desktop \n- send an email using a predefined e-mail address \n- accompany task by the sound \n- synchronize time with atomic clock \nAll these tasks can be executed once or periodically (hourly, daily, weekly, monthly, yearly). \nAll tasks can be performed in any combination, together or separately. \nThe number of TimeBell tasks is unlimited. \nAt start up, TimeBell notifies you about any missed tasks. \nYou can view the list of tasks on present day at starting program. \nIf you use multiple computers, you can transfer the data file with all the tasks of TimeBell between them via external storage or through Internet.\nYou can even create TimeBell tasks remotely through Internet.\nCustomized capabilities of TimeBell. \n- run TimeBell with Windows (is active by default) \n- minimize TimeBell to system tray on start (is not active by default) \n- when TimeBell is run, show window with tasks on current day (is not active by default) \nIn order to see tasks in more detail or edit a task, just double-click on the task with left mouse button to display a window with all the details. \n- speak time every hour (is not active by default) \n- displaying calendar on the desktop (is not active by default) \n- automatically download a tasks from website www.evvasoft.com (is active by default). Delete of downloaded tasks from website (is active by default) \n- windows &quot;stickers&quot; for create your notes \n- function of the address book \n- function countdown timer. \n- check update for new version TimeBell (is active by default). Check updates automatically - when startup TimeBell or manually select in menu &quot;Check for Updates now&quot;. For disable this function please select in menu program &quot;Disable automatically check updates&quot;. \n- password to protecting access to TimeBell (is not active by default) \n- countdown 1 minute before action with powerPC (is not active by default)\n\nSynchronize time with atomic clock: \n- automatically synchronize time with atomic clock (is active by default). You can disable this function. \n- You can select periodically synchronize time with atomic clock: hourly, daily, weekly, monthly (hourly by default) \n- at start-up TimeBell synchronizes time with atomic clock \n- you can select SNTP server for synchronize time ( time.windows.com by default) or add your SNTP server\n\nAppearance TimeBell is customizable: \n- skin \n- color of the fonts \nThe following are displayed in the TimeBell calendar on the desktop : \n- date and time \n- a season of year \n- the year according to oriental calendar \n- a sign of the zodiac for the current date \n- indication of the leap year\n\nSetting for the calendar on the desktop: \n- The 24-hours (by default) or the 12- hours AM/PM view by choice \n- Select the day to start week : Monday (by default) or Sunday \n- Skins calendar on the desktop \n- For returning to current date, push button &quot;Today&quot; on calendar \n- Variable transparency is available on the desktop calendar \n- Double-click date on desktop calendar to create new task\n\nSupported OS:\n\nWindows All\nIn Window Vista or Window 7, 8 run TimeBell with administrator privilege.\n\nHomepage: http://www.evvasoft.com/\n\nInstallation Instructions: \n\n- Install program.\n- Register application with given key.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:6c18221b75106f0326c4f1f52cf9a5b15db67db1","amp;dn":"TimeBell+v13.0+with+Key-LAXiTY+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c18221b75106f0326c4f1f52cf9a5b15db67db1","infoHashBuffer":{"type":"Buffer","data":[108,24,34,27,117,16,111,3,38,196,241,245,44,249,165,177,93,182,125,177]},"announce":[],"urlList":[]}}