{"title":"Recipes.That.Rock.S01E05.PDTV.x264-Hector.mp4","uid":11218819,"size":249066261,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6c4404fb7f42db798da355227237e08695e462d3&amp;dn=Recipes.That.Rock.S01E05.PDTV.x264-Hector.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TlanImass","files":-1,"time":1413354201,"description":"Recipes That Rock - Season 1, Episode 5\n\n\n\n\nMargaret River is brimming with activities like the inaugural Gourmet Festival where Matt is scheduled to perform amongst other chefs. But before they get back on the road, Matt must attend the opening on Smiths Beach where he catches up with fellow chefs Alex Atala, Alvin Leung, Kylie Kwong, Rene Rezepi, Tetsuya Wakada and legendary food writer and critic from London, AA Gill. Next, at Koonac Goats, Alex and Matt catch up with Andreas and Sonja, two Swiss biologists who've forsaken their life of science to live frugally with their goats, make cheese and raise their orphan kangaroo joey. The guys get a special treat of fried goats' cheese haloumi. Then, it's back to the Margaret River Farmers Market to get some new supplies for Matt's charred yellow zucchini, banya nuts and fresh herbs. Matt gets a request to host and cook for a beach BBQ where he makes barbecued marron, grilled asparagus and beach herbs. Later, Matt enlists the help of indigenous guide Josh Whiteland to take Tetsuya, Alex and himself fishing at Canal Rocks near Yallingup. The last stop of the day is the Margaret River Organic Creameries' lush green farm where Alex attempts to get a secret family recipe for homemade salami and a gooey, sticky, delicious Welsh rarebit fondue.\n\n\n\n\nRebroadcast Air Date: 08-Oct-2014","torrent":{"xt":"urn:btih:6c4404fb7f42db798da355227237e08695e462d3","amp;dn":"Recipes.That.Rock.S01E05.PDTV.x264-Hector.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c4404fb7f42db798da355227237e08695e462d3","infoHashBuffer":{"type":"Buffer","data":[108,68,4,251,127,66,219,121,141,163,85,34,114,55,224,134,149,228,98,211]},"announce":[],"urlList":[]}}