{"title":"iGo_My_Way_2.1.6_All.Europe.Maps.(iPhone_Universal_Licence)","uid":6917506,"size":1929732471,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:6c475731a4f967d9d3bf63d312157cf2b3fdafd6&amp;dn=iGo_My_Way_2.1.6_All.Europe.Maps.%28iPhone_Universal_Licence%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"macman-I7","files":22,"time":1325083260,"description":"iPhone Edition\n\nPowered by the same experienced iGO Engine used in millions ofnavigation devices around the world: now faster &amp; more reliable than ever before, with a set of new features for even more intelligent navigation.\n\nMAIN FEATURES\nGoogle local search\nGreen routing\nExtras through in-app purchase\nNavigation to coordinates\nTTS Pro (advanced speech)\nRealistic, 3D Junctions\n\nStunning 3D visualization\niGO primo app offers stunning 3D visualization. Complex junctions are displayed in 3D to provide a rapid understanding of your next maneuver while true-to-life 3D models of famous landmarks and display of the terrain around you - such as valleys, hills and mountains.\n\nTTS Pro\nThe Text-to-Speech (TTS) feature allows pronouncing city, street and highway names as part of the guidance instructions. The new TTS Pro reads out not only standard voice commands, but also traffic events, a summary of the planned route and relevant country info after crossing a border. Text-to-Speech is available in the following languages: English, French, German, Italian, Spanish, Portuguese, Russian. Note: The languages mentioned above vary in the applicable packagages.\n\nGoogle local search\nFind businesses or anything else you need around your position\n\nIn-app purchase for extras\nCountry maps, safety cameras, Rich POIs (Explorer's package), Live Traffic: Save time by using the alternative routes generated automatically by your navigation software following the up-to-date traffic information available for your present route, 3D citymap (3D buildings)\n\nRealistic Junction View\nRealistic images of motorway junctions for easier orientation.\n\nSophisticated route calculation\niGO primo app calculates not only fast, short, and easy-to-follow routes, but also green ones. The green routing option is new, choose this one for lower fuel consumption and CO2 emission.\n\nPOI search along the route\n\nMultiple Destination Entry\nNavigate to: iPhone contacts, GPS-coordinates, pictures\n\nCustomizable quick menu\n\nCustomizable vehicle profile\n\nSend a question to Customer Support\n\nOptimized in-car use\nExtra large buttons, simple icons, and a truly intuitive interface with streamlined workflow ensure optimized in-car use and maximum attention to the road.\n\nPrecise voice guidance in numerous language\niGO primo app supports numerous languages. Please check out the description of the individual packages for the list of the languages included.\n\nQWERTY keyboard\nUse the QWERTY keyboard layout with extra large keys in landscape mode to enter an address.\n\nSupporting multi-point routes\nYou can now add one intermediate destination to your route. This feature was introduced in version 1.1.\n\nCalling POIs (Places)\nIf you find a Point of Interest (POI) that has a phone number, you can call it immediately from the navigation application.\n\nQuickstart function\nNo need to remember road names and house numbers. Save an unlimited number of favorites for a quickstart.\n\nSmart history\nThe smart history 'learns' the user's behavior and habits, and offers a ranked list with the most likely destinations based on the current GPS position, previous routes, day of the week, and time of day.\n\nWhere am I? - emergency function\nFind help in emergency situations! Based on the current GPS position this function diplays nearby assistance, such as police stations, break-down services, ATMs, etc.\n\nMillions of POIs\nSelect from millions of Points of Interest along your route or at your destination, and you can easily find nearby hotels, restaurants, ATMs, gas stations, etc.\n\nMulti-touch screen\nYou can zoom the map in and out with two fingers - in iPhone style - but for quicker control one-touch operation is also supported.\n\nSmart Keyboard\nThe Smart Keyboard speeds up the address entry by completing the most likely city and street names.\n\nExplore the map\nYou can freely browse and explore the map in both 2D and 3D mode: zoom, drag, tilt, rotate, and select any point on the map as destination.\n\nAuto orientation\nTo make navigation on iPhone really handy, the application selects automatically between portrait and landscape format.\n\nLane assistance and realistic signposts\niGO primo app makes navigation easy even in complex situations. Country-specific lane guidance and signposts give you even more realistic help in choosing the right lane well before the upcoming maneuvres.\n\nDay and Night mode\nWith changing light conditions when driving into tunnels or at dawn, iGO primo app switches between Day and Night mode.\n\nVehimarkers\nWith iGO primo app, users can select different images for their position markers, so the traditional arrow can be changed to a variety of realistic 3D symbols, including pedestrian, bicycle and numerous car models.\n\nNavigation resumes after incoming call\nFollowing an incoming call during navigation, iGO primo app simply resumes guidance without any user interaction.\n","torrent":{"xt":"urn:btih:6c475731a4f967d9d3bf63d312157cf2b3fdafd6","amp;dn":"iGo_My_Way_2.1.6_All.Europe.Maps.%28iPhone_Universal_Licence%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c475731a4f967d9d3bf63d312157cf2b3fdafd6","infoHashBuffer":{"type":"Buffer","data":[108,71,87,49,164,249,103,217,211,191,99,211,18,21,124,242,179,253,175,214]},"announce":[],"urlList":[]}}