{"title":"Stasis (Patch 2.1.0.6) (GOG)","uid":12527499,"size":67540739,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6c83245f9b02989b17b9cbb4b0214a2b04e36c35&amp;dn=Stasis+%28Patch+2.1.0.6%29+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mercs215","files":2,"time":1444156331,"description":"Install instructions:\r\n1. Run &quot;patch_stasis_2.1.0.6.exe&quot;\r\n2. Play\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS GAME! :)\r\nIf you like this game, support the developers and BUY IT!\r\n\r\nChange log:\r\nPatch 1.0.8.10b\r\n​• Made sure Largest font scales on all resolutions.\r\n​• FIXED 1.0.7 SAVE GAME BUG\r\n​• Altered mouse clicking loop pause.\r\n​• Removed selection highlighter when scrolling through save games.\r\n​• Spelling change: Retracts.\r\n​• Fixed bug causing John to walk out of Jupiter passage.\r\n​• Changed color of cryopreservation fluid container.\r\n​• Removed descriptions when game state changes in hanger room.\r\n​• Added 3 different options of font size. Added ability to make more font sizes.\r\n​• Added additional animation when John interacts with Yuri.\r\n​• Increased interactive area when walking into clone vats.\r\n​• Fixed bug when coming back into annex.\r\n​• Increased Dr Malans walking speed from 60 - 75to avoid sliding.\r\n​• Increased size of trigger area for Stasis storage room door trigger.\r\n​• Moved door trigger to 'my heart' dialog.\r\n​• Fixed Russian and Polish missing text logs for Akiza Tenschu\r\n​• Added text size control driven by Stasis Config Tool.\r\n​• Reset minimum timing from 10ms to 50ms to avoid pause errors.\r\n​• Added in loop to push timing events that may skip because of faster cards and refresh rates.\r\n​• Fixed VSync issues encountered with Omega Series and Catalyst 15 (from AMD) cards. Tested on older NVidia drivers as well.\r\n​• No errors on Mac VSync/Refresh rates - but newer version with changes will still be built for Mac.\r\n​• Fixed missing descriptions in decontamination room.\r\n​• Forced control return when elevator platform moves on gangway in Seed.\r\n​• Added in command to make sure that new text size loads in older save games.\r\n​• Remove desorption's on power cells after interaction\r\n​• Redo menu screen (updated graphics and removing options menu - options are now adjusted in the Stasis Config Tool)\r\n​• Removed 'Sound Volume Control' from General System as it is replaced by Stasis Config Tool commands.\r\n​• Altered following graphics and text locations to allow for new next sizes:\r\n​• Tram Terminal, Tram Control, Tram Line Box, Tram Power Box, Specimen Transport Containers, Pod Control, Retinal Scanner\r\n​• Took out frames of security camera from older build\r\n​• Increased Exit Area in Crew Quarters Corridor B\r\n​• Got rid of odd 1's - (being caused by 'At beginning of scene;{_' in Medical and Hydroponics. Only found in Russian and Polish.\r\n​• Change credits with updated names\r\n​• Made smaller steps in background sounds fading out during dialog (from 5 to 10)\r\n​• Took out Menu Access when viewing pod panels in Product Storage Medical. Added in check to ensure John regains movement in room.\r\n​• Removed menu access during Surgery Loading Screen\r\n​• Took out 'mouse reset loop' during Helix sections\r\n​• Altered dialog spacing to fit larger text in Specimen Transport pod\r\n​• Added reduncancy check to surgery scene to give back control after surgery\r\n​• Altered 'MainFontSMALL' as it was causing issues with random numbers appearing (size and colour)\r\n​• Changed version number to graphic instead of text\r\n​• Old EXIT button wasnt working with old save games - fixed","torrent":{"xt":"urn:btih:6c83245f9b02989b17b9cbb4b0214a2b04e36c35","amp;dn":"Stasis+%28Patch+2.1.0.6%29+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c83245f9b02989b17b9cbb4b0214a2b04e36c35","infoHashBuffer":{"type":"Buffer","data":[108,131,36,95,155,2,152,155,23,185,203,180,176,33,74,43,4,227,108,53]},"announce":[],"urlList":[]}}