{"title":"Nubiles-Porn - Alexis Adams, Apriloneil (Undressed) NEW 30 Octob","uid":12653957,"size":370842021,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:6c877e1abf7f44d58cc266d7a8ca6e6508dd70c3&amp;dn=Nubiles-Porn+-+Alexis+Adams%2C+Apriloneil+%28Undressed%29+NEW+30+Octob&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xxxlavalxxx","files":2,"time":1446194690,"description":"Alexis Adams and Apriloneil get dressed in matching bras and thongs, and then after exchanging a kiss they go in search of Jessy Jones so he can help them get their party started. After they lead Jessy to the couch by his dick, the girls are quick to get naked so they can settle in for a double blowjob where Jessy gets to enjoy the soft sweetness of both of their mouths. He even gets to experience a titty fuck between each of the girls' big busty boobs!When Jessy finally gets to slide between Apriloneil's thighs, he enters her slick trimmed snatch with absolute pleasure. Alexis takes the opportunity to plant her landing strip twat on Apriloneil's face so that she can be eaten out as Jessy goes to town fucking her lover's creamy fuck hole.When it's Alexis's turn to get her pulsing twat filled, she can't stop her moans of happiness. Every thrust gets her big boobs quivering as Jessy drives her closer to the edge and then over. Jessy is already ready to pop, but he has enough patience to wait until the girls have pushed their tits together to be covered by his hot cum that they can't wait to lap up with contented sighs of pleasure.\r\nTags: Big Boobs, Puffy Nipples, Brunette, Long hair, Hardcore, Lesbian, Big Areolas, Girl-Girl-Boy, Blowjob, Deep Throat, Titty Fuck, Pussy Licking\r\n \nhttp://imgdone.com/viewer.php?file=63937034594943683244.jpg\r\n \nhttp://imgdone.com/viewer.php?file=94612087240518796625.jpg","torrent":{"xt":"urn:btih:6c877e1abf7f44d58cc266d7a8ca6e6508dd70c3","amp;dn":"Nubiles-Porn+-+Alexis+Adams%2C+Apriloneil+%28Undressed%29+NEW+30+Octob","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c877e1abf7f44d58cc266d7a8ca6e6508dd70c3","infoHashBuffer":{"type":"Buffer","data":[108,135,126,26,191,127,68,213,140,194,102,215,168,202,110,101,8,221,112,195]},"announce":[],"urlList":[]}}