{"title":"[PC Full Game] Urban Chaos","uid":5637767,"size":569262080,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6d567f587d29fba423d870f83a47f8360620cc70&amp;dn=%5BPC+Full+Game%5D+Urban+Chaos&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"pirateloader69","files":1,"time":1276955770,"description":"The fact that Urban Chaos is an enjoyable third-person action game with no switch flipping, box pushing, or key finding should be reason enough for you to purchase it.\n\nMucky Foot Productions' Urban Chaos is an attempt to meld a side-scrolling arcade beat-'em-up such as Double Dragon or Final Fight with a modern third-person action game. All the standard ingredients are intact: a trek across a metropolitan dystopia, baseball bats, evil gang members, scantily clad karate prostitutes, punching, and lifebars. Unfortunately, perhaps in a misguided attempt to make Urban Chaos more realistic, the developers have replaced retro-gaming's universal health power-up, the big-boned hunk of meat, with a generic medical kit. But Mucky Foot can be forgiven for this oversight, because it's one of the game's only significant missteps. Urban Chaos is a great looking and ingenious reinvention of a classic genre.\n\nUnion City is a town in crisis. The end of the 20th century is approaching fast, and a gang of thugs called the Wildcats runs rampant through the streets. Worse yet, their brand of chaos seems to extend past mere delinquency to also include more sinister millennial cult activities. As rookie cop D'arci Stern, you must first prove yourself to your superiors then take on the tougher-than-their-name-implies Wildcats by uncovering their wicked plans and stopping them.\n\nText from\n\n1Ã‚Âº-Burn or Mount the Game\n\n2Ã‚Âº-Install the game\n\n3-Copy the crack from the Urban Chaos ISO to:''C: Program Files Eidos Interactive Urban Chaos\n\n4Ã‚Âº-Have Fun!!\n\nSeed After Downloading!!\n\nThis Torrent was brought you by pirateloader69","torrent":{"xt":"urn:btih:6d567f587d29fba423d870f83a47f8360620cc70","amp;dn":"%5BPC+Full+Game%5D+Urban+Chaos","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d567f587d29fba423d870f83a47f8360620cc70","infoHashBuffer":{"type":"Buffer","data":[109,86,127,88,125,41,251,164,35,216,112,248,58,71,248,54,6,32,204,112]},"announce":[],"urlList":[]}}