{"title":"Infernal Restraints--Stuck in Bondage  Hazel Hypnotic","uid":9992585,"size":3655864061,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:6d7f928e0d4ebaf6f4b622a8f696658ee726df05&amp;dn=Infernal+Restraints--Stuck+in+Bondage++Hazel+Hypnotic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1397868817,"description":"\nStuck in Bondage | Hazel Hypnotic\n\nApril 18, 2014\n\n\niPod, Low and High bitrate MP4.\n\n\nYou probably don't think of orgasms as being a form of intense torment for the person having them. Hazel Hypnotic never did either. But when Cyd Black got his hands on her she suddenly saw the potential.\n\nThe first step is increasing the sensitivity of her pussy as much as possible. That doesn't mean going at her with a vibrator right away. In fact, it is all about the impact toys at first. A cane, a riding crop, then a thin and stinging flogger all fall across her pussy, one after the other, making her wet and horny while they do their work.\n\nHazel has no way to defend herself. The metal bar her limbs are strapped to doesn't even spread her legs but it does let Cyd roll her back so that her pussy is exposed. The celebrator is a tiny little vibrator but it's more than enough to force the first orgasms from her. She barely has time to think about how she expected it to be worse when Cyd comes back with a suction device for her clit.\n\nPulling her pussy into the cup causes all of the blood to rush to the area. If it was super sensitive before, now it is almost excruciating. It's the perfect time to apply the Hitachi. If Hazel wasn't gagged she'd probably be screaming bloody murder from the feeling of having her private parts rocked by the most powerful hand held vibrator. She nearly passes out from the orgasms.\n\nWhen Hazel comes back to her senses she is in a completely different position. She's on her stomach in a hog-tie, except all of the bondage is still cold iron. She can't see behind her but it doesn't take much imagination to know what is coming next. She feels Cyd sliding his fingers inside of her sore snatch and knows that they are just a warm up. Mr. Pogo is going to take her and there is nothing that she can do about it. \n \nScreens &lt;a href=&quot;\nhttp://infernalrestraints.com/device/bondage/2014/04_18hhypnotic9/InfernalRestraints-Hazel-Hypnotic-Stuck-in-Bondage.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://infernalrestraints.com/device/bondage/2014/04_18hhypnotic9/InfernalRestraints-Hazel-Hypnotic-Stuck-in-Bondage.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:6d7f928e0d4ebaf6f4b622a8f696658ee726df05","amp;dn":"Infernal+Restraints--Stuck+in+Bondage++Hazel+Hypnotic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d7f928e0d4ebaf6f4b622a8f696658ee726df05","infoHashBuffer":{"type":"Buffer","data":[109,127,146,142,13,78,186,246,244,182,34,168,246,150,101,142,231,38,223,5]},"announce":[],"urlList":[]}}