{"title":"An Atheist Defends Religion: Why Humanity Is Better Off with Rel","uid":10106502,"size":348649,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6de9001b53bcfc45be5c2e9b95851011784c3d10&amp;dn=An+Atheist+Defends+Religion%3A+Why+Humanity+Is+Better+Off+with+Rel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1399422605,"description":"An Atheist Defends Religion: Why Humanity Is Better Off with Religion Than Without It\n\n\nAfter hundreds of years, the time has come to admit that the debate about the existence of God can never be resolved to either side's satisfaction. But the discussion need not end there. We are still left with the important issue of the value of religion. And this is a debate that religion can win.\n\n Bruce Sheiman's &quot;An Atheist Defends Religion: Why Humanity is Better Off with Religion than without It&quot; offers a distinctive response to the numerous books by unbelievers -- from the perspective of an unbeliever. But unlike other atheists who embrace their rejection of God as an intellectual triumph, Sheiman asserts that religion provides a combination of psychological, moral, communal, existential, aesthetic, and even physical-health benefits that no other institution can replicate.\n\n &quot;An Atheist Defends Religion&quot; does not shy away from the controversial topics that ignite argument between atheists and people of faith, and takes on topics such as fundamentalist violence, militant atheism, faith and reason, and religion and science.\n\n Sheiman ultimately redefines the core question of the debate: It is not whether God exists but whether the world is a better place because people believe God exists. This book makes a strong statement about the positive role of religion in the contemporary world, and what is lost in a purely secular conception of the world. \n\nepub","torrent":{"xt":"urn:btih:6de9001b53bcfc45be5c2e9b95851011784c3d10","amp;dn":"An+Atheist+Defends+Religion%3A+Why+Humanity+Is+Better+Off+with+Rel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6de9001b53bcfc45be5c2e9b95851011784c3d10","infoHashBuffer":{"type":"Buffer","data":[109,233,0,27,83,188,252,69,190,92,46,155,149,133,16,17,120,76,61,16]},"announce":[],"urlList":[]}}