{"title":"Red - Warren Ellis","uid":6794118,"size":29529584,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:6ebc61cb9bb0dcc56f4d40b22f8dd319f386639f&amp;dn=Red+-+Warren+Ellis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jakcreed","files":3,"time":1320383353,"description":"Red by Warren Ellis (later turned into the 2010 film of the same name)\nPaul Moses is a retired Agent of the CIA, formerly working in &quot;foreign acquisitions&quot;. Living in a secluded area, his human contacts are limited to pleasant phone calls to his handler (who desires what she believes to have been Moses' type of work) and letters to a niece who lives in England.\n\nMichael Beesley, the newly politically appointed Director of the CIA, is taken to Room R as part of his initiation, where he learns of Moses' existence and the full extent of his activities. Disgusted by what he has seen, and fearing public reaction should any of those secrets leak out, he orders the assassination of Moses.\n\nA three man hit-team is sent to Moses' residence, and he kills them, recognizing the pattern of the attack and realizing his death has been sanctioned. He calls his handler only to learn that she has been transferred. He informs the Agency that his status has changed from Green to Red before leaving his house and going on the hunt.\nEnjoy and seed","torrent":{"xt":"urn:btih:6ebc61cb9bb0dcc56f4d40b22f8dd319f386639f","amp;dn":"Red+-+Warren+Ellis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ebc61cb9bb0dcc56f4d40b22f8dd319f386639f","infoHashBuffer":{"type":"Buffer","data":[110,188,97,203,155,176,220,197,111,77,64,178,47,141,211,25,243,134,99,159]},"announce":[],"urlList":[]}}