{"title":"[PSP] MIDNIGHT CLUB L.A. REMIX GLOBE","uid":7114887,"size":409196398,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:6f10d1a5a83cb9b998d8d4f0b3ed31dee5b4009f&amp;dn=%5BPSP%5D+MIDNIGHT+CLUB+L.A.+REMIX+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"globeplus","files":-1,"time":1332187586,"description":"HELLO MIDNIGHT CLUB SERIES FANS ... \n\n\nPLAY THIS MIDNIGHT CLUB GAME FOR THE PSP ...\n\n\n\nFILE INFO : \n\n\n- QUALITY RIP WITH NOTHING RIPPED , JUST THE PMF VIDEOS AND AT3 AUDIO WORKED\n  PERFECTLY WITH QUALITY AND TESTED ON THE GAME \n\n\n- WORKING PERFECTLY ON THE JPCSP EMULATOR WITH THE NEXT CONFIGURATION :\n\n  \n  VIDEO : Only GE Graphics  \n\n\n\n* GAMEPLAY :\n\n\nThe game is set in the city of Los Angeles, again providing the option to completely free-roam (in an open world environment larger than all the three cities combined from the previous game, Midnight Club 3: DUB Edition). New additions are a 24 hour day-to-night cycle, weather effects and traffic with licensed vehicles, adding a realistic aspect to the game. After races, if any damage is inflicted upon the vehicle, the player doesn't necessarily have to drive back to the garage for a full repair, but instead can choose the Quick Fix option through which old, junkyard-esque parts will be added to the car. To get the nice look back, the player must actually drive back to repair their vehicle at a garage or at a gas station, so totaling the car is only possible within a single race or event. With the RAGE system being used for this game, traffic levels fluctuate throughout the day, with heavy traffic in the morning and afternoon, and little traffic at night. Motorcycles are again part of the game, including the Ducati 999R and the hyper sport bike, Kawasaki Ninja ZX-14. Convertible cars, customizable interiors, in-game photo mode, and customizable exotics are all new additions.\n\nThe game is said to be the longest of the 4, with more than 10 different types of races including series races, tournaments, pink slip races, and even freeway races, there is always plenty to do. The player even has options. For each race the player must drive to the start line or racer which adds to why the game takes so long to beat. The races also have different difficulties. Easy, medium, hard, and hardest. The difficulties are color-coded with green being easy, yellow being medium, orange being hard, and red being hardest. Each difficulty race has greater rewards than the latter.\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n\n\n* GLOBE FILES 2012","torrent":{"xt":"urn:btih:6f10d1a5a83cb9b998d8d4f0b3ed31dee5b4009f","amp;dn":"%5BPSP%5D+MIDNIGHT+CLUB+L.A.+REMIX+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f10d1a5a83cb9b998d8d4f0b3ed31dee5b4009f","infoHashBuffer":{"type":"Buffer","data":[111,16,209,165,168,60,185,185,152,216,212,240,179,237,49,222,229,180,0,159]},"announce":[],"urlList":[]}}