{"title":"Cliff Richard - 40 Years Of Hits In Holland (1998)","uid":8665476,"size":470611362,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6fc29827ac15075b26295ac1873ec7976a5663de&amp;dn=Cliff+Richard+-+40+Years+Of+Hits+In+Holland+%281998%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":31,"time":1373399496,"description":"This is the same torrent that was uploaded to Demonoid in August 2011.\n\n\nCliff Richard - 40 Years Of Hits In Holland (1998)\n &lt;a href=&quot;\nhttp://img.amazon.ca/images/I/415DM75A4QL._SL500_AA300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img.amazon.ca/images/I/415DM75A4QL._SL500_AA300_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com) DVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nHas cover art only.\nAMG Bio.txt\nAMG Review.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nFirst biography paragraph from All Music (by Richie Unterberger):\n\nBritain's answer to Elvis Presley, Richard (born Harry Webb) dominated the pre-Beatles British pop scene in the late '50s and early '60s. An accomplished singer with a genuine feel for the music, Richard's artistic legacy is nonetheless meager, as he was quickly steered toward a middle-of-the-road pop direction. Several of his late-'50s recordings, however, were genuinely exciting Presley-esque rockers -- especially his first hit, &quot;Move It&quot; (1958) -- and gave British teenagers their first taste of genuine homegrown rock &amp; roll talent. Backed by the Shadows -- clean-cut instrumental virtuosos who became legends of their own -- Richard embarked on a truly awesome string of hit singles in Britain, scoring no less than 43 Top 20 hits between 1958 and 1969. One of these, although it was by no means one of the more successful, was an actual Mick Jagger/Keith Richards composition (the ballad &quot;Blue Turns to Grey&quot;).\n\nRead all of the bio at: &lt;a href=&quot;\nhttp://www.allmusic.com/artist/cliff-richard-p5265/biography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/artist/cliff-richard-p5265/biography&lt;/a&gt;\n\nAll Music Album Review (by Dave Thompson):\n\nCliff Richard scored his first Dutch hit in 1959, when &quot;Living Doll,&quot; his sixth U.K. hit (and first number one) conquered the Netherlands as effortlessly as it swept across the rest of Europe. And, no less than in any other country on the continent, it set the stage for a career that would still be going strong half a century later. This collection of Richard's biggest Dutch hit singles is, of course, no different than any other gathering of his biggest successes. Only one number, &quot;Maria No Mas&quot; (the lead track from 1963's When in Spain EP) will seem unfamiliar to U.K. chart-watchers; the remainder of the set travels through all the usual suspects (&quot;Nine Times Out of Ten,&quot; &quot;The Young Ones,&quot; &quot;Summer Holiday,&quot; &quot;Constantly,&quot; and so on), thick and fast through the first half of the 1960s, and then more sporadic as the decades wear on. Although the hits did not stop, their impact did lessen, and few people will complain that fully two-thirds of 40 Years of Hits in Holland are preoccupied with Richard's first five years of fame. Four songs from the 1970s and just two (1987's &quot;Some People&quot; and the previous year's Young Ones-led reprise of &quot;Living Doll&quot;) close the package -- which means, yes, the last ten of that titular 40 years don't even get a look. But the point is made, regardless. Richard was still scoring hits in 1998, just as he is today, and this collection was designed to remind his fans of a few of them.\n\nTaken from: &lt;a href=&quot;\nhttp://www.allmusic.com/album/40-years-of-hits-in-holland-r375505/review&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/40-years-of-hits-in-holland-r375505/review&lt;/a&gt;\n\nTrack List:\n\n01. Living Doll\n02. Please Don't Tease\n03. Nine Times Out Of Ten\n04. I Love You\n05. A Girl Like You\n06. The Young Ones\n07. Do You Wanna Dance\n08. It'll Be Me\n09. Bachelor Boy\n10. Summer Holiday\n11. Lucky Lips\n12. It's All In The Game\n13. Maria No Mas\n14. Constantly\n15. On The Beach\n16. I Could Easily Fall\n17. The Day I Met Marie\n18. Congratulations\n19. Good Times\n20. Power To All Our Friends\n21. Miss You Nights\n22. We Don't Talk Anymore\n23. Living Doll (Met The Young Ones)\n24. Some People\n","torrent":{"xt":"urn:btih:6fc29827ac15075b26295ac1873ec7976a5663de","amp;dn":"Cliff+Richard+-+40+Years+Of+Hits+In+Holland+%281998%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fc29827ac15075b26295ac1873ec7976a5663de","infoHashBuffer":{"type":"Buffer","data":[111,194,152,39,172,21,7,91,38,41,90,193,135,62,199,151,106,86,99,222]},"announce":[],"urlList":[]}}