{"title":"MCEO Grid-Keepers Conclave-1","uid":8697478,"size":5453191292,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:6fd2537358a6dda82b56ad3bc9809d04281ee983&amp;dn=MCEO+Grid-Keepers+Conclave-1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"GoAaT999","files":16,"time":1373995042,"description":"Join Team Indigo on their first &quot;official assignment&quot; as a Density Templar Team in Mount Shasta as they take partake in the &quot;Official Handing over of Telos Gate&quot; and instigation of the &quot;Redemption Contracts&quot;. After the Tauren Level of the Ta-KEY-on cycle was completed and the Tauren re-birthed and restored to its natural configuration (occurred during the Easter 2006 Phoenix workshop-TMR/4DVD) Team Indigo gathered to assist in completion of the re-birth of the natural Diad (3:3:3) StarLight and Miad 6:3:6 StarSeed Levels of the Ta-KEY-on Cycle.\n\nExperience an amazing technique with Team Indigo called &quot;The Urtha planetary MIAD StarSeed Rebirth and Monad Reclamation&quot;, where Team Indigo acted as a living conduit for the frequencies of the natural Miad rebirth that were arcing from the Sala's (Sun) shield to UrTha's shields, allowing the ancient (pre-Earth) Ur-Tha to serve this same role for those portions of the Earth shield and life-fields capable of anchoring the &quot;Host of Aurora&quot;. In this technique, experience the &quot;Gift of Eternal Love&quot; and the &quot;Return of the Aurora potential&quot; and learn about the &quot;Aurora Force&quot;, a set of frequencies gifted to us by the &quot;E-Sha-NeU-A Races&quot;, one of the 12 &quot;Aurora Races&quot; (The Guardian Hub Cross-Through Races that resided on the ancient Density One planet Ur-Tha before undergoing its StarFire Cycle 550 million years ago and before Earth fell from Taraand was hosted into Ur-Tha's Shields as part of the Amenti Rescue Mission).\n\nLearn about how the activation of the Aurora Force has the ability to restore not only an Eternal Life potential to the Indigo Shield and many parts of Earth and her Life Forms, but also to create the potential for many of the Fallen Races within this Time Matrix (including many of the Anunaki Races, Budhara, Belil Mahatma and the Wesedak Races) to accept &quot;Amnesty Contracts&quot; which will allow them to exist in a Finite but Kristic Evolutionary Universe separate from the Wesedrak/Thetan Metatronic Black Hole.\n\nIn this workshop, you will work with these Aurora Forces to begin activation of the &quot;Krystar Containment Vehicle&quot; through activation of the natural &quot;ReU-Ta Clusters&quot; which will prevent activation of the 5:5 mutation and the &quot;Death Star Harness&quot; associated with the Metatronic Black Hole Evolutionary Path. You will also learn the delightful melodious base-tones for the First Song of Aurora, which will assist us all in accreting the Lights of Aurora within every physical/atomic aspect of our Density One bodies. This workshop also contains one of the most fascinating accounts of the origins of the Fallen races (including the Equarie, Wesdaks, Wesedraks, Thetans and the Red and Green Dragon Races) and the Guardian Races (E-Sha-NeU-A, Aquarie- Bendhi and the Golden &amp; Blue Dragon Races) within this Time Matrix and also a profound dissertation of the &quot;WHY&quot; behind the Drama that has been associated with this Time Matrix and those associated with the adjacent Eckasha.","torrent":{"xt":"urn:btih:6fd2537358a6dda82b56ad3bc9809d04281ee983","amp;dn":"MCEO+Grid-Keepers+Conclave-1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fd2537358a6dda82b56ad3bc9809d04281ee983","infoHashBuffer":{"type":"Buffer","data":[111,210,83,115,88,166,221,168,43,86,173,59,201,128,157,4,40,30,233,131]},"announce":[],"urlList":[]}}