{"title":"Antonia Fraser - The Wives of Henry VIII [unabridged]","uid":7029381,"size":579470854,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:710d49556ae92f40e0632f273e2091b715c963ac&amp;dn=Antonia+Fraser+-+The+Wives+of+Henry+VIII+%5Bunabridged%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lucybabe","files":227,"time":1329177709,"description":"Fraser ( Mary, Queen of Scots ) here turns to the reign of Henry VIII, who ruled from 1509-1547, and the six women he married: Catherine of Aragon, Anne Boleyn, Jane Seymour, Anna of Cleves, Katherine Howard and Catherine Parr. From her scrupulous research and informed interpretations of historical events, Fraser succeeds in presenting Henry's queens as complex and intelligent women who struggled to express themselves in a world where females were subservient to and ruled by men. Catherine of Aragon, married to Henry for 20 years, displayed cleverness and bravery when she fought her husband's attempts to divorce her. Anne Boleyn, a learned woman, was innocent of the adultery she was accused of, but was beheaded because she could not produce a son. Unlettered, 21-year-old Katherine Howard, queen for just 18 months when she was beheaded in 1542 for the &quot;violent presumption&quot; she had committed adultery, met death on the block where her cousin Anne Boleyn had died six years earlier. By firmly anchoring each woman's fate in Henry's failure to be philoprogenitive--most crucially in not producing male heirs--Fraser makes a major contribution to feminist scholarship.","torrent":{"xt":"urn:btih:710d49556ae92f40e0632f273e2091b715c963ac","amp;dn":"Antonia+Fraser+-+The+Wives+of+Henry+VIII+%5Bunabridged%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"710d49556ae92f40e0632f273e2091b715c963ac","infoHashBuffer":{"type":"Buffer","data":[113,13,73,85,106,233,47,64,224,99,47,39,62,32,145,183,21,201,99,172]},"announce":[],"urlList":[]}}