{"title":"Kamelot - The Great Pandemonium (2nafish)","uid":5909638,"size":158558212,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:71d88a856e978e8c7e315721064743c7b76f6c91&amp;dn=Kamelot+-+The+Great+Pandemonium+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1288000791,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\nPoetry for the Poisoned is the ninth studio album from metal band Kamelot. It was released on the earMUSIC label, a subdivision of Edel, on September 10, 2010 in Europe, and four days later in North America by the band's own label, KMG Recordings. The release was the first to feature Sean Tibbetts on bass guitar. A video was recorded for the song &quot;The Great Pandemonium&quot; and released on the bands official YouTube channel on September 6.\n\nKamelot is an American power metal band from Tampa, Florida. The band was formed by Thomas Youngblood and Richard Warner in 1991. Norwegian vocalist Roy Khan joined for the album SiÃƒÂ©ge Perilous, and has shared song-writing duties with Youngblood since.\n\nAs of 2010, Kamelot has released nine studio albums, two live albums, one live DVD, seven music videos and a reissue of Ghost Opera that includes an additional disc with ten live recordings and four bonus tracks. Their most current studio album is Poetry for the Poisoned, which was released in September 2010. \n\nIn January, 2009, Kamelot started working on their ninth studio album in a cabin in Norway. In December 2009, Thomas Youngblood announced that bassist Glenn Barry had officially left the band. He was since replaced by touring bassist and original Kamelot member Sean Tibbetts. On January 27th, 2010, Kamelot published the titles of three songs from the upcoming album on their official website: &quot;The Great Pandemonium&quot;, &quot;Hunter's Season&quot; and &quot;Thespian Drama&quot;. The interview also stated the band was exploring &quot;new sounds&quot; and that the topics on the new album will be diverse. On February 19th, 2010,it was announced that Simone Simons has provided her vocal parts for the band's newest ballad, &quot;House on a Hill&quot; and also for the album's title track. It was also announced that more special guests would be revealed soon. On March 25, 2010, they began their &quot;Pandemonium Over Europe&quot; tour. The tour ended on April 26, 2010. On May 18, 2010 it was announced that Gus G, of the Greek power metal band Firewind, would be appearing as a guest musician.  It was revealed on June 21, 2010, that their ninth studio album would be titled Poetry for the Poisoned and released by earMUSIC, international label of the entertainment group Edel. Its European release date is September 10, 2010. The North American release date is September 14, 2010. A music video for &quot;The Great Pandemonium&quot; was released on September 1, 2010. It was directed by Owe Lingvall. On September 6, the band announced that Roy Khan, their lead singer, fell severely ill during rehearsals for the upcoming North American tour, just a few days before it's scheduled start, and returned to Norway. He is currently under medical care, and the band has not made any additional statements regarding his condition. While it was originally reported that the band would continue the tour with Norwegian vocalist Michael Eriksen in Khan's place, the band later announced that they would postpone the tour until Khan recovered from his illness so he could join them on the tour. Poetry for the Poisoned debuted at number 74 in the Billboard 200 charts, shifting 6.100 copies in its first week. (Source: Blabbermouth, Kamelot.com)\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:71d88a856e978e8c7e315721064743c7b76f6c91","amp;dn":"Kamelot+-+The+Great+Pandemonium+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71d88a856e978e8c7e315721064743c7b76f6c91","infoHashBuffer":{"type":"Buffer","data":[113,216,138,133,110,151,142,140,126,49,87,33,6,71,67,199,183,111,108,145]},"announce":[],"urlList":[]}}