{"title":"Los Simuladores DvdFull","uid":15418252,"size":28026171392,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7252d0cc556ba3854f1f2272a5fa053959a0e52c&amp;dn=Los+Simuladores+DvdFull&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"OstDvd77","files":6,"time":1469609792,"description":"The Pretenders (Los Simuladores) are a specialized comand group form by 4 men, which are hired by someone that presents them a problem and wants a resolution. Los Simuladores elaborate different operations, pretending different roles, according to that person problem, with the purpose of resolving everyone of them.\r\n- Written by nacho-casal2010\r\n\r\nSerie de TV (2002-2003). 2 temporadas. 24 episodios. Teleserie argentina en torno a un grupo de cuatro socios que se dedican al negocio de la &quot;simulación&quot;, resolviendo los problemas y necesidades de sus clientes mediante lo que ellos denominan &quot;operativos de simulación&quot; que suelen consistir en engañar a quienes generan los problemas de sus clientes (jefes, criminales, esposas, viudas, comerciantes inescrupulosos, etc.). En España se realizó un remake de la serie. (FILMAFFINITY)\r\n\r\nHace no muchas semanas tuve el agrado de conocer &quot;Los Simuladores&quot;, una verdadera joya argentina que había pasado por alto. Luego de ver absolutamente todos los capítulos (consta de 2 temporadas), me percaté de cuál es la química que logra algo tan bueno: excelente guión bien llevado por el director, y por sobre todo, inmejorables actuaciones (no solo del cuarteto principal, los personajes secundarios también tienen su mérito). Creo que es una serie que quedará en los corazones de todos: La gracia de los personajes, el carisma con que encaran el papel los actores (un genio este Peretti); los alocados, irreales, psicodélicos planes de simulación; un humor de salón, de a ratos fino, de a ratos tonto... Y por fin, una grata defensa de lo artístico con toques &quot;retro&quot;, y una muestra de lo que tiene la Argentina que ha quedado en el olvido. Así que... disculpe, ¿fuego tiene?","torrent":{"xt":"urn:btih:7252d0cc556ba3854f1f2272a5fa053959a0e52c","amp;dn":"Los+Simuladores+DvdFull","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7252d0cc556ba3854f1f2272a5fa053959a0e52c","infoHashBuffer":{"type":"Buffer","data":[114,82,208,204,85,107,163,133,79,31,34,114,165,250,5,57,89,160,229,44]},"announce":[],"urlList":[]}}