{"title":"[XVID-AC3-MP3-ITA] I 10 Comandamenti cd 1 e  2[volpebianca]","uid":4697220,"size":1739253760,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:731fe302d45db86a59065635b2d107e8c2fd4526&amp;dn=%5BXVID-AC3-MP3-ITA%5D+I+10+Comandamenti+cd+1+e++2%5Bvolpebianca%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Volpebianca","files":2,"time":1233597975,"description":"MosÃƒÂ¨, figlio di genitori ebrei, essendo scampato alla strage dei primogeniti, viene allevato dalla sorella del sovrano d'Egitto. Fatto adulto, s'illustra con valorose imprese, meritando il titolo di Principe e di &quot;futuro Faraone&quot;. Quando apprende qual ÃƒÂ¨ la sua vera origine, MosÃƒÂ¨ rinuncia ai privilegi della sua condizione principesca e si unisce al suo popolo, ridotto in schiavitÃƒÂ¹. Il suo posto alla corte del faraone ÃƒÂ¨ preso da Ramesse, il quale abbandona MosÃƒÂ¨ nel deserto. Guidato dalla divina volontÃƒÂ , MosÃƒÂ¨ vaga nel deserto, finchÃƒÂ¨ viene accolto dal capo di una tribÃƒÂ¹, che gli dÃƒÂ  in moglie una delle sue figliole. Qualche tempo dopo MosÃƒÂ¨ sale sul Monte Sinai e, giunto davanti al Roveto Ardente, ode la voce del Signore che gli comanda di liberare i figli d'Israele. Presentatosi al Faraone, MosÃƒÂ¨ chiede invano la liberazione del suo popolo: tremendi castighi si abbattono sull'Egitto, finchÃƒÂ¨ Ramesse si piega al volere di Dio. Guidati da MosÃƒÂ¨, da Aronne e da GiosuÃƒÂ¨, gli ebrei si dirigono verso la riva del Mar Rosso. Dopo la loro partenza, Ramesse, istigato dalla moglie, ordina alle sue armate di inseguirli. Ma una colonna di fuoco si frappone tra l'esercito egiziano e gli ebrei. Quando questi giungono alla riva del Mar Rosso, MosÃƒÂ¨, in nome del Signore, comanda alle acque di dividersi e di lasciar passare il popolo eletto. Gli ebrei attraversano il lungo passaggio, giungendo all'altra riva. Anche l'esercito del Faraone, inseguendoli, s'avventura nel passaggio, ma viene sommerso. Arrivato ai piedi del Monte Sinai, il popolo si accampa, mentre MosÃƒÂ¨ sale sul monte, dove, dopo quaranta giorni, riceve dal Signore le Tavole della Legge. Nel frattempo gli Ebrei si sono lasciati trascinare all'idolatria e adorano un vitello d'oro. Sceso dal Sinai, MosÃƒÂ¨ distrugge l'idolo e riconduce il suo popolo alla vera fede. Vecchio e stanco, il condottiero d'Israele chiude gli occhi, dopo aver scorto lontano, al di lÃƒÂ  del Giordano, la Terra Promessa.\n\nwww.volpebianca.org","torrent":{"xt":"urn:btih:731fe302d45db86a59065635b2d107e8c2fd4526","amp;dn":"%5BXVID-AC3-MP3-ITA%5D+I+10+Comandamenti+cd+1+e++2%5Bvolpebianca%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"731fe302d45db86a59065635b2d107e8c2fd4526","infoHashBuffer":{"type":"Buffer","data":[115,31,227,2,212,93,184,106,89,6,86,53,178,209,7,232,194,253,69,38]},"announce":[],"urlList":[]}}