{"title":"Neil deGrasse Tyson - Space Chronicles Facing the Ultimate Front","uid":13134210,"size":154555637,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:74c1c155289461615022affa9e05883b6259d91d&amp;dn=Neil+deGrasse+Tyson+-+Space+Chronicles+Facing+the+Ultimate+Front&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cybotage","files":2,"time":1451878457,"description":"Neil deGrasse Tyson - Space Chronicles Facing the Ultimate Frontier\r\n\r\n\r\n\r\nAmerica’s space program is at a turning point. After decades of global primacy, NASA has ended the space-shuttle program, cutting off its access to space. No astronauts will be launched in an American craft, from American soil, until the 2020s, and NASA may soon find itself eclipsed by other countries’ space programs.\r\n\r\n\r\nWith his signature wit and thought-provoking insights, Neil deGrasse Tyson—one of our foremost thinkers on all things space—illuminates the past, present, and future of space exploration and brilliantly reminds us why NASA matters now as much as ever. As Tyson reveals, exploring the space frontier can profoundly enrich many aspects of our daily lives, from education systems and the economy to national security and morale. For America to maintain its status as a global leader and a technological innovator, he explains, we must regain our enthusiasm and curiosity about what lies beyond our world.\r\n\r\n\r\nProvocative, humorous, and wonderfully readable, Space Chronicles represents the best of Tyson’s recent commentary, including a must-read prologue on NASA and partisan politics. Reflecting on topics that range from scientific literacy to space-travel missteps, Tyson gives us an urgent, clear-eyed, and ultimately inspiring vision for the future","torrent":{"xt":"urn:btih:74c1c155289461615022affa9e05883b6259d91d","amp;dn":"Neil+deGrasse+Tyson+-+Space+Chronicles+Facing+the+Ultimate+Front","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74c1c155289461615022affa9e05883b6259d91d","infoHashBuffer":{"type":"Buffer","data":[116,193,193,85,40,148,97,97,80,34,175,250,158,5,136,59,98,89,217,29]},"announce":[],"urlList":[]}}