{"title":"Aki Takase &amp; Louis Sclavis - Yokohama (2009)","uid":6861191,"size":409713307,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:74f1711fefb236503fc3588b223d954f7ce79698&amp;dn=Aki+Takase+%26amp%3B+Louis+Sclavis+-+Yokohama+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"mariorg","files":33,"time":1322908271,"description":"Intakt Records: Intakt CD 165 &lt;a href=&quot;\nhttp://www.intaktrec.ch/165-a.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.intaktrec.ch/165-a.htm&lt;/a&gt;\n\n* Aki Takase: piano\n* Louis Sclavis: clarinet, bass clarinet, soprano saxophone\n &lt;a href=&quot;\nhttp://www.akitakase.de/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.akitakase.de/&lt;/a&gt;\n\nReview\n~~~~~~\nBy Nic Jones &lt;a href=&quot;\nhttp://www.allaboutjazz.com/php/article.php?id=34558&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allaboutjazz.com/php/article.php?id=34558&lt;/a&gt;\n\nAki Takase is making a real burden for herself with this the latest in her\nhopefully ongoing series of Intakt releases. With every successive one it's not\njust a simple matter of the quality going up but rather a matter of different\nfacets of her ability being revealed. As these releases have all been documents\nof duos, the effect is almost rhetorical, as if she's intent on making a case\nfor that sparse setting and what can be achieved in it.\n\nThere's diversity within that body of work too, just as there is within this\nprogram. Louis Sclavis' modest raft of reeds is as fulfilling a foil for Takase\nas any of her previous partners, and the duo covers a broad musical range with\naplomb. &quot;Yokohama&quot; is both lyrical and unworldly, the latter quality exemplified\nby Takase's work under the piano lid. On bass clarinet, Sclavis exhibits a\npurity of tone which sets him at odds with the obvious precedent of Eric\nDolphy.\n\nOn soprano sax, as he is on the brief &quot;Shower,&quot; Sclavis is also something\nelse. This straight horn is so rife with precedents in the realms of the free\nand the near free that Sclavis' ability to avoid them all is a feat in\nitself. There's a truth about the dialog here that belies the perhaps casual\nnature of improvised music and, in just over two minutes, the duo makes as\npotent a case for it as anyone could hope for.\n\nThe impressionism of &quot;Raw Silk&quot; conjures up an odd parallel with the chamber\nworks of Claude Debussy through the way in which the duo seems to flirt with a\nmelodic line even while it subjects it to all sorts of subversion from beneath\nin a manner that the French composer would never have entertained.\n\nIn a way Sclavis proves why he's so amenable to the ECM label's production\nmethodology on &quot;Le Temps D'Apres,&quot; but as it turns out there's whole lot more\nthan surface sheen to this music, even while the duo gets as close as they ever\ndo here to the conventional roles of soloist and accompanist.\n\nOn &quot;Ligne De Fuite,&quot; they work a seam that's equal parts serial music and the\nwork of the Jimmy Giuffre trio with Paul Bley and Gary Peacock. The end result\nis happily dissimilar, however, with both players asserting their individuality\nin a fashion only music as rarefied as this perhaps permits. As elsewhere, the\near is rewarded and the intellect stimulated in a fashion that's far from\ncommon.\n\n--\n\nPor Pachi Tapiz &lt;a href=&quot;\nhttp://www.tomajazz.com/discos/breves.php?d=2010-04-01#akls_y&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tomajazz.com/discos/breves.php?d=2010-04-01#akls_y&lt;/a&gt;","torrent":{"xt":"urn:btih:74f1711fefb236503fc3588b223d954f7ce79698","amp;dn":"Aki+Takase+%26amp%3B+Louis+Sclavis+-+Yokohama+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74f1711fefb236503fc3588b223d954f7ce79698","infoHashBuffer":{"type":"Buffer","data":[116,241,113,31,239,178,54,80,63,195,88,139,34,61,149,79,124,231,150,152]},"announce":[],"urlList":[]}}