{"title":"Concise Encyclopedia of Languages of the World{BBS}","uid":6622090,"size":17925656,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7590dc1681d09461c288269b4f2345c1893663a3&amp;dn=Concise+Encyclopedia+of+Languages+of+the+World%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1314031771,"description":"Concise Encyclopedia of Languages of the World is an authoritative single-volume reference resource comprehensively describing the major languages and language families of the world.\n\nIt will provide full descriptions of the phonology, semantics, morphology, and syntax of the world's major languages, giving insights into their structure, history and development, sounds, meaning, structure, and language family, thereby both highlighting their diversity for comparative study, and contextualizing them according to their genetic relationships and regional distribution.\n\nBased on the highly acclaimed and award-winning Encyclopedia of Language and Linguistics, this volume will provide an edited collection of almost 400 articles throughout which a representative subset of the world's major languages are unfolded and explained in up-to-date terminology and authoritative interpretation, by the leading scholars in linguistics.\n\nIn highlighting the diversity of the world's languages - from the thriving to the endangered and extinct - this work will be the first point of call to any language expert interested in this huge area. No other single volume will match the extent of language coverage or the authority of the contributors of Concise Encyclopedia of Languages of the World.\n\n* Extraordinary breadth of coverage: a comprehensive selection of just under 400 articles covering the world's major languages, language families, and classification structures, issues and disputes\n* Peerless quality: based on 20 years of academic development on two editions of the leading reference resource in linguistics, Encyclopedia of Language and Linguistics\n* Unique authorship: 350 of the world's leading experts brought together for one purpose\n* Exceptional editorial selection, review and validation process: Keith Brown and Sarah Ogilvie act as first-tier guarantors for article quality and coverage\n* Compact and affordable: one-volume format makes this suitable for personal study at any institution interested in areal, descriptive, or comparative language study - and at a fraction of the cost of the full encyclopedia \n\n\n\n\n# Hardcover: 1320 pages\n# Publisher: Elsevier Science; 1 edition (November 11, 2008)\n# Language: English\n# ISBN-10: 0080877745\n# ISBN-13: 978-0080877747","torrent":{"xt":"urn:btih:7590dc1681d09461c288269b4f2345c1893663a3","amp;dn":"Concise+Encyclopedia+of+Languages+of+the+World%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7590dc1681d09461c288269b4f2345c1893663a3","infoHashBuffer":{"type":"Buffer","data":[117,144,220,22,129,208,148,97,194,136,38,155,79,35,69,193,137,54,99,163]},"announce":[],"urlList":[]}}