{"title":"Richard Carrier - Proving History (mobi, epub)","uid":7552394,"size":1954237,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:75e0dc097b30616c98e0126f1b13f47fa21b82a8&amp;dn=Richard+Carrier+-+Proving+History+%28mobi%2C+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"5o4plan","files":2,"time":1345515117,"description":"Proving History: Bayes's Theorem and the Quest for the Historical Jesus\n\nAlmost all experts agree that the Jesus of the Bible is a composite of myth, legend, and some historical evidence. So what can we know about the real Jesus?\n\nFor more than one hundred fifty years, scholars have attempted to answer this question. Unfortunately, the &quot;Quest for the Historical Jesus&quot; has produced as many different images of the original Jesus as the scholars who have studied the subject. The result is a confused mass of disparate opinions with no consensus view of what actually happened at the dawn of Christianity.\n\nIn this in-depth discussion of New Testament scholarship and the challenges of history as a whole, historian Richard C. Carrier proposes Bayes's theorem as a solution to the problem of establishing reliable historical criteria. He demonstrates that valid historical methods--not only in the study of Christian origins but in any historical study--can be described by, and reduced to, the logic of Bayes's theorem. Conversely, he argues that any method that cannot be reduced to Bayes's theorem is invalid and should be abandoned.\n\nWriting with thoroughness and admirable clarity, Carrier explains Bayes's theorem in terms easily understandable to historians and lay people alike, employing nothing more than well-known primary school math. He then explores the theorem's application to history and addresses numerous challenges to and criticisms of this application. Common historical methods are analyzed using the theorem, as well as all the major &quot;historicity criteria&quot; employed in the latest quest for the historical Jesus. The author demonstrates not only their deficiencies but also ways to rehabilitate them.\n\nAnyone with an interest in historical methods, epistemology generally, or the study of the historical Jesus will find Carrier's book to be an essential work.\n\nRICHARD C. CARRIER (Richmond, CA), an independent scholar, is the author of Why I Am Not a Christian: Four Conclusive Reasons to Reject the Faith; Not the Impossible Faith: Why Christianity Didn't Need a Miracle to Succeed; and Sense and Goodness without God: A Defense of Metaphysical Naturalism. He has also contributed chapters to The End of Christianity, edited by John W. Loftus; Sources of the Jesus Tradition: Separating History from Myth, edited by R. Joseph Hoffmann; The Christian Delusion: Why Faith Fails, edited by John W. Loftus; and The Empty Tomb: Jesus beyond the Grave, edited by Robert Price and Jeffery Lowder. \n\nAuthor: Richard Carrier\nPublisher: Prometheus Books\nPublication: April 3, 2012\n\nFormats:\n.mobi (compatible with Amazon Kindle, etc.)\n.epub (compatible with Sony Reader, Cruz Reader, iPad, iPodTouch/iPhone, etc.)\n","torrent":{"xt":"urn:btih:75e0dc097b30616c98e0126f1b13f47fa21b82a8","amp;dn":"Richard+Carrier+-+Proving+History+%28mobi%2C+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75e0dc097b30616c98e0126f1b13f47fa21b82a8","infoHashBuffer":{"type":"Buffer","data":[117,224,220,9,123,48,97,108,152,224,18,111,27,19,244,127,162,27,130,168]},"announce":[],"urlList":[]}}