{"title":"Learning XNA 3.0: XNA 3.0 Game Development for the PC, Xbox 360,","uid":4734850,"size":6037079,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:771b221d750f3e6505207bb7ce901ac61a73c16b&amp;dn=Learning+XNA+3.0%3A+XNA+3.0+Game+Development+for+the+PC%2C+Xbox+360%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"VasiaZozulia","files":-1,"time":1235230529,"description":"Do you have what it takes to become a game developer? With this hands-on book, you'll learn quickly and easily how to develop computer games with Microsoft's XNA 3.0 framework-not just for your PC, but for Xbox 360 and the Microsoft Zune as well.\n\nWritten by an experienced university-level game development instructor, Learning XNA 3.0 walks you through the framework in a clear and understandable step-by-step format. Each chapter offers a self-contained lesson with lots of illustrations and annotated examples to help you master key concepts. Once you finish the book, you'll know how to develop sophisticated games from start to finish.\n\n* Learn game development concepts from 2D animation to 3D cameras and effects\n* Delve into high-level shader language (HLSL) and introductory artificial intelligence concepts\n* Develop three complete and exciting games using 2D,3D and multiplayer concepts\n* Develop and deploy games to the Xbox 360 and the Microsoft Zune\n\nWhile teaching XNA to beginning game developers, author Aaron Reed noticed that several key concepts were difficult for students to grasp. Learning XNA 3.0 was written specifically to address those issues. With this book, you can test your understanding and practice new skills as you go with unique &quot;Test Your Knowledge&quot; exercises and review questions in each chapter.\n\nWhy wait? Amaze your family and friends by building your own games for the PC, Xbox 360, and Zune-with Learning XNA 3.0.\n\n&quot;An outstanding book! Teaches you XNA development in a smart way, starting from 2D basics and going into 3D and shader development. What I really like is the 'peeling the onion' approach the author takes, which builds up knowledge from previous chapters.&quot; --David &quot;LetsKillDave&quot; Weller, CEO, Cogito Ergonomics, LLC, and former XNA program manager \n\n","torrent":{"xt":"urn:btih:771b221d750f3e6505207bb7ce901ac61a73c16b","amp;dn":"Learning+XNA+3.0%3A+XNA+3.0+Game+Development+for+the+PC%2C+Xbox+360%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"771b221d750f3e6505207bb7ce901ac61a73c16b","infoHashBuffer":{"type":"Buffer","data":[119,27,34,29,117,15,62,101,5,32,123,183,206,144,26,198,26,115,193,107]},"announce":[],"urlList":[]}}