{"title":"In the Basement of the Ivory Tower - epub","uid":6447752,"size":300517,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:782defd2d6a2c48d4b22738af25c19d9f8b2ee67&amp;dn=In+the+Basement+of+the+Ivory+Tower+-+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1307323482,"description":"In the Basement of the Ivory Tower: Confessions of an Accidental Academic\n\n\nA caustic expose of the deeply state of our colleges-America's most expensive Ponzi scheme. What drives a former English major with a creative writing degree, several unpublished novels, three kids, and a straining marriage to take a job as a night teacher at a second-rate college? An unaffordable mortgage. As his house starts falling apart in every imaginable way, Professor X grabs first one, then two jobs teaching English 101 and 102-composition and literature-at a small private college and a local community college. He finds himself on the front lines of America's academic crisis. It's quite an education. This is the story of what he learns about his struggling pupils, about the college system-a business more bent on its own financial targets than the wellbeing of its students-about the classics he rediscovers, and about himself. Funny, wry, self-deprecating, and a provocative indictment of our failing schools, In the Basement of the Ivory Tower is both a brilliant academic satire and a poignant account of one teacher's seismic frustration-and unlikely salvation-as his real estate woes catapult him into a subprime crisis of an altogether more human nature.","torrent":{"xt":"urn:btih:782defd2d6a2c48d4b22738af25c19d9f8b2ee67","amp;dn":"In+the+Basement+of+the+Ivory+Tower+-+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"782defd2d6a2c48d4b22738af25c19d9f8b2ee67","infoHashBuffer":{"type":"Buffer","data":[120,45,239,210,214,162,196,141,75,34,115,138,242,92,25,217,248,178,238,103]},"announce":[],"urlList":[]}}