{"title":"500 HD Astronomy Backgrounds and Space Wallpapers","uid":9322370,"size":1056085134,"categoryP":"other","categoryS":"pictures","magnet":"?xt=urn:btih:7877cc68252a42c6360b7a71d26842a5966bc370&amp;dn=500+HD+Astronomy+Backgrounds+and+Space+Wallpapers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"me2soundtrack","files":499,"time":1386573644,"description":"These are 500 high resolution, high quality astronomy, astrophysics, and space related wallpapers taken from the Astronomy Picture of the Day (APOD), Hubble Space Telescope, and other sites. As a professional astronomer, I selected what I believed were the finest, most beautiful, and most dramatic images, covering everything from the Sun, the Earth, the solar system, to the star forming and reflection nebulae, all the way to distant galaxies and galaxy clusters.\n\nIf you think you can achieve the same thing by downloading the whole APOD or other sites yourself, think twice---space sites are filled with very interesting but not very beautiful (or sufficiently high resolution) images. I've done the hard work of picking out only the ones that are suitable to be used for backdrops on HD monitors.\n\nOf the 500 pictures, 498 are better than 720p; 370 are better than 1920x1080; and 75 are better than 3840Ã—2160.\n\nFor the most part, these are actual recorded light images; only a few are artist's conception. Note that non-optical waveband images are by necessity false color, yet we astronomers are careful about making false color images (like those taken in the X-ray and infrared) as accurate a reflection of the system's energetics as possible.\n\nI have edited images to improve quality and suitability for usage as wallpapers as follows. I have removed almost all of the annoying text and border decorations that occur typically in such images, leaving 100% pure beauty when possible. Whenever the images were large and oversampled (e.g., 4000x4000 images where the stars were blurry or noisy at 1:1 zoom), I have tried to perform noise-reducing image reduction to a saner resolution for higher quality at 1:1.\n\nUse these wallpapers with the &quot;Zoom&quot; function of your desktop. Trust me---if you are a space fan and do not have a similar collection of your own, you will enjoy these wallpapers.\t\t\t\t\n\nThis an update of an older torrent containing 300 images---this version now replaces it.","torrent":{"xt":"urn:btih:7877cc68252a42c6360b7a71d26842a5966bc370","amp;dn":"500+HD+Astronomy+Backgrounds+and+Space+Wallpapers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7877cc68252a42c6360b7a71d26842a5966bc370","infoHashBuffer":{"type":"Buffer","data":[120,119,204,104,37,42,66,198,54,11,122,113,210,104,66,165,150,107,195,112]},"announce":[],"urlList":[]}}