{"title":"12 Angry Men (1957) H.264 HDTV (moviesbyrizzo) 384k audio AC3","uid":7046022,"size":4692431710,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:7922fdf1950ebe5fce9da03faf23c2e9dc979ba1&amp;dn=12+Angry+Men+%281957%29+H.264+HDTV+%28moviesbyrizzo%29+384k+audio+AC3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moviesbyrizzo","files":-1,"time":1329745681,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0050083/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0050083/&lt;/a&gt;\n\nThis movie was made in Black and White photography, however you'll be pleased\nwith the movie theater quality of this rich bitrate 720p movie file which even\nhas 384k ac3 Dolby 5.1 audio included. Its not a long movie, so the bitrate is\ngenerous indeed. 1200 X 720p H.264 mkv at 6120k video bitrate\n\nWe first put this movie up in 2GB and got &quot;awesome&quot; reviews of its quality\nin both video and audio. We now bring it to you at full size mkv \nH.264 just as we first found it on the net ages ago. We haven't found\na better quality version - we even compared to a 1080p version out there\nand found this hdtv version to be superior as have those that have commented\nas indicated I'm sure. small MGM logo appears on screen\n\nThis 4.37GB file is yet within the size to fit on the cheapest sized dvd discs\n(dvd5) so that it is practical to download and use and share. We tried this on\na blank HP dvd5 using nero express software and it burned onto the disc just fine\nwith 100% successful automatic final disc verification by nero\n\n\nReview:\n\n12 Angry men is one of the most important courtroom/jury room dramas ever to\ncome out of the United states. The question presented to us in this great movie\nofferings is this: Is there justice in the level of discourse that is being \noffered. Is the articulation on the issues in fact valid or is it semantic like\nargument on feigns of dubious validity. If a case appears as it should: &quot;open and \nshut&quot; - is that reason enough to start to discount it? Should you decide that \neverything that could go the other way hypothetically, no matter how remote the \npossibility, that should be the order of the day of a particular brand of &quot;more\npure&quot; justice? Should the prejudices carried by members of the jury or testifying \nwitnesses be reason enough to negate and retard their testimony? should they be \nrequired as jury members to vote the other side instead? The OJ Simpson criminal\ntrial contained all of these elements in the minds of those who assembled not too \nlong ago on a PBS panel inquiry headed by talk show host Mr. Charlie Rose. The \nownership of property in and of itself should never be sufficient qualification to \nsit on a jury to decide the fate of members of the community. Instead, a sound \ngrounding in values that are humanistically pure and demonstrably so, combined \nwith sound reasoning skills and experience in the proper and right application of \nlegal principles that come from this sound philosophical basis should rule, and be \nthe requirement. So a panel of judges perhaps, appointed on more than their \nconnections within legal circles as it presently is comprised, rather on an open \ncontest in which real votes for merit may be clearly exercised in the protection \nof all. \n\nOtherwise, we could someday die for no other reason than a lack of restraint in \nthe environment caused by a complete breakdown in the expectation of justice based \non jury members that are nothing more than proxies for those that would inflict \ntheir own brand of justice instead. The OJ Simspon affair should raise just such \nalarm bells as the second trial rightly pointed out, however it came too late to \nimpose penalties to fit the crime - financial constraints that were imposed \nsubsequently on the defendant could hardly be deemed sane enough for anyone that \nwas looking in at the situation in objective fashion unable to do nothing but \n&quot;shake their heads&quot; in amazement that this could go on without a public scream \nthat should never end until the righter outcome is seen through instead.\n\n\nMichael Rizzo Chessman\nmoviesbyrizzo\n\nWe now have sourced for you the following subtitles which are finally included\nhere for all of the following:\n\nBulgarian\nCroatian\nCzech\nDanish\nDutch\nEnglish\nEstonian\nFinnish\nFrench\nGerman\nGreek\nHungarian\nItalian\nNorwegian\nPolish\nPortuguese\nRomanian\nSerbian\nSlovenian\nSpanish\nSwedish\n\nTo use one of the subtitles simply copy the srt file from one of the the \nincluded language folders so that its is together with the mkv\n\nIf you don't require subtitles to view this movie, please turn them off using\nyour player controls as the english captions otherwise come on automatically\nin this mkv (as we found it on the net)\n","torrent":{"xt":"urn:btih:7922fdf1950ebe5fce9da03faf23c2e9dc979ba1","amp;dn":"12+Angry+Men+%281957%29+H.264+HDTV+%28moviesbyrizzo%29+384k+audio+AC3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7922fdf1950ebe5fce9da03faf23c2e9dc979ba1","infoHashBuffer":{"type":"Buffer","data":[121,34,253,241,149,14,190,95,206,157,160,63,175,35,194,233,220,151,155,161]},"announce":[],"urlList":[]}}