{"title":"Open_Air_Stereo-Primates-(Retail)-2013-HHI","uid":8571012,"size":65703922,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7a78abf9379820f9c11dcc76c72b416da8913aff&amp;dn=Open_Air_Stereo-Primates-%28Retail%29-2013-HHI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"raidy","files":14,"time":1371151794,"description":"Artist......: Open air stereo\nAlbum.......: Primates\nGrabber     : EAC (secure mode rip!)\nEncoder.....: LAME v3.90.3 --alt-preset standard\nRelease Date: May-21-2013\nRip Date....: Jun-13-2013\nRipped by...: [HHI] - Happy Hacker Industries - [HHI]\nGenre.......: Rock &amp; roll\nQuality     : VBRkbps / 44.1kHz / Joint-Stereo\nPlaytime    : 37:04 min\nCD Songs    : 11\nLabel.......: Goomba Music\nReleaseNotes:\n\nEleven years is a long time for any band to stay together, let alone for one band to finally see the release of their debut album, but for Open Air Stereo, they wouldn t have wanted it to happen any other way.\n\nMany bands never make it eleven years; The Beatles couldn t even manage to stay\ntogether for that long. For the two founding members of Open Air Stereo, lead-singer Chase Johnson and drummer Nick Gross, eleven years has been just what the band needed to grow as individuals, to develop as a band, and to perfect their songwriting craft alongside bassist Evan Smith and guitarist Scott Pounds, who were brought on board by Johnson and Gross in order to complete the classic 4-member rock-band lineup.\n\nIt s obvious from the first time you hear a song off Open Air Stereo s 10-song debut album Primates that the band know exactly what they are doing; that much is clear from the rush of guitars and explosive percussion that punctuate all three minutes of Love Is Blind, which gives the impression not of a band just putting out their first record  but one that has multiple albums and world-tours under their belt, like perennial festival headliners Foo Fighters. Living Proof continues in this same vein, sounding like the best song that Audioslave never wrote, with a guitar lick straight out of the Tom Morello Guide To Awesome Guitar Licks.\n\nOpen Air Stereo show they are ready to headline music festivals and sell out stadiums with the slow-burning Damned, which begins as a simple piano progression with pulsating bass and an insistent kick drum, before the band slowly adds more and more layers to the song, building to a triumphant sing-along chorus. Open Air Stereo change things up and can show their sentimental side on the beautiful, tender Stuck On You. With so many sure-footed, confident songs on their debut album, one can t help but wonder how the band came to be so fully formed.\n\nThe truth is, the band on Primates is the latest form in a long evolutionary chain\nleading up to this point. Meeting in 2002 in their catechism class at the age of 13, Chase and Nick bonded over a common love of music (Foo Fighters, Rage Against the Machine, Led Zeppelin, and The Doors, to name a few), which resulted in Nick joining Chase s band at the time, known as Stulpigeon. While the name Stulpigeon didn t last, the band name eventually evolved to reflect the thunderous, big, wide-open spaces of their music: Open Air Stereo.\n\nIn 2006, MTV s series Laguna Beach came into town. Chase became a main character in\nthe series, which featured Open Air Stereo prominently. The series closed with the\nband s sold-out performance at The Roxy Theatre. Scott Pounds (guitar) joined the band around this time, and the band marvels to this day over being able to find such a  talented guitarist through a Craigslist ad. Things were looking up for the band.\n\nAt the same time, Open Air Stereo signed to Sony Epic Records, and were diligently\nworking on recording their debut album. Over a year-and-a-half of writing and\nrecording eventually hit a creative blockade, and the sessions stalled. The band split for about three years, unsure of the future and uncertain that the music they had worked so hard to create would ever see the light of day.\n\nBut Chase and Nick knew that they had unfinished business, and this nagging sense of urgency brought them back together with Scott Pounds and new band member Evan Smith (bassist).\n\nThe band had grown up and changed over those years, and upon their return to the\nstudio, completed their 10-song debut album Primates. Primates is an exercise in the tight, economical execution of rock-and-roll. With Primates, the band has filtered their various influences through their own personal experiences to arrive with a fully realized and confident debut album.\n\nAlbum opinion is taken from sites such as cduniverse and allmusic.\nHHI has no opinion with regard to the quality of the Artist.\nWe hope you enjoy the music whatever it is!\n\n\nTrack Listing....:\n01.Maurader                                             [01:01]\n02.The right                                            [03:01]\n03.Love is blind                                        [03:16]\n04.Give me everything                                   [03:45]\n05.Stuck on you                                         [04:10]\n06.Damned                                               [03:35]\n07.Where do we go                                       [03:32]\n08.Hung over you                                        [04:19]\n09.What you want                                        [04:15]\n10.Living proof                                         [03:11]\n11.Your way is my way                                   [02:59]\n________\n37:04 min\n 62,7 MB\n\nGREETS\n\nEveryone that has supported us over the years.  You know who you are.\nWe acquired this cd from the Candlebox 20th year anniversary tour at capones in JC, TN! Rock out with us! Special thanks to the band for the meet and greets. You rocked the house!\n- HHI\n\n\n\n","torrent":{"xt":"urn:btih:7a78abf9379820f9c11dcc76c72b416da8913aff","amp;dn":"Open_Air_Stereo-Primates-%28Retail%29-2013-HHI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a78abf9379820f9c11dcc76c72b416da8913aff","infoHashBuffer":{"type":"Buffer","data":[122,120,171,249,55,152,32,249,193,29,204,118,199,43,65,109,168,145,58,255]},"announce":[],"urlList":[]}}