{"title":"True Compass A Memoir by Edward Moore Kennedy","uid":9252485,"size":5509784,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7a88b77036c0ae3b8272cbeffaf844f6f0cc933f&amp;dn=True+Compass+A+Memoir+by+Edward+Moore+Kennedy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"420weedman","files":5,"time":1385487646,"description":"Edward M. Kennedy is widely regarded as one of the great Senators in the nation's history. He is also the patriarch of America's most heralded family. In this landmark autobiography, five years in the making, Senator Kennedy speaks with unprecedented candor about his extraordinary life.\nThe youngest of nine children born to Joseph P. Kennedy and Rose Fitzgerald Kennedy, he came of age among siblings from whom much was expected. As a young man, he played a key role in the presidential campaign of his brother, John F. Kennedy. In 1962, he was elected to the U.S. Senate, where he learned how to become an effective legislator.\nHis life has been marked by tragedy and perseverance, a love for family and an abiding faith. He writes movingly of his brothers and their influence on him; his years of struggle in the wake of their deaths; his marriage to the woman who changed his life, Victoria Reggie Kennedy; his role in the major events of our time (from the civil rights movement to the election of Barack Obama); and how his recent diagnosis of a malignant brain tumor has given even greater urgency to his long crusade for improved health care for all Americans.\nWritten with warmth, wit, and grace, True Compass is Edward M. Kennedy's inspiring legacy to readers and to history.","torrent":{"xt":"urn:btih:7a88b77036c0ae3b8272cbeffaf844f6f0cc933f","amp;dn":"True+Compass+A+Memoir+by+Edward+Moore+Kennedy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a88b77036c0ae3b8272cbeffaf844f6f0cc933f","infoHashBuffer":{"type":"Buffer","data":[122,136,183,112,54,192,174,59,130,114,203,239,250,248,68,246,240,204,147,63]},"announce":[],"urlList":[]}}