{"title":"Structural Investigation of Historic Buildings - (Malestrom)","uid":4807557,"size":11632286,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7aa0a26bc7693d843612b5e067ee00fba58cf69e&amp;dn=Structural+Investigation+of+Historic+Buildings+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1238252292,"description":" &lt;a href=&quot;http://www.image-upload.net/images/z8bpsro7r10ldlkptyha.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/z8bpsro7r10ldlkptyha.jpeg&lt;/a&gt;\n\nDavid C. Fischetti, &quot;Structural Investigation of Historic Buildings: A Case Study Guide to Preservation Technology for Buildings, Bridges, Towers and Mills&quot;\nWiley | 2009-02-09 | ISBN: 0470189673 | 288 pages | PDF\n\nA toolkit for giving our historic built environment a second life\n\nConservation of our existing structures has obvious economic and social value. Moreover, historic structures provide an excellent laboratory for studying aspects of structural engineering, materials science, forensic engineering, and building design. Structural Investigation of Historic Buildings: A Case Study Guide to Preservation Technology for Buildings, Bridges, Towers, and Mills provides a practical guide for consulting structural engineers and others on dealing with issues unique to historic structures.\n\nEmphasizing structural evaluation and condition assessment based on sound preservation philosophy, but without burdening the reader with tedious calculations, the book discusses the role of the structural engineer in the evaluation and preservation process and discusses such topics as structural safety, analysis, and conservation. Engaging case studies, drawn from the author's own practice, include:\n\n* The Montague Building and Watauga Hall\n* The Restoration of St. Helena's Church\n* Market Hall Rehabilitation\n* Differential Settlement at St. Philip's Moravian Church\n* James Madison's Montpelier\n* Relocating the Cape Hatteras Lighthouse\n* The Timber Trusses of Burr, Town, and Haupt\n* The Cornish-Windsor Covered Bridge\n* A New Covered Bridge for Old Salem\n* The Tohickon Aqueduct\n\nEach case study features a description of the project and its history, a condition assessment, structural analysis, discussion, recommendations, and a description of the subsequent intervention as executed with drawings and photographs.\n\nBoth a foundational text for students anticipating a career in preservation and a guide for seasoned structural engineers, Structural Investigation of Historic Buildings gives preservation-minded professionals the tools they need to ensure that potential candidates for restoration, rehabilitation, or adaptive reuse do not meet the wrecking ball without a second chance. ","torrent":{"xt":"urn:btih:7aa0a26bc7693d843612b5e067ee00fba58cf69e","amp;dn":"Structural+Investigation+of+Historic+Buildings+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7aa0a26bc7693d843612b5e067ee00fba58cf69e","infoHashBuffer":{"type":"Buffer","data":[122,160,162,107,199,105,61,132,54,18,181,224,103,238,0,251,165,140,246,158]},"announce":[],"urlList":[]}}