{"title":"Elsa Morante - History: A Novel (pdf)","uid":8679305,"size":4863011,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7b25d8260f3c5ef599e9459bc642b8440c860e6a&amp;dn=Elsa+Morante+-+History%3A+A+Novel+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1373661995,"description":"Elsa Morante - History: A Novel (Vintage, 1984). 561 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nWidely praised Italian novel about World War II\n\n\ndescription:\n\nHistory was written nearly thirty years after Elsa Morante and Alberto Moravia spent a year in hiding among remote farming villages in the mountains south of Rome. There she witnessed the full impact of the war and first formed the ambition to write an account of what history - the great political events driven by men of power, wealth, and ambition - does when it reaches the realm of ordinary people struggling for life and bread.\n\nThe central character in this powerful and unforgiving novel is Ida Mancuso, a schoolteacher whose husband has died and whose feckless teenage son treats the war as his playground. A German soldier on his way to North Africa rapes her, falls in love with her, and leaves her pregnant with a boy whose survival becomes Ida's passion. \n\nAround these two other characters come and go, each caught up by the war which is like a river in flood. We catch glimpses of bombing raids, street crimes, a cattle car from which human cries emerge, an Italian soldier succumbing to frostbite on the Russian front, the dumb endurance of peasants who have lived their whole lives with nothing and now must get by with less than nothing.\n\nFrom Library Journal\n\nWritten in 1974 but first published in the United States in 1977, this was Morante's first novel in 18 years. As the cryptic title indicates, the theme of this novel, said LJ's reviewer, is how &quot;history obscures individual lives.&quot; Though the book portrays the brutal existence of one Italian family after World War II, LJ's reviewer added that &quot;there is so much to praise in this long, wonderfully rich novel, including the effortless translation, that its flaws - occasional clumsiness of narration, repetition - are minor indeed&quot; (LJ 4/15/77).\n\nReview\n\n&quot;One of the few novels in any language that renders the full horror of Hitler's war, the war that never gets into the books . . .&quot; -- Alfred Kazin, Esquire\n\n&quot;A storyteller who spellbinds.&quot; -- Stephen Spender, The New York Review of Books\n\n&quot;A marvel of a novel . . . all the pleasures that fiction can offer.&quot; -- Doris Grumbach, Saturday Review","torrent":{"xt":"urn:btih:7b25d8260f3c5ef599e9459bc642b8440c860e6a","amp;dn":"Elsa+Morante+-+History%3A+A+Novel+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b25d8260f3c5ef599e9459bc642b8440c860e6a","infoHashBuffer":{"type":"Buffer","data":[123,37,216,38,15,60,94,245,153,233,69,155,198,66,184,68,12,134,14,106]},"announce":[],"urlList":[]}}