{"title":"Fright Night","uid":4728198,"size":3696297984,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7bf655a2ca139eb6277664f44eb9364bf168786f&amp;dn=Fright+Night&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Dante.Xaiver","files":-1,"time":1234863146,"description":"Fright Night is an American vampire comedy horror film starring William Ragsdale, Chris Sarandon, Stephen Geoffreys and Roddy McDowall that was released in 1985. It was followed by a 1988 sequel, Fright Night II along with numerous other merchandise including tapes, CDs, videos, DVDs, and comic books.\n\nThe visual effects are the work of Richard Edlund, who also provided the effects for Ghostbusters a year earlier.\n\nFor young Charlie Brewster, nothing could be better than an old horror movie late at night. Two men move in next door, and for Charlie with his horror movie experience, there can be no doubt that their strange behavior is explained by the fact that they are a vampire and his undead day guardian. The only one who can help him hunt them down is a washed-up actor, Peter Vincent, who hosts Charlie's favorite TV show, Fright Night. Vincent doesn't really believe that vampires exist, but does it for the money.\n\n    *  The character Peter Vincent is named for two actors well-known for their appearances in horror movies: Peter Cushing and Vincent Price.\n\n    * William Ragsdale injured his foot running down a staircase during the last shot filmed on 24 December 1984, just three weeks into principal photography, which was stopped while his foot healed. Filming of Ragsdale's action scenes was postponed until he was healed sufficiently to perform them.\n\n    * Stephen Geoffreys auditioned for Fright Night (1985) while filming Fraternity Vacation (1985).\n\n    * A puppet that was created for, but not used in, another Columbia Pictures production, Ghost Busters (1984), is visible in Fright Night (1985).\n\n    * The motion picture that Charley watches in his bedroom is Scars of Dracula (1970), a Hammer Studios production starring Christopher Lee.\n\n    * While directing actors, Tom Holland accidentally broke a bat creature, which was fixed and then filmed.\n\n    * Tom Holland had total control in the casting decisions. The only suggestion he got was from Guy McElwaine who asked Holland to meet his friend Roddy McDowall, who'd be cast. In an interview Holland said that &quot;it was a terrific suggestion&quot;.\n\nEnglish &amp; French soundtrack\nEnglish French Spanish subtitles","torrent":{"xt":"urn:btih:7bf655a2ca139eb6277664f44eb9364bf168786f","amp;dn":"Fright+Night","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bf655a2ca139eb6277664f44eb9364bf168786f","infoHashBuffer":{"type":"Buffer","data":[123,246,85,162,202,19,158,182,39,118,100,244,78,185,54,75,241,104,120,111]},"announce":[],"urlList":[]}}