{"title":"Heaven Knows, Mr. Allison .mkv","uid":11569287,"size":1219408011,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7da4630a8f265798b0fa2aef3b8722aaaa765121&amp;dn=Heaven+Knows%2C+Mr.+Allison+.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"strawberry5","files":-1,"time":1416993491,"description":"Heaven Knows, Mr. Allison \n         (1957)\n\nDirector:  John Huston \n\nRobert Mitchum and Deborah Kerr\n\n.....\nEditor Note:\nOnly Robert Mitchum could do this movie\n&quot;Just like take'n candy from a baby&quot;,,, Whoosh !!!!!\n..\nand Deborah Kerr,, beat softly my heart \n.....\n \nThey were alone on this Pacific Island... trapped behind enemy lines... the marine who had been thru Hell and Sister Angela with her supreme faith in God, found comfort in one another as the two wait out the war.\n\nIn 1944, in the South Pacific, castaway Marine Corporal Allison drifts in a raft to the Tuasiva Island, where he meets Sister Angela. She tells him that she is the only person in the island and was left behind by the runaway boat to Fiji Island while seeking the local priest. Stranded in the island, but with water, fish and fruits, their paradisiacal life ends when the Japanese arrive to build a base, forcing Allison and the nun to hide in a cave. The crude marine provides the necessary supply for their survival and falls in love for the nun. \n\nFirst off, Bob Mitchum is the most under-rated actor of all time. He put everything he had into every role and made it look natural. This movie was no exception. He became &quot;Mr. Allison&quot; and made us believe he had been ship wrecked like this before. Having been a combat Marine myself there were so many details I noticed that he was able to incorporate naturally into his part. This allowed viewers of any knowledge level to enjoy the most authentic portrayal of this character. This is one of my favorite movies of all time. It is a real treasure and a good indicator of Bob Mitchum's work.\n.....\nP.s. I would be grateful of any Ubuntu help, on howto decode HandBrake, or other app to mp4 files, if mkv is less desirable. Thanks\n.....\nCopyright Disclaimer Under Section 107 of the Copyright Act 1976, allowance is made for fair-use purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favour of fair use","torrent":{"xt":"urn:btih:7da4630a8f265798b0fa2aef3b8722aaaa765121","amp;dn":"Heaven+Knows%2C+Mr.+Allison+.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7da4630a8f265798b0fa2aef3b8722aaaa765121","infoHashBuffer":{"type":"Buffer","data":[125,164,99,10,143,38,87,152,176,250,42,239,59,135,34,170,170,118,81,33]},"announce":[],"urlList":[]}}