{"title":"Malipiero - C Con - Beinum, E Mainardi, RCO (1941) [Philidor]","uid":15508098,"size":59656471,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7e00fa6bd6d5fb0c9587cbc550f20564ea5f2153&amp;dn=Malipiero+-+C+Con+-+Beinum%2C+E+Mainardi%2C+RCO+%281941%29+%5BPhilidor%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Philidor","files":6,"time":1470614677,"description":"Gian Francesco Malipiero was a member of a generation of Italian composers who turned their backs on the 19th century, seeking an older national tradition of the 16th and 17th centuries as their ideal. In this, he proved both a prolific and uneven composer, but one who was generally well received until the serialists triumphed after World War II. Malipiero's star began to rise again in the 1980s, and many new recordings have forced a reevaluation of his efforts. His best works--among which, the Cello Concerto is numbered--are now considered worthy to stand alongside the finest music produced outside Italy during the first half of the 20th century.\r\n\r\nThis performance of the Cello Concerto was recorded live with the Amsterdam Concertgebouw Orchestra (as it was then called) in 1941, under the helm of the great Eduard van Beinum. The cellist was Enrico Mainardi--not a well-known name today, but in his time rated among the finest cellist alive, and especially noted for his warmly lyrical, focused tone. The performance is clearly not high fidelity, but was very good for its day, and there's a charge of occasion in the air that communicates itself even more than 70 years after the event.\r\n\r\nTransfers are made at 256 kBits/s, directly from the disc. \r\n\r\nA bio is enclosed. You can find all my classical uploads by searching on Philidor, or just looking in this regularly updated thread:\r\n   \nhttps://pirates-forum.org/Thread-Philidor-s-uploads--63895","torrent":{"xt":"urn:btih:7e00fa6bd6d5fb0c9587cbc550f20564ea5f2153","amp;dn":"Malipiero+-+C+Con+-+Beinum%2C+E+Mainardi%2C+RCO+%281941%29+%5BPhilidor%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e00fa6bd6d5fb0c9587cbc550f20564ea5f2153","infoHashBuffer":{"type":"Buffer","data":[126,0,250,107,214,213,251,12,149,135,203,197,80,242,5,100,234,95,33,83]},"announce":[],"urlList":[]}}