{"title":"Nickelback - Far Away","uid":4695947,"size":138369028,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7e2b478cf888ae2219b90628294887beb0daaabb&amp;dn=Nickelback+-+Far+Away&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1233559441,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Far Away&quot; is a single by Canadian band Nickelback. Released in late 2005 or early 2006 in America and February 13, 2005 in Britain. It was released as the fourth U.S. single of All the Right Reasons, but the second in Europe. Far Away peaked at #8 in the US, making All the Right Reasons the only Nickelback album to date to have more than one top ten hit. The band's lead singer and guitarist Chad Kroeger described this song on the Tour when in Australia as the &quot;only real love song&quot; that Nickelback has. He described many others as &quot;being about love&quot; but not solely about &quot;being in love&quot;.\n\nThe song was re-released in the UK on September 22, 2008 following the success of &quot;Rockstar&quot; and the re-release of &quot;Photograph&quot;. This release reached number 41 so far in the UK singles chart, one place lower than its original chart peak, although this re-release was download-only. \n\n&quot;Far Away&quot; was a huge success in the U.S. and became the band's fourth Top Ten single on the Billboard Hot 100, peaking at #8. The song was the second Top Ten single from their latest album All the Right Reasons after the lead single of the album, &quot;Photograph&quot;, which peaked at number two on the chart, making All the Right Reasons Nickelback's only CD to date to have two top ten singles on the Hot 100. The song was also a #1 hit on both the pop chart and Adult Top 40. In addition &quot;Far Away&quot; has found big success on the U.S., digital, and adult contemporary charts. \n\nThe music video for &quot;Far Away&quot; was first shown on VH1's V-Spot. Filmed at Green Timbers Park in Surrey, British Columbia just outside Vancouver, the video starts with a couple in bed, when a cellphone rings and the husband is forced to leave. It is revealed that he is a fireman, and has been called to help fight a forest fire.\n\nAs the song moves on, we see the firemen dropped right into the middle of the fire, which quickly overwhelms them and forces them to retreat. The husband goes back to help a fallen firefighter, and watches the helicopter leave without him. After the husband sees the helicopter leave, a large, fiery tree is seen falling, presumably onto him. This footage is inter-cut with his wife watching the news about the fire.\n\nLater, she receives a phone call, and breaks down, as it appears that she has been informed that her husband has died. She rushes outside to see several firefighters emerge from a truck...including her husband, covered in soot. She rushes to him and hugs him, and the video ends.\n\nThe entire song also features inter-cuts to the band playing in a large, strobe light-filled red and orange room.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:7e2b478cf888ae2219b90628294887beb0daaabb","amp;dn":"Nickelback+-+Far+Away","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e2b478cf888ae2219b90628294887beb0daaabb","infoHashBuffer":{"type":"Buffer","data":[126,43,71,140,248,136,174,34,25,185,6,40,41,72,135,190,176,218,170,187]},"announce":[],"urlList":[]}}