{"title":"Krissie - Pound It - NubileFilms","uid":10294150,"size":284377468,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:7fc4dcf4ebf48ccec2bca592dfa68eaed1f85cf5&amp;dn=Krissie+-+Pound+It+-+NubileFilms&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"athklym","files":-1,"time":1401899480,"description":" &lt;a href=&quot;http://bayimg.com/pAOlMAAFI&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/pAOlMAAFI&lt;/a&gt;\nPound It\nMar 6, 2014\n\nSuper sexy Krissie is enjoying her morning coffee when her man Figo joins her in the kitchen and comes in for a long erotic kiss that quickly turns into something more. Kissing his way down his woman's slender body, Figo gets down on his knees and slowly peels her panties down her legs and off.\n\nHe starts off his pussy licking with slow sweeps of his tongue and a sweet finger massage that begins slow and gentle but quickly picks up in intensity. Krissie's rapturous expression says it all about how incredible her man is making her feel, and they're just getting things started.\n\nKrissie shows some spunk as she turns things around on Figo and pushes him against the wall so that he can experience the same pleasure that he has just given to her. She pulls her beau's hard cock out for a big hard blow job that gets him all warmed up and ready to fuck!\n\nWhen he can't wait any longer for the pleasure of Krissie's bald wet pussy, he takes matters into his own hands by turning her around and taking her from behind right up against the wall. Their lovemaking is fast and furious, as Figo delivers a proper pussy pounding that before long has Krissie moaning in happiness.\n\nKicking things up another notch, Figo picks his woman up in his arms so that he can slide her down on top of his rock hard cock and bounces her up and down for both of their pleasure. They eventually make their way to the wall so that Figo has something to lean against as he continues to pound his lover's pussy.\n\nSliding down onto her feet so that she can gain more leverage, Krissie rides her way to a climax that leaves her whole slender body throbbing and satisfied. She wastes no time taking Figo's cock into her mouth, working his member for the last few seconds until he explodes and gives her the facial she has been waiting for.\n","torrent":{"xt":"urn:btih:7fc4dcf4ebf48ccec2bca592dfa68eaed1f85cf5","amp;dn":"Krissie+-+Pound+It+-+NubileFilms","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fc4dcf4ebf48ccec2bca592dfa68eaed1f85cf5","infoHashBuffer":{"type":"Buffer","data":[127,196,220,244,235,244,140,206,194,188,165,146,223,166,142,174,209,248,92,245]},"announce":[],"urlList":[]}}