{"title":"Winners","uid":4301955,"size":2779836494,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7fd15ef9fdf2ead97834a87bc8f58f6ef07afc6f&amp;dn=Winners&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"softline","files":8,"time":1216347298,"description":"Winners was an Australian drama series that ran during the late 1980s.  Each week&amp;#039;s show featured a different plot and cast.  Unfortunately only about 20% of the episodes were ever released on DVD/VHS or capped by someone.  I am posting what I have.  Maybe someone else has a basement full of VHS tapes where they recorded the entire series.\n\nJust Friends:\n\nSusan has just moved to a new part of town. It&amp;#039;s school holidays and she goes to practice her skills at the local roller rink. Buzz, the Prince of the Rink, spots the talented newcomer and moves in on her. Susan joins Buzz and his gang, but she doesn&amp;#039;t know what she is letting herself in for. Boyfriends, girlfriends, going steady and breaking up. Life can be very painful when you&amp;#039;re thirteen.\n\nOn Loan:\n\nAt her 14th birthday party, Lindy wishes she knew her actual birth date. But only her real parents would know, and they&amp;#039;re both dead. Or so Lindy and her Australian family believe until the letter from her natural father arrives. Now Lindy must decide between two families and two futures, between Australia and Vietnam.\n\nRoom to Move:\n\nCarol is a top runner, coached by her father day and night. Then she meets Angie, the punk new girl, and the two become friends, eating hamburgers at &quot;The Armpit&quot; where Angie has to work after school. They give each other lots of support and together do things Carol has only dreamed of. Carol begins to rebel and plans a new life for herself. But the all-important race is coming up?and Carol has to give it all she&amp;#039;s got.\n\nHad this show been made ten years later it would be one of the classic lesbian love stories.  Unfortunately the show represses all the sexual undertones of the story.\n\nFeatures Nicole Kidman in one of her early performances as a child actress.\n\nThe Journey:\n\n12-year-old Ada Zuckermann becomes an orphan when her father Justus, is killed in a fall. Before he dies, he tells Ada that she must journey south to find her true inheritance. Agnes, the housekeeper&amp;#039;s stepdaughter, is to accompany her. As the two set out on their journey adventures befall them. The final discovery, however, of the buried treasure and a letter from Justus, makes the purpose of the journey very clear.\n\nTop Kid:\n\nGary is a bright boy, a bit too bright for his own good, as the other kids try to prove by beating him up regularly after school. Then he goes on a quiz show and suddenly fame and fortune are within his reach. Until the sponsors start to rig the show and Gary has to make a very difficult decision.\n\nThe Other Facts of Life:\n\nBen&amp;#039;s father gives him &quot;The Facts of Life&quot; but Ben hits his dad with much tougher questions than that old birds-and-bees stuff. Like, why are some people starving? Dad can&amp;#039;t answer. Ben starts a one-boy crusade to make the world right. And reaps the consequences.\n","torrent":{"xt":"urn:btih:7fd15ef9fdf2ead97834a87bc8f58f6ef07afc6f","amp;dn":"Winners","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fd15ef9fdf2ead97834a87bc8f58f6ef07afc6f","infoHashBuffer":{"type":"Buffer","data":[127,209,94,249,253,242,234,217,120,52,168,123,200,245,143,110,240,122,252,111]},"announce":[],"urlList":[]}}