{"title":"Mazaika 3.7","uid":10988930,"size":3746113,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8090ebceba7d46d18ee1b7d4b77bd1878c71d4ef&amp;dn=Mazaika+3.7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sjmahmoudi","files":1,"time":1409963455,"description":"Mazaika is a photo mosaic software.\n\nFast, easy and professional!\n\nMosaic is an image assembled from small pieces of some material. In a photo mosaic these pieces are small images by itself.\n\nWhen you look at a photo mosaic from a distance, you see one big image, but as you move close, you understand that it's not just a single, large picture but rather a collection of small, separate images.\n\nIf you have ever seen these photo mosaics on magazine covers, posters, billboards or at art galleries then you probably already have seen images that were made with Mazaika software. Our software is used by number of professional and amateur artists and designers all around the world. Mazaika helps them to create eye-catching images. A tiny part of their creations is displayed at our Mazaika Users Gallery.\n &lt;a href=&quot;\nhttp://www.mazaika.com/ugallery.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.mazaika.com/ugallery.html&lt;/a&gt;\n\nAnd don't forget to see Gallery page with photo mosaics made by Mazaika.com team.\n\nMany companies that sell custom designed photo mosaic posters use Mazaika software. Our programs guarantee a highest possible quality of result. Artist and designers select Mazaika because of it's stability, speed and complete control over mosaic process.\n\nMazaika is the ONLY photo mosaic program that allows manual changes to every single tile in the finished mosaic. If you don't like an image, substitute it with another matching candidate image! And even more! You might insert custom images as a sort of personal signature, or as a hidden picture riddle (as in a &quot;Where are they?&quot; puzzle book). Or you might need to make sure that a particularly well-liked image is not passed over as a tile; for example that Uncle Ernie appears somewhere in your final mosaic.","torrent":{"xt":"urn:btih:8090ebceba7d46d18ee1b7d4b77bd1878c71d4ef","amp;dn":"Mazaika+3.7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8090ebceba7d46d18ee1b7d4b77bd1878c71d4ef","infoHashBuffer":{"type":"Buffer","data":[128,144,235,206,186,125,70,209,142,225,183,212,183,123,209,135,140,113,212,239]},"announce":[],"urlList":[]}}