{"title":"Pedigree Dogs Exposed - The Truth Behind Crufts (BBC 2008)","uid":4929420,"size":778201088,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:812f58ae3a0059857501b03de5fbf606671a32d4&amp;dn=Pedigree+Dogs+Exposed+-+The+Truth+Behind+Crufts+%28BBC+2008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eddie1969","files":1,"time":1243979033,"description":"TV : Documentary : DVD quality : English\n\n\nPedigree Dogs Exposed is a BBC investigative documentary, produced by Jemima Harrison, which looks into the health issues facing pedigree dogs in the United Kingdom.\n\nThe Kennel Club, the governing body of dogs in the UK that runs the prestigious dog conformation show Crufts, was criticized for allowing breed standards, judging standards and breeding practices that are said to compromise the health of purebred dogs.\n\nThe programme generated much criticism of the Kennel Club. It also caused various sponsors and trade exhibitors including Pedigree, Hill's, the Royal Society for the Prevention of Cruelty to Animals and the UK's largest dog welfare charity The Dogs Trust to withdraw their participation from Crufts and other Kennel Club events. The BBC has decided to withdraw their coverage of Crufts for 2009 and beyond.\n\nThe Kennel Club initially denied the filmmakers' assertion that many dogs suffered from diseases and stated that &quot;the vast majority of dog breeds are healthy.&quot; However, due to strong public opinion, it later rolled out new health plans and reviewed breed standards for every breed. Some breeders have condemned the Club for overreacting.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:812f58ae3a0059857501b03de5fbf606671a32d4","amp;dn":"Pedigree+Dogs+Exposed+-+The+Truth+Behind+Crufts+%28BBC+2008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"812f58ae3a0059857501b03de5fbf606671a32d4","infoHashBuffer":{"type":"Buffer","data":[129,47,88,174,58,0,89,133,117,1,176,61,229,251,246,6,103,26,50,212]},"announce":[],"urlList":[]}}