{"title":"Godsmack-The_Oracle-(Retail)-2010-HHI","uid":6668682,"size":80895153,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:812fc1ad96ece511d9150fe6b04b99f1428e71de&amp;dn=Godsmack-The_Oracle-%28Retail%29-2010-HHI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"raidy","files":13,"time":1315797003,"description":"HAPPY HACKER INDUSTRIES [HHI]\n\nRELEASE INFO\n\nArtist......: Godsmack\nAlbum.......: The oracle\nGrabber     : EAC\nEncoder.....: LAME v3.90.3\nRelease Date: May-04-2010\nRip Date....: Sep-11-2011\nGenre.......: Rock\nQuality     : VBRkbps / 44.1kHz / Joint-Stereo\nPlaytime    : 44:33 min\nRipper      : Happy Hacker Industries [HHI]\nCD Songs    : 10\nLabel.......: Republic\nReleaseNotes:\n\nThe upcoming album arrives as the most anticipated 2010 rock release, so far. The debut single from the 10 song disc, &quot;Cryin' Like A Bitch,&quot; is already blowing the doors off rock radio and the digital domain, furthering the Boston Band's record-breaking streak at the coveted Active Rock format. The punishing anthem, which debuted a mere three weeks ago as the most added new Active Rock single of the year, has already blazed to the Top 5 tier of the chart. &quot;Cryin' Like A Bitch&quot; is the 15th Top Five hit for the group, more than franchise artists such as Linkin Park, Foo Fighters, and others. It also marks Godsmack's record-breaking 18th Top 10 single of their career, extending their dominance as creators of the most Top 10 hits in Active rock history. Produced by Dave Fortman, who has worked with\nMudvayne, Evanescence, and Simple Plan, among others, The Oracle is another lyrical and musical touchstone for the four member band. The new album revels in Godsmack's scorching underpinnings, served up via frontman Sully Erna's monster-vocals on the scathing new single, &quot;Cryin' Like A Bitch,&quot; and other songs, including &quot;Saints And Sinners,&quot; &quot;War And Peace,&quot; &quot;Devil's Swing,&quot; and &quot;Good Day To Die.&quot; The Oracle is the band's first studio album since 2006's Godsmack IV, another platinum-plus trailblazer for the group, debuting at #1 on the\nBillboard Top albums chart (their 2nd #1 debut following 2003's Faceless) and harking back to the signature sound of multiplatinum masterpieces like their 5 million selling breakthrough debut album and 2000's AwakeConsidered one of the definitive alternative hard rock bands in contemporary music, The band's 12 year legacy - guided by fearless founder and frontman Sully Erna, includes nearly 15 million albums sold - highlighted by scores of sold-out international concerts, countless successful tours, a remarkable 18 hit singles, 4 platinum\nrecords, 1 gold EP and three Grammy nominations.\n\nWe rip the descriptions from sites like cduniverse, allmusic and amazon.\nHHI presents no opinion on the artists work; only the quality of the rip. :)\n\nTrack Listing....:\n01.Cryin' like A bitch                                  [03:23]\n02.Saints and sinners                                   [04:10]\n03.War and peace                                        [03:10]\n04.Love-Hate-sex-pain                                   [05:16]\n05.What if                                              [06:35]\n06.Devil's swing                                        [03:31]\n07.Good day to die                                      [03:56]\n08.Forever shamed                                       [03:24]\n09.Shadow of A soul                                     [04:45]\n10.The oracle                                           [06:23]\n____\n\n44:33 min\n 77,1 MB\n\nGREETS\n\nEveryone that has supported us over the years.  You know who you are.\nShouts to the crew at http://www.bidnshop.com If you wanna save some of that hard earned cash you've got and still buy some nice things, check them out. Bidding starts at a penny! The PIN code is: 1985 [Ed's Notes]","torrent":{"xt":"urn:btih:812fc1ad96ece511d9150fe6b04b99f1428e71de","amp;dn":"Godsmack-The_Oracle-%28Retail%29-2010-HHI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"812fc1ad96ece511d9150fe6b04b99f1428e71de","infoHashBuffer":{"type":"Buffer","data":[129,47,193,173,150,236,229,17,217,21,15,230,176,75,153,241,66,142,113,222]},"announce":[],"urlList":[]}}