{"title":"Crazy Taxi [GAMECUBE] [ENGLISH] [NTSC-USA]","uid":10360712,"size":1391780854,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:81b7b59345120612cfb2102e116d2d60ccb628dd&amp;dn=Crazy+Taxi+%5BGAMECUBE%5D+%5BENGLISH%5D+%5BNTSC-USA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Fulgame","files":-1,"time":1402800858,"description":"CRAZY TAXI FOR GAMECUBE\n\nORIGINA NAME: CRAZY TAXI\n\nREGION: NTSC-U\n\nLAUNCH DATA: 2001\n\nFROM WIKIPEDIA;\n\nCrazy Taxi is an open world racing video game developed by Hitmaker (Sega AM3) and published by Sega. It is the first game in the Crazy Taxi series. The game was first released in arcades in 1999 and was ported to the Dreamcast in 2000. Subsequently, it was ported to the PlayStation 2 and Nintendo GameCube by Acclaim in 2001, and then Microsoft Windows in 2002. The game was released on November 16, 2010, for the PlayStation Network and on November 24, 2010, for the Xbox Live Arcade. It is featured on the Dreamcast Collection. An iOS version was released on October 10, 2012. On March 14, Sega announced Crazy Taxi: City Rush, a new free-to-play entry that's being developed exclusively for mobiles.\n\nReception to Crazy Taxi has been mostly positive and it became one of the few Sega All Stars. It has also earned Greatest Hits status on PlayStation 2 and Player's Choice status on GameCube. Sega followed up on the success of Crazy Taxi by making a sequel, Crazy Taxi 2 for the Dreamcast, which included several gameplay changes. It would also be bundled with Crazy Taxi 2 in Crazy Taxi: Fare Wars, and later be bundled with other Dreamcast hits in Dreamcast Collection. Crazy Taxi 3: High Roller was released for the Xbox on July 23, 2002, and later released as a PC title in 2004.\n\nTESTED IN DIOS MIOS, ORIGINAL ISO FROM MINE.","torrent":{"xt":"urn:btih:81b7b59345120612cfb2102e116d2d60ccb628dd","amp;dn":"Crazy+Taxi+%5BGAMECUBE%5D+%5BENGLISH%5D+%5BNTSC-USA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81b7b59345120612cfb2102e116d2d60ccb628dd","infoHashBuffer":{"type":"Buffer","data":[129,183,181,147,69,18,6,18,207,178,16,46,17,109,45,96,204,182,40,221]},"announce":[],"urlList":[]}}