{"title":"Blame It on the Rain - How the Weather Has Changed History (Male","uid":4790661,"size":1467167,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8394dc214fd997963e747d97e4b18d739c4af2d8&amp;dn=Blame+It+on+the+Rain+-+How+the+Weather+Has+Changed+History+%28Male&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"malestrom_HH","files":1,"time":1237706570,"description":" &lt;a href=&quot;http://www.image-upload.net/images/yhmt4kfxrork00ys3.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/yhmt4kfxrork00ys3.jpeg&lt;/a&gt;\n\nMarc, &quot;Blame It on the Rain: How the Weather Has Changed History &quot;\nHarper Paperbacks | 2006 | ISBN: 0060839821 | 336 pages | PDF \n\nIn this series of sprightly essays Lee presents an intriguing look at how atmospheric conditions have affected a range of historical events, while acknowledging that other factors were important as well. Lee (100 Most Dangerous Things in Everyday Life) argues that, because of the weather's impact, we have less control over events than we think. She theorizes that Greek culture survived a Persian attack in the 480 B.C. battle of Salamis because of naval commander Thermistocles' excellent knowledge of wind currents. In another chapter, Lee vividly describes the 1415 battle of Agincourt, where England's Henry V pitted his exhausted and badly outnumbered army against the French as relentless rain turned the war arena into a mud field. Henry dispatched his archers to force the opposition onto the deadly battleground, where horses and riders collapsed, giving the young king a decisive victory. Elsewhere Lee recounts how in 1800 a storm flooded bridges and roads, disrupting a potential slave uprising in Virginia, while another torrential rainstorm finally delivered water to Civil War prisoners dying of thirst at the notorious prison camp, near Andersonville, Ga. Lee presents intriguing browsing items for history buffs. (Aug.)\nCopyright Ã‚Â© Reed Business Information, a division of Reed Elsevier Inc. All rights reserved. ","torrent":{"xt":"urn:btih:8394dc214fd997963e747d97e4b18d739c4af2d8","amp;dn":"Blame+It+on+the+Rain+-+How+the+Weather+Has+Changed+History+%28Male","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8394dc214fd997963e747d97e4b18d739c4af2d8","infoHashBuffer":{"type":"Buffer","data":[131,148,220,33,79,217,151,150,62,116,125,151,228,177,141,115,156,74,242,216]},"announce":[],"urlList":[]}}