{"title":"Bowling, Beatniks, and Bell-Bottoms_Pop Culture of 20th-Century ","uid":4706181,"size":101047964,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:840da4620f28e33a5cb10da377904e1e3ba32013&amp;dn=Bowling%2C+Beatniks%2C+and+Bell-Bottoms_Pop+Culture+of+20th-Century+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"timnehguy","files":6,"time":1233866007,"description":"Bowling, Beatniks, and Bell-Bottoms: Pop Culture of 20th-Century America (Five Volume Set)\nby Tom Pendergast and  Sara Pendergast (editors)\n\n5 PDFs\n\nHave you ever wondered how the TV dinner was created? Left with tons of turkey after a slow Thanksgiving season, the Swanson Company combined the modern appeal of refrigeration and television-two of the 1940s' most important inventions-and the aluminum-tray dinner was born. As thatis reference shows repeatedly, such fixtures of modern popular culture have had an enormous impact on our everyday lives.\n\nThe editors track trends in American popular culture through 750 entries arranged chronologically by decade over five volumes. Within decades, entries are divided into nine major areas: &quot;Commerce,&quot; &quot;Fashion,&quot; &quot;Film and Theater,&quot; &quot;Food and Drink,&quot; &quot;Music,&quot; &quot;Print Culture,&quot; &quot;Sports and Games,&quot; Television and Radio,&quot; and &quot;The Way We Lived.&quot; \n\nRanging from &quot;A-Team&quot; to &quot;Yuppies,&quot; the topics within these areas are generally covered in a one-page entry that ends with a helpful &quot;For More Information&quot; section. Also included are 300 black-and-white photos, a useful table of contents, and an index. History lessons have never been so much fun. Informative, entertaining, and clearly presented, this book is recommended for middle school, high school, and public libraries.\n\nPardon me, but I've got to get back to my hula-hoop!\n\nCheck my torrents for a variety of reference books.","torrent":{"xt":"urn:btih:840da4620f28e33a5cb10da377904e1e3ba32013","amp;dn":"Bowling%2C+Beatniks%2C+and+Bell-Bottoms_Pop+Culture+of+20th-Century+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"840da4620f28e33a5cb10da377904e1e3ba32013","infoHashBuffer":{"type":"Buffer","data":[132,13,164,98,15,40,227,58,92,177,13,163,119,144,78,30,59,163,32,19]},"announce":[],"urlList":[]}}