{"title":"Alex Benedict Series - Jack McDevitt","uid":9314698,"size":3068844,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:848b7936a12e86d25790d1c994008502eb647690&amp;dn=Alex+Benedict+Series+-+Jack+McDevitt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":6,"time":1386450213,"description":"\n\nAlex Benedict is an antiquity dealer who, along with his assistant Chase Kolpath, lives some nine thousand years in the future on a planet called Rimway. With faster-than-light travel a routine matter, and a wealth of planets (including Earth) harboring the ruins of countless ancient human civilizations, there is no shortage of artifacts and memorabilia to buy and sell.\n \nA Talent For War\n\n[i][color=green]Alex Benedict learns that his uncle, who raised him, has disappeared along with several hundred other people aboard a space space headed for a remote location. His uncle leaves him the entire estate, along with the mystery that consumed his life before his disappearance. But Alex isn't the only one trying to solve the ancient puzzle of what happened to the Confederacy's most admired war hero and the other parties involved are much more ruthless.\n\nPolaris\n\nThe luxury space yacht Polaris carried an elite group of the wealthy and curious thousands of light-years from Earth to witness a spectacular stellar phenomenon. It never returned. The search party sent to investigate found the Polaris empty and adrift in space, the fate of its pilot and passengers a mystery.\nSixty years later, prominent antiquities dealer Alex Benedict is determined to find the truth about Polaris-no matter how far he must travel across the stars, no matter the risk.\n\nSeeker\n\nAlex Benedict and his executive assistant, Chase Kolpath, are back in Seeker, a story in which the two antiquarians search for a legendary lost colony that is both a science fiction thriller and a remarkably complex mystery.\n\nThe Devil's Eye\n\nInterstellar antiquities dealer Alex Benedict receives a cryptic message asking for help from celebrated writer Vicki Greene, who has been mind-wiped. She has no memory of her past life, or of her plea for assistance. But she has transferred an enormous sum of money to Alex, also without explanation. The answers to this mystery lie on the most remote of human worlds, where Alex will uncover a secret connected to a decades-old political upheaval, a secret that somebody desperately wants hidden, though the price of that silence is unimaginable.\n\nEcho\n\nEccentric Sunset Tuttle spent his life searching in vain for forms of alien life. Thirty years after his death, a stone tablet inscribed with cryptic, indecipherable symbols is found in the possession of Tuttle's onetime lover, and antiquities dealer Alex Benedict is anxious to discover what secret the tablet holds. It could be proof that Tuttle had found what he was looking for. To find out, Benedict and his assistant embark on their own voyage of discovery-one that will lead them directly into the path of a very determined assassin who doesn't want those secrets revealed.\n\nFirebird\n \nForty-one years ago the renowned physicist Chris Robin vanished. Before his disappearance, his fringe science theories about the existence of endless alternate universes had earned him both admirers and enemies.\n\nAlex Benedict and Chase Kolpath discover that Robin had several interstellar yachts flown far outside the planetary system where they too vanished. And following Robin's trail into the unknown puts Benedict and Kolpath in danger...","torrent":{"xt":"urn:btih:848b7936a12e86d25790d1c994008502eb647690","amp;dn":"Alex+Benedict+Series+-+Jack+McDevitt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"848b7936a12e86d25790d1c994008502eb647690","infoHashBuffer":{"type":"Buffer","data":[132,139,121,54,161,46,134,210,87,144,209,201,148,0,133,2,235,100,118,144]},"announce":[],"urlList":[]}}