{"title":"Drakan: Order of the Flame (1999) v445","uid":10404231,"size":860166462,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:84e9cb7f3dabe5a039b1bfeffa7a60bc520210a0&amp;dn=Drakan%3A+Order+of+the+Flame+%281999%29+v445&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bitoolean","files":-1,"time":1403430207,"description":"\nDrakan: Order of the Flame\n\nDrakan is a 1999 action-adventure PC video game which stands out by letting you ride a dragon. And the transition is seamless - you can get on and off it whenever you want. Flying the dragon is easy, just use your mouse to turn it around and up &amp; down, and the arrow keys (or set WASD as directional keys) to move. The heroine's name is Rynn and her dragon is called Arokh. Before you ask, there was a sequel to this game - Drakan: The Ancients' Gates, but it was only available on PlayStation 2. More info about Drakan on the Wikipedia page and around the web.\n\nThis game features multiplayer, but I haven't tried it. The story is not exceptional (much like Skyrim's for example isn't), and the acting is not that good either, but the experience all in all is really something, especially considering I'm still playing the game 15 years later. This is a game that had open world, tactical freedom, very good graphical quality at the time, and gives you best of both realistic difficulty (the enemies are unforgiving) and fantasy setting (you feel super on that fire spitting dragon). The story is suitable to both adults and children, while the default setting is maximum gore - you can rip arms off the enemies and they shortly die from bleeding. You even find special weapons in secret areas all over the maps, which deteriorate with use.\n\nINFO\n\nI've included the official update patch version 445 separately in this torrent although you shouldn't need it, most probably - the setup already installs v445 (acording to the in-game menu at least, however, the readme file in the game folder which describes the updates changelog only mentions it as version 444 though, I'm not sure why).\n\nBut on modern operating systems (Windows XP and newer OS), it is probably best to use the 10th Anniversary mod instead anyway. It includes the updated files that come with patch version 445, and the fixes from the unofficial patch 445++ too, so you don't need to install them if you use this mod anyway. What it does is that it makes the game use the newer DirectX 9 runtime instead of the DirectX 6.1 the game was meant for. And it fixes most of the bugs (and there are quite a few bugs with this game unfortunately). The game was initially developed for Windows 98, so it is not very surprising that it does not work properly without this mod.\n\nGet the 10th Anniversary mod at http://drakan.eu (official mod website) or atIf you encounter any more issues, seeon how to get the game running on newer OS (Windows Vista/7/8). I've only tested it on XP so far.\n\nINSTRUCTIONS\n\n1. Open one of the &quot;Drakan - Order of the Flame&quot; virtual disc image files (they are NOT two separate discs)\n(with Daemon-Tools Lite for example);\n2. Run the setup and install the game;\n3. Download and apply the 10th Anniversary mod mentioned above.\n(again, I strongly recommend it - the game will probably not work on XP and newer Windows otherwise);\n4. (optionally) unmount the disc (it should no longer be needed to run the game).\n\nThat's it, enjoy the game, or let me know if there are issues.\nIf there's anything else you need help with, just ask politely, and I might answer in the comments section!\nOr, if you have any suggestions regarding information I should include in this description, also let me know!\nHave fun!","torrent":{"xt":"urn:btih:84e9cb7f3dabe5a039b1bfeffa7a60bc520210a0","amp;dn":"Drakan%3A+Order+of+the+Flame+%281999%29+v445","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84e9cb7f3dabe5a039b1bfeffa7a60bc520210a0","infoHashBuffer":{"type":"Buffer","data":[132,233,203,127,61,171,229,160,57,177,191,239,250,122,96,188,82,2,16,160]},"announce":[],"urlList":[]}}