{"title":"Art Zoyd - Nosferatu","uid":6382724,"size":136302888,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8514d00df386a120f126ce5f1e26942847bdfa29&amp;dn=Art+Zoyd+-+Nosferatu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nuovonadrachal","files":21,"time":1305087153,"description":"Nosferatu is the first of three scores for silent horror movies the Belgian group Art Zoyd recorded between 1989 and 1997. Friedrich Wilheim Murnau's classic Nosferatu served as the first guinea pig and it worked wonderfully. This happened at a time when performing new music over screenings of silent films had yet to become a trend in avant-garde circles (in the mid- to late '90s), although this particular film was enjoying a revival of sorts (metallers Helstar released an album by the same title in 1989). The group managed to remain true to Murnau's chef-d'oeuvre while delivering a genuine Art Zoyd platter. The lineup is the same as for 1987's Berlin, but the ideas have matured. Taking a cue from the previous album's &quot;A Drum, a Drum,&quot; the music includes vocal passages, some sung by Thierry Zaboitzeff in a low, gravely, hellborn voice, others being pre-recorded children's choir parts. The 60-minute suite follows the film scene by scene, but it stands marvelously well on its own. Keyboards are definitely dominating the sound, with touches of cello and saxophone added for an extra Gothic feel.\n\nFormat: Mp3","torrent":{"xt":"urn:btih:8514d00df386a120f126ce5f1e26942847bdfa29","amp;dn":"Art+Zoyd+-+Nosferatu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8514d00df386a120f126ce5f1e26942847bdfa29","infoHashBuffer":{"type":"Buffer","data":[133,20,208,13,243,134,161,32,241,38,206,95,30,38,148,40,71,189,250,41]},"announce":[],"urlList":[]}}