{"title":"cracker...Forever(2002)[FLAC]","uid":5866635,"size":457106405,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8536eaf8f5f65f26320cbddd0156896c1c983d90&amp;dn=cracker...Forever%282002%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":28,"time":1286232329,"description":"2002 Forever   CD   COOKCD 231 \n\n1 Brides of Neptune  4:57 \n2 Shine  4:20 \n3 Don't Bring Us Down  4:02 \n4 Guarded by Monkeys  4:22 \n5 Ain't That Strange  4:07 \n6 Miss Santa Cruz County  4:29 \n7 Superfan  3:55 \n8 Sweet Magdalena of My Misfortune  3:35 \n9 Merry Christmas Emily  3:56 \n10 Forever  4:13 \n11 Shameless  3:44 \n12 One Fine Day  6:54 \n13 What You're Missing  5:42 \n\n\nForever is a minor comeback for the men and women in Cracker. They might have reached their commercial peak in the early '90s, but Cracker works hard to re-establish their credibility after two decent but spotty albums. As on their previous full-length, 1998's Gentleman's Blues, they concentrate less on the post-punk barnburners of their first three records and settle into a more grounded approach. Johnny Hickman and David Lowery are still the main focus of the band, and their chemistry has developed into a nice combination of '70s power pop and modern roots rock. This works to their favor on several occasions, as Lowery's deadpan delivery and obscure lyrics can be hard to comprehend when buried under a tense, fast-paced song. There are a significant amount of memorable, high-quality tracks from this album, something that does not always hold true for this duo. The opening &quot;Brides of Neptune&quot; is a gorgeous track that features the best Lowery nonsense lyrics since 1994's Kerosene Hat and music that could have been taken right off of a mid-'80s Church album. &quot;Don't Bring Us Down&quot; is a homegrown folk rocker that feels like Elvis Costello recast as a cynical Southerner; elsewhere Hickman takes the microphone for the sweeping psychedelic rave-up &quot;Superfan.&quot; And &quot;Shameless&quot; employs a memorable Hickman guitar part and some beautiful gospel-style background vocals to achieve one of the grooviest songs of their career. Their stab at the country-rap genre, &quot;What You're Missing,&quot; is a funny (if overlong) stab at Detroit DJ turned balladeer Uncle Kracker that even lets drummer Frank Funaro and bassist Brandy Wood each rap a verse. One of the most endearing features of Cracker's output is their constant references to their other material. Lowery and Hickman use many of the same characters and phrases as the basis for their songs, giving their catalog a familiar and engaging feel. This album is no different, making references to songs from all over their career, even other songs on this album. This album rewards fans with little touches like that and it is such a minor detail that it won't alienate new listeners. There are definitely some slow moments here, as certain tracks start strong but wear out their welcome as they go along. But this is a noticeable improvement over their material from the second half of the '90s, and marks a return to quality without resorting to rehashing old ideas. ~ Bradley Torreano, All Music Guide\n\ncd ripped by dBpoweramp\n\nplease seed","torrent":{"xt":"urn:btih:8536eaf8f5f65f26320cbddd0156896c1c983d90","amp;dn":"cracker...Forever%282002%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8536eaf8f5f65f26320cbddd0156896c1c983d90","infoHashBuffer":{"type":"Buffer","data":[133,54,234,248,245,246,95,38,50,12,189,221,1,86,137,108,28,152,61,144]},"announce":[],"urlList":[]}}