{"title":"E. E. Knight - Vampire Earth Books 1-8 (Graphic Audio)","uid":12392582,"size":6273062914,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:854d24251808153fb7d7ca2636ac1622260376a8&amp;dn=E.+E.+Knight+-+Vampire+Earth+Books+1-8+%28Graphic+Audio%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cybotage","files":129,"time":1441912147,"description":"\n\n1 : The Way of the Wolf (Parts 1/2)\nLouisiana, 2065. A lot has changed in the forty-third of the Kurian Order. Possessed of an unnatural and legendary hunger, the bloodthirsty Reapers have come to Earth to establish a New Order built on the harvesting of enslaved human souls. They rule the planet. They thrive on the scent of fear. And if it is night, as sure as darkness, they will come.\n\nOn this pitiless world, the indomitable spirit of mankind still breathes in Lieutenant David Valentine. Brought into the Wolves-an elite guerrilla force sworn to win back Earth-Valentine leads his first command in the Kurian Zone. Driven by the losses of his past and the hope of a future, Valentine is in it to win. No matter how long it takes. No matter what doom awaits him beyond his wildest nightmares.\n\nFIGHT. KILL. SURVIVE.\n\nTHIS IS THE WAY OF THE WOLVES.\n\n2 : Choice of the Cat (Parts 1 / 2)\nDavid Valentine resigns as a Wolf militia, and accepts an offer to become a Cat, one of the stealthy warriors trained to spy on, and go toe-to-toe with the Reapers. Under the command of his mentor, Smoke, Val's first mission is to enter the Kurian zone and investigate &quot;The Twisted Cross&quot;, a strike force of alien-human hybrids, possessing the skills of combat veterans and the hunger of the Reapers....Along the way he befriends a powerful alien, a Grog named Anh-Ka, who declares David his blood brother after Valentine nurses him back from death.\n\n3. Tale of the Thunderbolt (Parts 1 and 2)\nIt's the forty-eighth year of the Kurian Order. The alien, vampiric Kur and their avatars, the Reapers, control most of the Earth- their new feeding ground. Humanity is scattered and survives only at their new master's whims. But the Resistance is attempting to reclaim Earth. David Valentine, member of the elite Cat spy force, is in enemy uniform aboard the aging gunboat Thunderbolt. Whispers have reached him of the discovery of a long-lost weapon in the Caribbean- the first glimmer of hope for humanity to finally defeat the Reapers. Control of the ship lies in the hands of a tyrannical captain, and nothing short of full-scale mutiny can win it back. With only a few loyal sailors at his side, Valentine embarks on a terrifying journey through the deadly waters of the Gulf, searching for the weapon that will guarantee that this year- the forty-eighth year of the Kurian Order's domination of Earth- will be the Kurian's last...\n\n4. Valentine's Rising (Parts 1 and 2)\nOzark Free Territory, 2071:\n\nThe Kurian Order has reigned for fifty years. Using the dreaded power of their Reaper avatars, the alien, vampiric Kur hold dominion over the earth and its inhabitants. Yet there are those who would rather die fighting than surrender to the unquenchable thirst of the enemy-those like David Valentine.\n\nReturning to the Ozark Free Territory, Valentine is shocked to find it overrun by Kurians under the command of the merciless Consul Solon. In a bid to turn the tide, Valentine leads a courageous group of soldiers on a desperate mission to drive a spike into the gears of the Kurian Order. Valentine stakes life, honor, and the future of his home on a rebellion that sparks the greatest battle of his life- one that he may not survive...\n\n5. Valentine's exile\nIn a valiant rebellion against a half century of occupation by the Kurians, the newly formed Texas Republic and Ozark Free Territory have dealt the vampiric aliens their first major defeat. Resistance member David Valentine is revered as a hero for his part in fighting to regain Earth''s freedom. But a dangerous enemy within his own ranks soon has Valentine facing charges for his handling of the Quisling prisoners - humans who have become pawns of the Kurians in order to survive.\n\n6. Valentine's Resolve\nAfter three years of exile from humanity's war against the Kurians, David Valentine returns to battle. The Lifeweavers, Earth's allies in the conflict, have mostly vanished, but those that remain are held captive by an overlord known as the Seattle Kurian. To free them, Valentine must convince the legendary resistance fighter known as Adler to join his cause. But the &quot;Old Man&quot; is something of an overlord himself...\n\n7. Fall with Honor\nFreedom is on the march as the rebellion against the Kurian Occupation of Earth takes the offensive. David Valentine has recruited an ad hoc company of former Quisling soldiers and puts them through a trial by fire with a successful raid against an enemy armory. Now, they're ready to join forces with a guerilla army planning to establish a new freehold in the Appalachian Mountains.\n\nValentine knows that a permanent outpost near the East Coast would provide a strategic victory over the Kurians - and he believes that only his old ally Ahn-Kha could be leading the guerillas. But nothing could prepare Valentine's fighters for what awaits them at the end of their journey.\n\n8. Winter Duty\nMajor David Valentine and his fugitive battalion are the remnants of an expeditionary force shattered in its long retreat from disaster in the Appalachians. Between a raging blizzard, bands of headhunters, and the need to recover wounded soldiers lost during the retreat, Valentineis in for the toughest winter of his life.\n\nAnd Valentine is losing allies fast. Some of the clans in the region have declared themselves in favor of the Kurians, throwing Kentucky into civil war. But the Kurian overlords have determined that the region isn't worth the effort of another conquest. Their order: extermination","torrent":{"xt":"urn:btih:854d24251808153fb7d7ca2636ac1622260376a8","amp;dn":"E.+E.+Knight+-+Vampire+Earth+Books+1-8+%28Graphic+Audio%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"854d24251808153fb7d7ca2636ac1622260376a8","infoHashBuffer":{"type":"Buffer","data":[133,77,36,37,24,8,21,63,183,215,202,38,54,172,22,34,38,3,118,168]},"announce":[],"urlList":[]}}