{"title":"Illuminated Words v1.0","uid":8669577,"size":29174798,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:8595176766d57f5471427e62c0b87a1d55d4a835&amp;dn=Illuminated+Words+v1.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1373474403,"description":"\nIlluminated Words is an addictive, ambient experience. Find words against the clock in a unique, fast paced word game. Tint the world with your words and collect colors to build up your color palette.\n\nIlluminated Words is a new take on traditional word games. Longer words will form special blocks which will explode with color and help you on your way. Flow through many colors to a beautiful ambient soundtrack, challenging yourself to unlock all the shades.\n\nIlluminated Words was inspired by those really satisfying color swatches you find in paint shops. As players play the game they will gradually unlock colors with names like Unmellow Yellow and Mango Tango and fill in and collect a color swatch on the front screen.\n\nThe game itself is a race against the clock to find words on a grid and collect as many colours as possible. Finding words will destroy the letters and start to tint the screen in a color. \n\nLonger words will create special blocks which will explode in a burst of color progressing things more quickly. The whole game is designed to be an ambient flow experience, with the visuals and music adapting to the game progress and the color currently being worked on.\n\nPlayers of any ability level can enjoy Illuminated Words. The game can be played competitively to see which level (colors collected in one turn) can be achieved, but whichever level players reach they will unlock some new colours and continually progress through the game.\n\nIlluminated words is a beautiful, highly polished adventure with letters. Chillout and Spell.\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.fungameco.tinted&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.fungameco.tinted&lt;/a&gt;\n","torrent":{"xt":"urn:btih:8595176766d57f5471427e62c0b87a1d55d4a835","amp;dn":"Illuminated+Words+v1.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8595176766d57f5471427e62c0b87a1d55d4a835","infoHashBuffer":{"type":"Buffer","data":[133,149,23,103,102,213,127,84,113,66,126,98,192,184,122,29,85,212,168,53]},"announce":[],"urlList":[]}}