{"title":"Security for Microsoft Windows System Administrators{BBS}","uid":6753414,"size":11497234,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:85b8c8baed160d38d857896176834fa02ddda38f&amp;dn=Security+for+Microsoft+Windows+System+Administrators%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1318950856,"description":"This handy guide features security information for Windows novices and more experienced admins alike, including security basics and tools that provide advanced protection against network attacks and system failures.&quot;--TechTarget's round-up of the &quot;Five Windows Servers books to watch for in 2011&quot;\n\n&quot;Anyone faced with securing Windows systems for the first time would do well to make this book their first port of call. It's a well-balanced overview of all the facets of Windows system management that need to be addressed from a security perspective. In fact, it's a useful book for anyone, working on any platform, who needs to understand where security issues reside within corporate systems. That's because, although it is focused on Windows, and all the practical examples, screenshots and step-by-step instructions relate to that platform, the author also devotes considerable portions of the book to the conceptual groundwork.. IT practitioners who need to get to grips with security issues will find the book a valuable briefing on the most pressing issues, along with a great deal of practical, hands-on advice on how you go about putting the principles into action in a Windows environment.. this book gives you a kind of 'to do' list of features and functions that need to be addressed.&quot;--Network Security\nProduct Description\n\nIt's no longer just a buzz word: &quot;Security&quot; is an important part of your job as a Systems Administrator. Most security books are aimed at security professionals, but Security for System Administrators is written for System Administrators. This book covers the basics of securing your system environment as well as security concepts and how these concepts can be implemented practically using common tools and applications. Whether you are new to this profession or have been in the field a while, you'll find valuable information in each chapter. The book's examples will focus on Windows Server 2008 R2 and Windows 7, but many concepts are platform agnostic.\n\n\n    * Take all the confusion out of security including: network attacks, system failures, social networking, and even audits\n\n    * Learn how to apply and implement general security concepts\n\n    * Identify and solve situations within your network and organization\n\nSee all Editorial Reviews\nProduct Details\n\n    * Paperback: 216 pages\n    * Publisher: Syngress (October 7, 2010)\n    * Language: English\n    * ISBN-10: 1597495948\n    * ISBN-13: 978-1597495943","torrent":{"xt":"urn:btih:85b8c8baed160d38d857896176834fa02ddda38f","amp;dn":"Security+for+Microsoft+Windows+System+Administrators%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85b8c8baed160d38d857896176834fa02ddda38f","infoHashBuffer":{"type":"Buffer","data":[133,184,200,186,237,22,13,56,216,87,137,97,118,131,79,160,45,221,163,143]},"announce":[],"urlList":[]}}