{"title":"Mickey Newbury - Stories from the Silver Moon Cafe [2000][FLAC]","uid":10663304,"size":316146680,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:87a54622577821bafd6fca1b1a02feda3eb0ed3c&amp;dn=Mickey+Newbury+-+Stories+from+the+Silver+Moon+Cafe+%5B2000%5D%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":-1,"time":1406757466,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Mountain Retreat #8160\nCountry: USA\nYear: October 10th 2000\nGenre: americana,rock\nFormat: CD, Album,\n\n[b]\n\n\n01. The Silver Moon Cafe\n02. Lie To Me Darlin'\n03. It Makes Me So Sad\n04. Some Memories Are Better Left Alone\n05. Down 'n' Dirty\n06. Why You Been Gone So Gone\n07. Ain't No Blues Today\n08. Ain't No Sunshine\n09. Oh Mama\n10. Dancing Shadows\n11. Twenty Years And Sweet Dreams Ago\n12. A Storm Is Comin'\n13. A Father's Prayer\n\n\n\nStories From the Silver Moon Cafe was a characteristic effort in many respects. As on all Mickey Newbury albums, the spaces between tracks were filled with atmospheric sound effects such as chirping crickets, barking dogs, a passing car, trains, and plenty of rain and thunder. As on all Mickey Newbury albums, the selection of songs mixed new compositions and re-recordings of old songs. And as on all Mickey Newbury albums, there were some classic country songs. &quot;Don't it sound like something you have heard before?&quot; Newbury asked in &quot;Oh Mama,&quot; and he easily could have been referring to his own work. Even the imagery was repeated: Two songs employed the phrase &quot;one thin dime,&quot; and freight trains were mentioned in three. It had always been a talent of Newbury's to write country songs that sounded like they had been around forever, and such works as &quot;Ain't No Blues Today&quot; (which probably dated back to at least the 1970s) and &quot;Ain't No Sunshine&quot; (not the Bill Withers hit) certainly did. So did &quot;Why You Been Gone So Long,&quot; but that was no wonder, since it had been a country hit in 1969. As ever, Newbury was a master at expressing emotional pain brought on by dislocation or romantic discord, but he also expanded into a more general sense of dread. However drawn he was to darkness, though, he concluded with the formal statement of faith and family, &quot;A Father's Prayer,&quot; underlying a basic paradox in his lifelong stance as an artist, that this poet of the depressed and dissolute had long since settled into a stable family life himself and, at 60, was now looking serenely toward his golden years.","torrent":{"xt":"urn:btih:87a54622577821bafd6fca1b1a02feda3eb0ed3c","amp;dn":"Mickey+Newbury+-+Stories+from+the+Silver+Moon+Cafe+%5B2000%5D%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87a54622577821bafd6fca1b1a02feda3eb0ed3c","infoHashBuffer":{"type":"Buffer","data":[135,165,70,34,87,120,33,186,253,111,202,27,26,2,254,218,62,176,237,60]},"announce":[],"urlList":[]}}