{"title":"Claire Lynch - New Day [2006][EAC,log,cue. FLAC]","uid":8543626,"size":254119092,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:87a6b6ecb256cb637098e1bdb843ff702f18c0a4&amp;dn=Claire+Lynch+-+New+Day+%5B2006%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dickspic","files":16,"time":1370461335,"description":"Artist: Claire Lynch\nRelease: New Day \nReleased: 2006\nLabel: Rounder Records\nCatalog#: 11661-0563\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: americana,bluegrass\n\nimage\n\n01. Be Ready To Sail (3:27)\n02. Train Long Gone (3:14)\n03. Love Will Find You Again (3:42)\n04. Up This Hill And Down (4:03)\n05. Down In The Valley (3:17)\n06. Fallin' In Love (3:02)\n07. Long After I'm Gone (3:25)\n08. Leavin' On That Evening Train (3:15)\n09. Only Passing Through (4:21)\n10. White Train (3:49)\n11. River Of Dreams (3:18)\n12. I Believe In Forever (3:17)\n\nIt's been six years since Claire's last original album. It's easy to forget why her voice is held in such high esteem by so many. NEW DAY will remind all her fans and likely convert many new ones. Her singing is just glorious. The arrangements strike an almost miraculous balance among the amazingly adept instrumentalists, Claire's front and center vocalizing and the someone unusual but entirely welcome prominence given to her harmony singers. One can hardly find better playing than that of David Harvey on mandolin, Jim Hurst on guitar, the ubiquitous Stuart Duncan and Andrea Zonn on fiddles, Rob Ickes on dobro, Alison Brown and Charlie Cushman on banjos, and Missy Raines on bass. Jim Hurst, Claire herself and others form a chorus on almost every song-a bit unusual, as I've said, given that too often in other recordings the harmony singers are buried so deep as to be nearly inaudible. Not so here. Soaring above the instrumentalists and the choristers is Claire singing so subtly and beautifully. \n\nPatty Loveless, Alison Krauss, and Claire Lynch-my, we are lucky to have them all! Such voices and recordings balance out the dreck which passes for country music on radio. \n\nEvery song is fine, quite a few spectacular. Claire shows her writing chops as writer or cowriter of the splendid &quot;Long After I'm Gone&quot; (with Pat Alger), &quot;River of Dreams&quot; (with Jess Leary), and &quot;I Believe in Forever.&quot; The covers chosen couldn't be better: &quot;Fallin' in Love&quot; (Henry Hipkens) is the best of several fine swing numbers and so ingratiating it must bring a smile to even the darkest spirit; a beautiful version of Mac McAnally's &quot;Only Passing Through;&quot; and a superb opening number-&quot;Be Ready to Sail&quot; (Pat Alger and Austin Cunningham). But, this listener's favorite is the goosebump-inducing &quot;Down in the Valley&quot; (Jess Leary and others). The whole world should hear a song this fine, intricate, and moving with Claire working wonders with her voice. Enjoy","torrent":{"xt":"urn:btih:87a6b6ecb256cb637098e1bdb843ff702f18c0a4","amp;dn":"Claire+Lynch+-+New+Day+%5B2006%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87a6b6ecb256cb637098e1bdb843ff702f18c0a4","infoHashBuffer":{"type":"Buffer","data":[135,166,182,236,178,86,203,99,112,152,225,189,184,67,255,112,47,24,192,164]},"announce":[],"urlList":[]}}