{"title":"Blue Tears - (2005) Mad, Bad &amp; Dangerous - 320kbps","uid":3907975,"size":174807260,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:87a8d555a611e11caa2a12a008f8475b755ed70b&amp;dn=Blue+Tears+-+%282005%29+Mad%2C+Bad+%26+Dangerous+-+320kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"trick-flame","files":16,"time":1195953758,"description":"01 - Long Way Home\n02 - Girl Crazy\n03 - With You Tonight\n04 - Mystery Man\n05 - Rock You To Heaven\n06 - Evidence Of Love\n07 - Mad, Bad &amp; Dangerous To Know\n08 - Misty Blue\n09 - Kisses In The Dark\n10 - Everywhere I Go\n11 - Midnight Train\n12 - Follow Your Heart\n13 - Russia Tonight\n14 - Love Machine\n15 - The Last Serenade\n16 - Live It Up\n\nReview from sleazeroxx.com:\n\nI&amp;#039;ve been listening to hair metal for some twenty years now (in fact the term hair metal wasn&amp;#039;t even around back then), so how come no one told me Bon Jovi and Def Leppard had teamed-up under the moniker Blue Tears? Hmmm...so Blue Tears is actually an entirely separate entity? Well they sure have the harmonies, melodies and pop-rock strut of the afore-mentioned bands perfected.\n  \nActually Blue Tears managed to release a self-titled album back in 1990 on a major label (MCA), but it sank without a trace. So what we have on Mad, Bad &amp; Dangerous is a collection of songs slated for the unreleased follow-up as well as some tunes written prior to the debuts release. While listening to this it makes one wonder who dropped the ball at MCA - because this type of music infested the charts in the early &amp;#039;90s. This collection is catchy, melodic and safe, and the guys had the image for stardom - so what went wrong?\n  \n&quot;Long Way Home&quot; (and to a lesser extent &quot;Love Machine&quot;) could be the best song Def Leppard never recorded, I can only imagine how many copies they would sell these days if they were still able to write choruses like this! The Bon Jovi comparisons take center stage on the mid-tempo &quot;Kisses In The Dark&quot; and the faster &quot;Follow Your Heart&quot;. Of course with music like this you will get your fill of sappy ballads, but fans of this genre will be used to that, and songs like &quot;Russia Tonight&quot; work extremely well.\n  \nThis is the first retro release from upstart label Suncity Records and a round of applause has to be given to them and the band. The sound on the majority of these old recordings (nothing more then demos really) is very clean and the CD booklet is very well done. For a first time effort I am very impressed.\n  \nI&amp;#039;ll ask one more time, how come Blue Tears wasn&amp;#039;t massive in 1990? Visit www.suncityrecords.com while trying to figure that one out.","torrent":{"xt":"urn:btih:87a8d555a611e11caa2a12a008f8475b755ed70b","amp;dn":"Blue+Tears+-+%282005%29+Mad%2C+Bad+%26+Dangerous+-+320kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87a8d555a611e11caa2a12a008f8475b755ed70b","infoHashBuffer":{"type":"Buffer","data":[135,168,213,85,166,17,225,28,170,42,18,160,8,248,71,91,117,94,215,11]},"announce":[],"urlList":[]}}