{"title":"Melvins-Electroretard 192k mp3  ak6103","uid":10507397,"size":61101327,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:87e40c914fb55f8bd19c8ecba4a930726d9d2c55&amp;dn=Melvins-Electroretard+192k+mp3++ak6103&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"analogkid6103","files":9,"time":1404795370,"description":"Melvins-Electroretard 192k mp3 What we got Melvins Melvins are an American rock band that formed in 1983.[1] They usually perform as a trio, but in recent years have performed as a four piece with two drummers. Since 1984, singer and guitarist Buzz Osborne (also known as King Buzzo) and drummer Dale Crover have been the band's ongoing members. The band was named after a supervisor at a Thriftway in Montesano, Washington, where Osborne also worked as a clerk. &quot;Melvin&quot; was despised by other employees, and the band's members felt it to be an appropriately ridiculous name.\n\nMelvins' music is influenced by Black Flag's mix of punk and metal on their album My War, and other slow punk acts like Swans, Flipper and Wipers, but also by some hard rock and metal bands such as Kiss and Alice Cooper; however, their idiosyncratic approach, bizarre sense of humor, and experimentation make neat categorization difficult. Buzzo has also stated that his guitar playing is more influenced by Black Flag than Black Sabbath, with whom they are often compared.\n\nThey often favor very slow tempos, and their sludgy sound was a strong influence on grunge music, especially Nirvana, Soundgarden, Green River, and many other bands from Seattle. These bands, however, tended to use more conventional musical structures with this sound. Melvins have also influenced many bands outside the Seattle grunge scene, including Tool (who are personal friends with the band), Boris (who took their name from the title of a Melvins song), Mastodon, Neurosis,Eyehategod, and Isis. Thats what I got so give this a try and I hope you like it cause they have a huge catalog..............\n\n","torrent":{"xt":"urn:btih:87e40c914fb55f8bd19c8ecba4a930726d9d2c55","amp;dn":"Melvins-Electroretard+192k+mp3++ak6103","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87e40c914fb55f8bd19c8ecba4a930726d9d2c55","infoHashBuffer":{"type":"Buffer","data":[135,228,12,145,79,181,95,139,209,156,142,203,164,169,48,114,109,157,44,85]},"announce":[],"urlList":[]}}