{"title":"EnigmaT Set Rips { Cuts } - May 31st, 2013","uid":8524420,"size":453941006,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8844c37598264653d72bc8094b4e88e974eb3f83&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+May+31st%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":56,"time":1369994864,"description":"A.M.R. - Bliss (Cut From Tiddey Set)-enTc.mp3\nA.R.D.I. - Beyond The Time (ASOT 615 Rip)-enTc.mp3\nAaron Camz &amp; Solid Stone - Process of Elimination (Digital X Remix) (GDJB Rip)-enTc.mp3\nAiden Arie - Tabriz (Dennis Sheperd Remix) (ASOT 615 Rip)-enTc.mp3\nAleksey Sladkov, Matthew Preffekt &amp; Sasha August - Bounty (Dallaz Project Remix) (ASOT 615 Rip)-enTc.mp3\nAlexey Sonar - All Again (MDK Remix) (-Short- Cut From Fonarev Set)-enTc.mp3\nAndrew K &amp; White Resonance - In Our Dreams (Cut From Several Spirits Set)-enTc.mp3\nAndrew Rayel &amp; Bobina - Sacramentum (Andrew Rayel Aether Mix) (ASOT 615 Rip)-enTc.mp3\nArjona - One Chance To Be Yourself (Cut From Trainer Set)-enTc.mp3\nBjorn Akesson - Breathe (ASOT 615 Rip)-enTc.mp3\nCraig Garuda Feat. Miss C Novelli - Black Hole (ASOT 615 Rip)-enTc.mp3\nCRV -aka- Craving - Flare (Original Mix) (ASOT 615 Rip)-enTc.mp3\nDelta3 - In Your Eyes (Original Mix) (Cut From Delta3 Set)-enTc.mp3\nDreamy - This Is It (Original Banging Mix) (Cut From Tasev Set)-enTc.mp3\nFaruk Sabanci Feat. Jaren - Discover (ASOT 615 Rip)-enTc.mp3\nFull Tilt - Illuzionize (-Short- GDJB Rip)-enTc.mp3\nHazem Beltagui &amp; Allan Valente - The Fallen (ASOT 615 Rip)-enTc.mp3\nJames Woods - Bliss (Intrinity Remix) (Cut From Solarstone Set)-enTc.mp3\nJonathan Carvajal - Alba (Cut From Trainer Set)-enTc.mp3\nJorn van Deynhoven - Cheeky (-Short- ASOT 615 Rip)-enTc.mp3\nJorn van Deynhoven - Cheeky (Original Mix) (Cut From Sied Set)-enTc.mp3\nJustin Oh feat Remus - Where The Lights Fall (Meeke Remix) (Cut From Myon Set)-enTc.mp3\nLeolife - On a Wing (Martian Remix) (GDJB Rip)-enTc.mp3\nLoverushUK Feat. Bryan Adams - Tonight In Babylon 2013 (Bobina Remix) (ASOT 615 Rip)-enTc.mp3\nLTN - City Of Lights (Cut From Myon Set)-enTc.mp3\nMaor Levi - Lift Me (Cut From Xabi Set)-enTc.mp3\nMarkus Schulz Featuring Sarah Howells - Tempted (Dennis Sheperd Remix) (GDJB Rip)-enTc.mp3\nMichael Flint - Armenia (Estigma Remix) (Cut From Tasev Set)-enTc.mp3\nMike Danis - Are You Gonna Love Me (Cut From Myon Set)-enTc.mp3\nMoonbeam - Get On The Move (Myon &amp; Shane 54 ISOS Edit) (Cut From Myon Set)-enTc.mp3\nMorphile - Triangle (Cut From Several Spirits Set)-enTc.mp3\nMyon &amp; Shane 54 with Amy Pearson - Hurricane (Myon &amp; Shane 54 In Search Of Sunrise Mix) (Cut From Myon Set)-enTc.mp3\nMyon &amp; Shane 54 with Aruna - Lights (Cole Plante Remix) (Cut From Myon Set)-enTc.mp3\nMyon and Shane54 - The Strip (Juventa Remix) (ASOT 615 Rip)-enTc.mp3\nPaul Oakenfold - Turn It On (ASOT 615 Rip)-enTc.mp3\nPet Shop Boys - Vocal (Stuart Price Remix) (ASOT 615 Rip)-enTc.mp3\nPierce Hill - Draw the Line(GDJB Rip)-enTc.mp3\nPila Prize - Old Beach (Pila Prize Smash Up Ant Android Mix) (Cut From Pit Set)-enTc.mp3\nPurple Stories - Dark Tunnel (Cut From Pit Set)-enTc.mp3\nRascal van Russ - Ring (PhyGer Remix) (Cut From Sty Set)-enTc.mp3\nRene Vermont - Spark of Hope (Nicola Maddaloni Lift On ReWork) (Cut From Sty Set)-enTc.mp3\nRichard Durand &amp; Eximinds - Las Vegas (ASOT 615 Rip)-enTc.mp3\nRichard Durand &amp; Neev Kennedy - Running On Empty (ASOT 615 Rip)-enTc.mp3\nRoger Shah, JES &amp; Brian Laruso - Higher Than The Sun (ASOT 615 Rip)-enTc.mp3\nRoman Messer feat. Ange - Love Around The World (Iversoon &amp; Alex Daf Remix) (Cut From Pit Set)-enTc.mp3\nScott Lowe &amp; Andy Mollins - Leaving Limbo (Alter Future Remix) (GDJB Rip)-enTc.mp3\nSeth Hutton Featuring Judie Tzuke - Don't Look Behind You 2013 (Solid Stone Remix) (GDJB Rip)-enTc.mp3\nShogun Feat. Tania Zygar - Find Me (ASOT 615 Rip)-enTc.mp3\nSimon Patterson &amp; Lucy Pullin - The One (ASOT 615 Rip)-enTc.mp3\nSolis &amp; Sean Truby - Raise the Bar (GDJB Rip)-enTc.mp3\nSubstate vs Solarsky - Karma (Peetu S Remix) (Cut From Trainer Set)-enTc.mp3\nTee-Ex - Highest State (Cut From Solarstone Set)-enTc.mp3\nTempo Giusto &amp; Ima'gin - Europia (Original Mix) (Cut From Ima'gin Set)-enTc.mp3\nThe Thrillseekers &amp; DJ Talla2XLC - Fracture (Sebastian Brandt Remix) (ASOT 615 Rip)-enTc.mp3\nTIP - Stimuli (Oberon Remix) (Cut From Oakenfold Set)-enTc.mp3\nUNKNOWN - Take You To The Other World (Cut From Pit Set)-enTc.mp3\n","torrent":{"xt":"urn:btih:8844c37598264653d72bc8094b4e88e974eb3f83","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+May+31st%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8844c37598264653d72bc8094b4e88e974eb3f83","infoHashBuffer":{"type":"Buffer","data":[136,68,195,117,152,38,70,83,215,43,200,9,75,78,136,233,116,235,63,131]},"announce":[],"urlList":[]}}