{"title":"Forge of Empires- Three Revolutionary Statesmen and the World Th","uid":10924170,"size":17532512,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:88ba324a18ebe39c4d8240d041598e66b47d37e0&amp;dn=Forge+of+Empires-+Three+Revolutionary+Statesmen+and+the+World+Th&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1409353967,"description":"In the space of a single decade, three leaders liberated tens of millions of souls, remade their own vast countries, and altered forever the forms of national power: Abraham Lincoln freed a subjugated race and transformed the American Republic.Tsar Alexander II broke the chains of the serfs and brought the rule of law to Russia.Otto von Bismarck threw over the petty Teutonic princes, defeated the House of Austria and the last of the imperial Napoleons, and united the German nation.The three statesmen forged the empires that would dominate the twentieth century through two world wars, the Cold War, and beyond. Each of the three was a revolutionary, yet each consolidated a nation that differed profoundly from the others in its conceptions of liberty, power, and human destiny. Michael Knox Beran's &quot;Forge of Empires&quot; brilliantly entwines the stories of the three epochal transformations and their fateful legacies.\n\nTelling the stories from the point of view of those who participated in the momentous events -- among them Walt Whitman and Friedrich Nietzsche, Mary Chesnut and Leo Tolstoy, Napoleon III and the Empress Eug - nie -- Beran weaves a rich tapestry of high drama and human pathos. Great events often turned on the decisions of a few lone souls, and each of the three statesmen faced moments of painful doubt or denial as well as significant decisions that would redefine their nations.\n\nWith its vivid narrative and memorable portraiture, &quot;Forge of Empires&quot; sheds new light on a question of perennial importance: How are free states made, and how are they unmade? In the same decade that saw freedom's victories, one of the trinity of liberators revealed himself as an enemy to the free state, and another lost heart. What Lincoln called the &quot;germ&quot; of freedom, which was &quot;to grow and expand into the universal liberty of mankind,&quot; came close to being annihilated in a world crisis that pitted the free state against new philosophies of terror and coercion.\n\n&quot;Forge of Empires&quot; is a masterly story of one of history's most significant decades.","torrent":{"xt":"urn:btih:88ba324a18ebe39c4d8240d041598e66b47d37e0","amp;dn":"Forge+of+Empires-+Three+Revolutionary+Statesmen+and+the+World+Th","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88ba324a18ebe39c4d8240d041598e66b47d37e0","infoHashBuffer":{"type":"Buffer","data":[136,186,50,74,24,235,227,156,77,130,64,208,65,89,142,102,180,125,55,224]},"announce":[],"urlList":[]}}