{"title":"ExploitedCollegeGirls - Amber","uid":13287047,"size":1029328061,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:88c29f05ffb085f4aed2ba7b7798229a12cc6709&amp;dn=ExploitedCollegeGirls+-+Amber&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SudoSu","files":1,"time":1453551650,"description":"http://youpornbook.com\r\n\r\n―――――――――――――――――――――――――\r\n ... : Screenshots : ... \r\n―――――――――――――――――――――――――  \nhttp://imgkiss.com/image/tKNR0 \nhttp://imgkiss.com/image/tKcep\r\n\r\nIf you've ever wondered what it would take to turn Jay into an ass man, it might be this week's girl and her amazing backside. Of course her textbook perfect and virgin tight pussy quickly distract him and the subject isn't put to bed. But it's curious, the last Amber we had here at Ex Co Gi also had an amazing booty, so maybe we're onto something. This week's update starts with a car ride, which naturally devolves into car head and we get a glimpse very quickly of how up for anything Amber is. What we don't get, however, is a look at her insane bod. Eventually, Jay gets her back to the hotel to get the real party started and Amber throws off her clothes before he even gets the cameras running. When he catches up to her and we finally get a look at her, it's well worth the short wait. This girl has got an amazing, beautiful body. \r\n\r\nFrom her deep winter tan to her tight, bare puss, this girl is an eyefull. After Jay gets her naked and her pussy starts getting wet as soon as he touches her, Jay gets to work using his fingers and then a vibrator. It's sorta hard to tell, but it seems pretty likely that Amber orgasms at least twice as things get started. After his excellent vag work, Jay has Amber drop to the floor to continue sucking him off. Back to that ass, though! Jay gets her up to the bed with her booty in the air for some solid doggy until her pussy gets tired. After a quick break, he fucks her in the rest of his favorite positions: sideshow, on her back, from the side for some deep penetration, and Amber loves every minute of it. As does Jay. It almost seems like Jay is surprised by how into it Amber is, because when she starts talking dirty and begging him to pound her he blows a monster load in her and on her for a creampie and pillow case destroyer of a nut that will likely cost him his deposit. And no, we don't know what's in all the boxes Jay has stacked up in the corner. Possibly Amway? Maybe Jay's sideline of Ex Co Gi merch? \r\n\r\nMore exclusive porn at:  https://thepiratebay.se/user/SudoSu/","torrent":{"xt":"urn:btih:88c29f05ffb085f4aed2ba7b7798229a12cc6709","amp;dn":"ExploitedCollegeGirls+-+Amber","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88c29f05ffb085f4aed2ba7b7798229a12cc6709","infoHashBuffer":{"type":"Buffer","data":[136,194,159,5,255,176,133,244,174,210,186,123,119,152,34,154,18,204,103,9]},"announce":[],"urlList":[]}}