{"title":"The Anthony Cumia Show 2015-04-23 Nick DiPaolo Mia Isabella","uid":11844229,"size":312423594,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:898d1518861e626ae9f91ea4daf8e11bc8a6a502&amp;dn=The+Anthony+Cumia+Show+2015-04-23+Nick+DiPaolo+Mia+Isabella+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mothergoose58","files":2,"time":1429893842,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest(s): Nick DiPaolo, Mia Isabella\n\nEpisode 151 - Anthony &quot;Betty Boop&quot; Cumia shows us the early birthday gift Brother Joe gave him, a throwback Thursday picture, engages in hair plug chat, and goes through the guests that will be on today's TACS. Ant then gets into the latest Hillary Clinton dirt, vows to stop questioning why there are problems in certain communities, plays a selfie stick fight video, one of a white boy who goes hard cuz, watch Robert Downey Jr's failed interview, see volcano footage from Chile, and hear from a couple of callers. Ant steps outside the studio to talk with Nick DiPaolo about hate speech, being politically correct, the military wearing high heels (??), the feminist movement, partnerships in radio, fatty art, being subjective somehow equaling hate, and of course, the Sopranos. The guys also discuss the evolution of criminal behavior, changes in diversity, division being at its worst, the non-taxpaying MSNBC workers, a possible Sopranos remake at the compound, people getting passes, the presidential candidates, religion in politics, the live White House briefing, and talk about not having proper representation. Mia Isabella joins the guys to talk about being the first trans in a video game, acceptance, identifying, her role on Sons of Anarchy, Bruce Jenner, paparazzi and drones, and Ant shows off a few of his drone videos and talks about his drone mishap. Anthony plays &quot;Dicis&quot; for Mia and Nick, they talk about the pros and cons of drones, the &quot;mistletoe drone&quot;, Mia talks about her early life, explains the word transgender, they debate men verses women in the workforce, standards in the military, and this week comes to a close with Ant's birthday gifts and cake, talking about immaturity, and James Woods.\n\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:898d1518861e626ae9f91ea4daf8e11bc8a6a502","amp;dn":"The+Anthony+Cumia+Show+2015-04-23+Nick+DiPaolo+Mia+Isabella+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"898d1518861e626ae9f91ea4daf8e11bc8a6a502","infoHashBuffer":{"type":"Buffer","data":[137,141,21,24,134,30,98,106,233,249,30,164,218,248,225,27,200,166,165,2]},"announce":[],"urlList":[]}}