{"title":"Governing through technology: information artefacts and social","uid":8659843,"size":991397,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:89a990951ef8891bb0c709da67cca868e26649f5&amp;dn=Governing+through+technology%3A+information+artefacts+and+social&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nedand","files":-1,"time":1373299045,"description":"\nGoverning through technology: information artefacts and social practice / by Jannis Kallinikos\nPublisher: Palgrave Macmillan | ISBN: 0230280889, 9780230280885 | 2011 | PDF | 176 pages | 968 Kb\n\nGoverning Through Technology describes the vital importance which digital information, in all its breeds and formats, acquires in restructuring organizations and other domains of social life in which expert work is carried out. Information produced and disseminated by an interlocking ecology of computer-based systems and artifacts currently provides the essential yet steadily shifting means for planning organizational operations and controlling organizational performances through multiple comparisons of outcomes across tasks, units, work clusters and sources. Information and information-based technologies are also a vital means through which expert work is conducted and monitored and an indispensable carrier of messages within and across sites and institutional boundaries.\nIn all these qualities, information ceases to be a simple administrative companion through which people execute or monitor their duties and becomes a pervasive element and a crucial platform upon which new social, administrative and economic relations develop. ","torrent":{"xt":"urn:btih:89a990951ef8891bb0c709da67cca868e26649f5","amp;dn":"Governing+through+technology%3A+information+artefacts+and+social","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89a990951ef8891bb0c709da67cca868e26649f5","infoHashBuffer":{"type":"Buffer","data":[137,169,144,149,30,248,137,27,176,199,9,218,103,204,168,104,226,102,73,245]},"announce":[],"urlList":[]}}