{"title":"Lena Hughes - Queen of the Flat Top Guitar [2013] [FLAC]","uid":8213129,"size":97260828,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8c56736ed538786611c8c8490898dc67bdbc5f2e&amp;dn=Lena+Hughes+-+Queen+of+the+Flat+Top+Guitar+%5B2013%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":13,"time":1362279921,"description":"A musical 'amateur' who best exemplified true artistry, Lena Hughes was born in Grape Grove Township, Missouri, in 1904. Though she never recorded any 78s and only one LP, Hughes was most influential through her steady performances at various fiddler conventions and folk festivals throughout the Ozarks. She was an excellent fiddler, banjoist and guitar picker who retained the largely extinct repertoire of parlor pieces and the variety of specialized tunings that were necessary to play them. She lived most of her life in Ludlow, Missouri and passed away in 1998. \n\nLena Hughes' repertoire can be divided roughly in half: finger-picked numbers adapted from fiddle tunes and recast parlor guitar pieces gleaned from popular sentimental songs, hymns, and 19th century airs. As a faithful attendee at folk festivals, Hughes was accompanied by her guitar-playing husband, Jake. Her most mesmerizing performances, such as Pearly Dew, Spanish Fandango, and Kentucky Moon Waltz, depend heavily upon the resonance of the open chord as it relates to the picking of the melodic line, primarily on one string. This tonal reliance is most similar to the &quot;celestial octave&quot; that Washington Phillips employs, with similar effect, on his Train Your Child. This ethereal harmonic technique, which seems so natural in Hughes' playing, is the holy grail for most finger-picking guitarists. Her lack of pretense and her mastery of this repertoire is what defines her legendary status. \n\nThese recordings were made in the early 60's in Arkansas and released in very limited fashion as a private press LP. Remastered by Chris King. Designed by Susan Archie.","torrent":{"xt":"urn:btih:8c56736ed538786611c8c8490898dc67bdbc5f2e","amp;dn":"Lena+Hughes+-+Queen+of+the+Flat+Top+Guitar+%5B2013%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c56736ed538786611c8c8490898dc67bdbc5f2e","infoHashBuffer":{"type":"Buffer","data":[140,86,115,110,213,56,120,102,17,200,200,73,8,152,220,103,189,188,95,46]},"announce":[],"urlList":[]}}