{"title":"Oil: A Beginner's Guide ^ Vaclav Smil ^ azw3 ebook","uid":14699401,"size":913130,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8cb25b5b69d4c576901097a9f2543cccb8ac0498&amp;dn=Oil%3A+A+Beginner%27s+Guide+%5E+Vaclav+Smil+%5E+azw3+ebook&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"heliiaruy","files":1,"time":1464288637,"description":"Packed with fascinating facts and insight, this book will fuel dinner party debate, and provide readers with the science and politics behind the world’s most controversial resource. Without oil, there would be no globalisation, no plastic, little transport, and a global political landscape that few would recognise. It is the lifeblood of the modern world, and humanity’s dependence upon it looks set to continue for decades to come. In this captivating book, the author of the acclaimed Energy: A Beginner’s Guide, Vaclav Smil, explains all matters related to the ‘black stuff’, from its discovery in the earth, right through to the political maelstrom that surrounds it today. Author Vaclav Smil is Distinguished Professor in the Faculty of Environment at the University of Manitoba, Canada. He has written over 10 books on energy and been a keynote speaker at both the World Economic Forum and the Global Roundtable on Climate Change. He is the first non-American to receive the American Association for the Advancement of Science Award for Public Understanding of Science and Technology and is a Special Fellow of the Royal Society.\r\n\r\nazw3 can be converted in Calibre to whichever format you prefer, or can be directly placed in a Kindle file directory. Having been told I was uploading &quot;useless&quot; azw3 files, I hope you take the time to read this, learn about Calibre, or shut the fuck up. Cheers. Enjoy.\r\n\r\nheliiaruy heliiaruy heliiaruy","torrent":{"xt":"urn:btih:8cb25b5b69d4c576901097a9f2543cccb8ac0498","amp;dn":"Oil%3A+A+Beginner%27s+Guide+%5E+Vaclav+Smil+%5E+azw3+ebook","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8cb25b5b69d4c576901097a9f2543cccb8ac0498","infoHashBuffer":{"type":"Buffer","data":[140,178,91,91,105,212,197,118,144,16,151,169,242,84,60,204,184,172,4,152]},"announce":[],"urlList":[]}}