{"title":"Petrophysics - A Practical Guide","uid":14708363,"size":21379650,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8d0ac675ef78834acc94cd16123c1f0f1bb5012f&amp;dn=Petrophysics+-+A+Practical+Guide&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1464389605,"description":"Petrophysics - A Practical Guide - Steve Cannon (Wiley-Blackwell, 2016).pdf\r\n\r\nISBN 978-1-118-74674-5\r\n\r\nThis book has been developed in response to the needs of new hires entering the oil and gas industry who have not and may never get the opportunity and experiences of previous generations of petroleum geologists and engineers, many of whom started as surface loggers and wireline engineers working at the well site. This handbook is a useful and practical guide to the acquisition, analysis and integration of data, and the process of developing a robust evaluation of a potential hydrocarbon reservoir. This informative volume looks at the pitfalls and obstructions in encountered in any reservoir evaluation study and suggests alternative solutions and work-rounds. Petrophysics: A Practical Guide addresses the basic principles behind all types of data acquisition, including equipment design and tool operation; quality control of data; routine and special core analysis; integration of all types of relevant data and the basic methods of interpretation, with an emphasis on data management and application of results This informative handbook is useful for those studying petroleum geology or engineering for whom the role of the petrophysicist can become lucrative and satisfying career. The book will be equally useful to students and practitioners of environmental science and hydrogeology where the understanding of groundwater flow is an important part of their technical remit","torrent":{"xt":"urn:btih:8d0ac675ef78834acc94cd16123c1f0f1bb5012f","amp;dn":"Petrophysics+-+A+Practical+Guide","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d0ac675ef78834acc94cd16123c1f0f1bb5012f","infoHashBuffer":{"type":"Buffer","data":[141,10,198,117,239,120,131,74,204,148,205,22,18,60,31,15,27,181,1,47]},"announce":[],"urlList":[]}}