{"title":"Sexually Broken--Elise Graves takes on 10 inch BBC, brutally dee","uid":9639051,"size":653833844,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:8e34b1ded93776cdc5f1a9c553987ba73c23f58d&amp;dn=Sexually+Broken--Elise+Graves+takes+on+10+inch+BBC%2C+brutally+dee&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"merzedes","files":-1,"time":1392884125,"description":"Elise Graves takes on 10 inch BBC, brutally deep throated without mercy, massive multiple orgasms! | Elise Graves\n\nFebruary 19, 2014\n\n\nMP4 only.\n\n\nTiny toned Elise Graves is a natural born pervert. She got into porn because of a deep craving to explore every dark corner of her sexual makeup. We love unapologetic perverts like Elise, and today we aim to give her exactly what she craves. And in this case, what Elise craves is 10 inches of BBC crammed all the way down her little mouth hole until she is cross eyed and dizzy.\n\nThe set up is simplicity in itself. In a corner of a cold empty warehouse, Elise is lashed to a metal bed frame with zip ties. Her pale flesh goosebumps in the cool air, and her huge nipples jut out like thumbs. A large vibrator is jammed between spread open thighs and zip tied into place. Her head hangs over the edge of the bed, leaving her mouth hole completely exposed and vulnerable. The final touch is suction tubes to tease and torment those giant nipples and make them even bigger. The vibrator is flipped on, and it is go time.\n\nWe walk up and slam home that massive meat. Elise gurgles and gasps, the dick overwhelming her completely. The giant black cock stretches and fills her tiny mouth to the limit and beyond. She is full to the brim. The vibrator is pulling out orgasm after orgasm out of her overworked pussy, and the dick is tattooing its initials on her tonsils. Elise has become simply a limp fucktoy for our use. She is blasted out of her mind by the strict throat plowing and orgasms washing over her bound body. Deeper and deeper the dick is pounded home, all the way down that warm pink throat.\n\nWe rip off the suction tubes and keep on drilling. She moans and gasps. As her eyes glaze over and her stretched mouth hole goes slack, we pump a few more thrusts in. The job is done. Elise is a wrecked, spent shell. Her tiny pale limbs twitch helplessly under the zip ties. Drool flows out of her well fucked face pussy. We leave the vibrator on as we walk away. Elise keeps coming. She simply can not help it. What a good little fucktoy. \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/02_19egraves2/SexuallyBroken-Elise-Graves-Elise-Graves-takes-on-10-inch-BBC-brutally-deep-throated-without-mercy-massive-multiple-orgasms.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/02_19egraves2/SexuallyBroken-Elise-Graves-Elise-Graves-takes-on-10-inch-BBC-brutally-deep-throated-without-mercy-massive-multiple-orgasms.php&lt;/a&gt;\n\n13 000 uploads and counting, 14k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:8e34b1ded93776cdc5f1a9c553987ba73c23f58d","amp;dn":"Sexually+Broken--Elise+Graves+takes+on+10+inch+BBC%2C+brutally+dee","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e34b1ded93776cdc5f1a9c553987ba73c23f58d","infoHashBuffer":{"type":"Buffer","data":[142,52,177,222,217,55,118,205,197,241,169,197,83,152,123,167,60,35,245,141]},"announce":[],"urlList":[]}}