{"title":"Crashing (2007)[dvdrip]","uid":4608131,"size":722916955,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8ec45911fab170168b12e0b253fd681416795bab&amp;dn=Crashing+%282007%29%5Bdvdrip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"charliesx","files":3,"time":1230541348,"description":"\n\nUser Rating: 5.4/10   108 votes\n\nGenre:  drama\n\nA writer suffering from a creative block stumbles into a situation most middle-aged man would envy in this independent comedy-drama from writer and director Gary Walkow. Richard McMurray (Campbell Scott) is a novelist who enjoyed overnight success with the publication of his first book, The Trouble With Dick. Seven years later, Richard is working on his second novel but hates the story more with each passing day, while his marriage to a well-known actress is falling apart. Richard agrees to speak to the class of Diane (Alex Kingston), his former girlfriend who teaches a college literature course and inspired on of his novel's main characters. Spending the day with Diane is the last straw for Richard's wife, and she kicks him out of the house. During his lecture to the class, Richard comes clean about the sad state of his marriage and the fact he has no place to stay that night, and afterward one of the students, Kristin (Izabella Miko), offers Richard the use of the couch at her apartment. Jacqueline (Lizzy Caplan), Kristin's flatmate, is agreeable to Richard's presence, and offers a deal -- both Kristin and Jacqueline are aspiring writers, and in exchange for tutoring and &quot;literary consultation,&quot; he's welcome to stay as long as he pleases. Before long, Richard's consultations with his new charges begin taking place in the bedroom, and Jacqueline informs him that she wants him to help her write a sexy novel that will help her become &quot;the post-modern Jacqueline Suzanne.&quot; While Richard enjoys the ongoing mÃƒÂ©nage et trios at first, it doesn't take long for matters to become difficult and even dangerous. A sequel of sorts to Gary Walkow's first feature (called The Trouble With Dick), Crashing also features David Cross and Stephen Gyllenhaal. ","torrent":{"xt":"urn:btih:8ec45911fab170168b12e0b253fd681416795bab","amp;dn":"Crashing+%282007%29%5Bdvdrip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ec45911fab170168b12e0b253fd681416795bab","infoHashBuffer":{"type":"Buffer","data":[142,196,89,17,250,177,112,22,139,18,224,178,83,253,104,20,22,121,91,171]},"announce":[],"urlList":[]}}