{"title":"Bruce Springsteen - Dancing In The Dark","uid":4675211,"size":138842116,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8f88f11e16ca4c8931414281cd9f488f85956ba2&amp;dn=Bruce+Springsteen+-+Dancing+In+The+Dark&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":-1,"time":1232880872,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Dancing in the Dark&quot; is a 1984 song, written and performed by American rock singer Bruce Springsteen. Adding up-tempo synthesizer riffs and some syncopation to his sound for the first time, it became his biggest hit and, as the first single released from Born in the U.S.A., started it off to becoming the best-selling album of Springsteen's career.\n\nThe Brian DePalma-directed video, set at a live performance, is perhaps best remembered for the appearance of Courteney Cox as a fan who is invited on stage by Springsteen, and dances with him. Cox was subsequently cast in Misfits of Science and Family Ties, and would later go on to be one of the stars of NBC's hit sit-com Friends. Although Cox had previously appeared in television commercials and had other roles, it is thought that her part in the video played a large role in launching her career.\n\nThe video was filmed in June 1984 at the St. Paul Civic Center in St. Paul, Minnesota, before and during the initial show of the Born in the U.S.A. Tour. The completed video was first aired on MTV on July 10, 1984. It received heavy airplay on MTV, and thus helped introduce Springsteen's music to a new, younger, and wider audience.\n\n&quot;Dancing in the Dark&quot; was the last song written and recorded for Born in the U.S.A. Springsteen's producer and manager Jon Landau liked the album but wanted a sure-fire first single, one that was fresh and directly relevant to Springsteen's current state of mind (as much of Born in the U.S.A. had been written two years earlier). Landau and Springsteen got into an argument, but later on Springsteen wrote &quot;Dancing in the Dark&quot;, and his irked mood from the day's argument combined with the frustrations at trying to complete the album quickly poured out into the lyrics.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:8f88f11e16ca4c8931414281cd9f488f85956ba2","amp;dn":"Bruce+Springsteen+-+Dancing+In+The+Dark","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f88f11e16ca4c8931414281cd9f488f85956ba2","infoHashBuffer":{"type":"Buffer","data":[143,136,241,30,22,202,76,137,49,65,66,129,205,159,72,143,133,149,107,162]},"announce":[],"urlList":[]}}