{"title":"Microsoft Windows Vista Ultimate","uid":4100995,"size":3748223133,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:90b3d83567c8fdb3e79bba73e15d14d9382e39f5&amp;dn=Microsoft+Windows+Vista+Ultimate&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"darklord69","files":2,"time":1206574033,"description":"This is a no bullshit release of Microsoft Windows Vista! Works 100% guaranteed! No authorization, registration or activation required!!!!\n\nShell &amp; User interface\n\n[edit] Windows Aero\nWindows Vista uses the Windows Aero graphical user interface.\nWindows Vista uses the Windows Aero graphical user interface.\n\n    Main article: Windows Aero\n\nPremium editions of Windows Vista include a redesigned user interface and visual style, named Windows Aero (Authentic, Energetic, Reflective and Open). Aero is intended to be cleaner and more aesthetically pleasing than previous Windows versions, including glass-like transparencies, window animations and eye candy. Windows Aero also features a new default font (Segoe UI) with a slightly larger size, a streamlined style for wizards, and a change in the tone and phrasing of most of the dialogs and control panels.\n\nIn addition to the Windows Aero visual style, Windows Vista includes a &quot;Windows Vista Basic&quot; theme which does not use desktop composition, and is geared towards lower-end machines that are not able to use the Desktop Window Manager, and the &quot;Windows Classic&quot; and &quot;Windows Standard&quot; themes which are similar to the classic themes in Windows 2000 and Windows XP. Windows Aero is not available in Windows Vista Home Basic and Starter editions, although the Desktop Window Manager is included in Windows Vista Home Basic.\n\n[edit] Windows Explorer\n\n    Main article: Windows Explorer\n\n[edit] Layout and visualization\nA typical Windows Explorer window showing the Navigation Pane to the left, the Properties Pane at the bottom.\nA typical Windows Explorer window showing the Navigation Pane to the left, the Properties Pane at the bottom.\n\nWindows Explorer&amp;#039;s task pane has been removed, integrating the relevant task options into the toolbar. A Favorites pane on the left contains commonly accessed folders and prepopulated Search Folders. Seven different views are available to view files and folders, namely, List, Details, Small icons, Medium icons, Large icons, Extra large icons or Tiles. File and folder actions such as Cut, Copy, Paste, Undo, Redo, Delete, Rename and Properties are built into a dropdown menu which appears when the Organize button is clicked. It is also possible to change the layout of the Explorer window by using the Organize button. Users can select whether to display Classic Menus, a Search Pane, a Preview Pane, a Reading Pane, and/or the Navigation Pane. Document Properties are available from the common &amp;#039;Open&amp;#039; and &amp;#039;Save&amp;#039; dialog boxes, so it is easier to add metadata (such as author or subject) to a document. The metadata can be viewed and edited in the Properties Pane that shows up at the bottom of an Explorer window. The Navigation Pane contains a list of most common folders (the Favorites) for quick navigation. It can also show the folder layout of the entire hard drive or a subset of it. It can contain both real folders as well as virtual ones. By default it contains a links to folders such as Documents and the publicly shared folder, as well as virtual folders that search and present the saved virtual folders and that lists the recently changed documents. The Preview Pane can be used to preview the contents of a document, including viewing pictures in a size larger than the thumbnails shown in the folder listing, and sampling contents of a media file, without opening any additional program. Explorer can show a preview for any image format if the necessary codec authored using the Windows Imaging Component is installed. Also, if an application installs proper handlers for the preview pane (like Office 2007 does), then the documents can be edited in the preview pane itself.[1]\n\nWindows Explorer also contains modifications in the visualization of files on a computer. A new addition to Windows Explorer is the Details pane, which displays metadata and information relating to the currently selected file or folder. The Details pane will also display a graphical thumbnail of the file (known as live icon). Furthermore, different imagery is overlayed on thumbnails to give more information about the file, such as a picture frame around the thumbnail of an image file, or a filmstrip on a video file. Thumbnails can be zoomed on. The preview panel allows you to see thumbnails of all sorts of files and view the contents of documents, similar to the way you can preview email messages in Outlook, without opening the files.\n\nThe address bar has been modified to present a breadcrumbs view, which shows the full path to the current location. Clicking any location in the path hierarchy takes the user to that level, instead of repeatedly pressing the Back button. This is roughly analogous to what is possible prior to Windows Vista by pressing the small down-arrow next to &quot;Back&quot; and selecting any folder from a list of previously accessed folders. It is also possible to navigate to any subfolder of the current folder using the arrow to the right of the last item, or to click in the space to the right of this to copy or edit the path manually. As with many other Microsoft-made Windows Vista applications, the menu bar is hidden by default. Pressing the Alt key makes the menu bar appear. Free and used space on all drives is shown in horizontal indicator bars. Check boxes allow the selection of multiple files.\n\n[edit] Icons\n\nIcons in Windows Vista are visually more realistic than illustrative. Icons are scalable in size up to 256 x 256 (64 KB). Required icon sizes are 16 x 16, 32 x 32, and 256 x 256. Optional sizes are 24 x 24, 48 x 48, 64 x 64, 96 x 96, and 128 x 128. Document icons show the actual document contents and several media types are distinguished by icon overlays (video, audio, photos). The icons can be zoomed in and out using a gradual slider or by holding down the Ctrl key and using the mouse scroll wheel. To optimize and reduce the size of large icons, icons may be stored as compressed PNGs. To maintain backward compatibility with earlier versions of Windows, only larger sized icons can use lossless PNG compression.\n\n[edit] Organizing &amp; metadata\n\nWindows Explorer includes significant changes from previous versions of Windows in terms of organization, navigation, filtering, sorting, grouping and stacking. Combined with integrated desktop searching, Explorer allows users to find and organize their files in new ways, such as &quot;Stacks&quot;. The &quot;Stacks&quot; view groups files according to the criterion specified by the user. Stacks can be clicked to filter the files shown in Windows Explorer. Windows Explorer also sorts files on-the-fly automatically as they are renamed or pasted.\n\nThe Details pane also allows for the change of some textual metadata such as &amp;#039;Author&amp;#039; and &amp;#039;Title&amp;#039; in files that support them within Windows Explorer. A new type of metadata called tags allows users to add descriptive terms to documents for easier categorization and retrieval. Some files support open metadata, allowing users to define new types of metadata for their files. Out-of-the-box, Windows Vista supports Microsoft Office documents and most audio and video files. Metadata support for other file types can however be added by writing shell extensions. Unlike previous versions of Windows, all metadata is stored inside the file, so that it will always travel with the file. However, initially, users will be able to add metadata to only a few file types.[2]\n\n[edit] File operations\n\nIn Windows Vista, when moving or copying files, Windows Explorer displays the full source and destination path, size and number of items and the transfer speed in megabytes per second (MB/s). If a conflict or error is encountered, it does not terminate the copy or move operation. Rather, the file is skipped and the rest of the files processed. At the end of the operation, the errors are presented to the user with resolution options (if available). If two files have the same name, an option is available to rename the file; in previous versions of Windows, the only options were to either replace the destination file or cancel the process. The user can also choose to apply the same action to the further conflicts, if any.\n\nWhen renaming a file (when extensions are being displayed), Explorer only highlights the filename without selecting the extension.\n\nIn case a file is in use or &quot;locked&quot; by another application, Windows Explorer informs users to close the application and retry the file operation. Also, a new interface IFileIsInUse is introduced into the API which developers can use to let other applications switch to the main window of the application that has the file open or simply close the file from the &quot;File In Use&quot; dialog. [3] If the running application exposes these operations by means of the IFileIsInUse interface, Windows Explorer, upon encountering a locked file, allows the user to close the file or switch to the application from the dialog box itself.\n\n[edit] Start menu\n\n    Main article: Start menu\n\nThe Start Menu in Windows Vista. The Search Pane can be used to search not only the programs menu but the global search catalog as well.\nThe Start Menu in Windows Vista. The Search Pane can be used to search not only the programs menu but the global search catalog as well.\n\nIn Windows Vista, the Start Menu has undergone some significant changes. One of the chief additions is a Search box, where users may begin typing immediately. The contents of the Start menu itself are indexed and searchable, besides the global search index. If indexing is turned on, the search box returns results on-the-fly as users type into it. This allows the Start menu to act as a fast and powerful application launcher. The Start menu search also doubles as the Run command from previous versions of Windows; simply typing any command will execute it. The Run command can also be added separately to the right column in the Start menu.\n\nAnother major change to the Start menu in Windows Vista is that it no longer presents the All programs menu as a horizontally expanding cascading list which utilizes the entire screen space, but instead as a nested folder view with a fixed size. The list of submenus and single items appears over the left column contents with a Back button below it. Subfolders expand and collapse vertically within the list when single-clicked, in a tree-like fashion similar to Windows Explorer. Single items appear at the top and folders appear at the bottom. Hovering the mouse over a folder does not open it, the folder needs to be clicked. A limitation of the new Start menu is that subfolders inside the All Programs menu cannot be opened simply by searching or double clicking. Also, as more programs are installed, a vertical scroll bar appears between the two columns. A dynamically changing icon showing the user&amp;#039;s display picture by default is present at the top of the right column. It changes as users hover over any other item to reflect that item&amp;#039;s icon. The Power button&amp;#039;s action is configurable through Power options in the Control Panel. Users can quickly lock their user account by pressing the Lock button. Additional power and account related actions are listed in a sub-menu which appears when the small arrow next to the Lock button is clicked.\n\nLike Windows XP, Windows Vista allows users to switch back to the pre-Windows XP style &quot;Classic&quot; Start menu, however, the Search box is not present on the Classic Start menu.\n\n[edit] Default Programs\n\nA common issue in previous Windows versions was that competing applications doing common tasks each tried to associate themselves as the default for a certain file type using their own custom user interface. The default application information for a particular file type was stored in the registry on a per-machine basis, resulting in applications changing another user&amp;#039;s default program when one user&amp;#039;s defaults were changed and each application querying several different registry values when launched. In Windows Vista onwards, file type associations and protocol handlers can be set on a per-user basis using the new Default Programs API, meaning default programs for file types and tasks can be different for each individual user. There is an API for calling a common user interface so applications no longer need to maintain their own file association UI. The Default Programs API gives applications a programmatic way to check for and discover other default applications, restore a single or all registered defaults, query for the owner of a specific default file association/protocol, launch the Default Programs UI for a specific application or clear all per user associations. Applications only need to registered at install time to be part of Default Programs.\n\n[edit] Windows Flip and Flip 3D\nWindows Flip 3D\nWindows Flip 3D\nArabic\nArabic\nFrench\nFrench\n\nFor all Vista Premium Ready PCs, when using Alt+Tab to switch between open windows, a preview of each open window appears instead of just the program icon. In addition, Windows Flip 3D enables users to flip through a cascading stack of their open windows using the mouse scroll wheel. Windows can be stacked and rotated in 3D to provide views of all of them simultaneously. (The keyboard shortcuts are Win+Tab, which makes Flip 3D disappear after releasing, Ctrl+Win+Tab, which keeps Flip 3D visible after releasing, and Shift+Win+Tab to flip through open windows backward).[4] The window buttons on the taskbar show a thumbnail image of the window, when the mouse hovers over the button.\n\n[edit] Other shell improvements\n\n    * It is now possible to install and select non-English languages on a per-user basis which transforms the entire shell user interface and applications into Arabic, French, German, Japanese or Spanish from the next login. This feature is only available in the Enterprise and Ultimate editions of Windows Vista.\n\n    * JPEG files can be natively set as the desktop wallpaper without using Active Desktop (which is no longer supported).[5] Also, the aspect ratio of images is maintained properly while applying them as the desktop wallpaper.\n\n    * A new feature known as Previous Versions can revert the contents of any file to an arbitrary point in the past from the file&amp;#039;s Properties. The Previous Versions feature utilizes Shadow Copy, a storage backup technology introduced in Windows Server 2003.\n\n[edit] Windows Search\n\n    See also: Windows Search\n\nWindows Vista features system-wide integrated search, called Instant Search (also known as Windows Search).[6] Instant Search is designed to run significantly faster and offers more customized search capabilities. Search boxes have been added throughout the Explorer user interface, to the Start menu, Open/Save dialog boxes, and several of the applications included with Windows Vista. By default, Instant Search indexes only a small number of folders such as the start menu, the names of files opened, the Documents folder, and the user&amp;#039;s e-mail. Beyond searching for files, search works with Help, Control Panel, Networking, and more. In Control Panel, for example, typing &quot;firewall&quot; will instantly return all applets that have to do with the system firewall.[7]\nThe Search Explorer advanced search pane\nThe Search Explorer advanced search pane\n\nThe search engine uses indexing to allow for a quick display of results for a given search. Advanced options allow the user to choose the file type, how it should be indexed, the properties only, or the properties and the file contents. The Start menu search also doubles as the Run command from previous versions of Windows; simply typing any command will execute it. The indexed search platform is based on Microsoft&amp;#039;s Windows Desktop Search 3.0, allowing third-party applications (e.g. Microsoft Outlook 2007) to use the indexing platform to store metadata and perform searches on Windows Vista or Windows XP (with the Windows Desktop Search redistributable installed). This is in contrast to the search engine of Windows XP, which takes some time to display results, and only after the user has finished typing the search string. The Windows Vista search allows users to add multiple filters to continually refine search results (Such as &quot;File contains the word &amp;#039;example&amp;#039;&quot;). It is also possible to search across RSS and Atom feeds, straight from Windows Explorer. Windows search uses IFilters that are used by Windows Desktop Search as well. The IFilter interface can be implemented by software makers so that files created by their applications can be better integrated with search and indexing programs.\n\nSearching can also be done from the box at the bottom of the start menu, so it possible to start a program from here by typing its name, for example &quot;Calc&quot; to start the calculator, &quot;Word&quot; to start Microsoft Word, &quot;Mail&quot; to open Windows Mail, a web address to start the default browser at a particular site, the default search engine, or even a folder name, filename or network share name.\n\nThere is also the ability to save searches as a Search Folder where opening the folder will execute a specific search automatically and display the results as a normal folder. A search folder is just an XML file which stores the search query, including the search operators as well. When these files are accessed, the search is run with the saved query string and the results presented as a virtual folder. Windows Vista also supports query composition, where a saved search (called a scope) can be nested within the query string of another search.[8] These virtual folders are also distributable via RSS.\n\nWindows Vista also features an enhanced file content search for non-indexed locations, whereby the files being scanned are processed by the same IFilters that would be used for indexing, therefore offering more consistent results between indexed and non-indexed searches as well as the ability for third-parties to add support for additional file formats to have their content searched.\n\n[edit] Windows Sidebar\nWindows Gadgets\nWindows Gadgets\n\n    Main article: Windows Sidebar\n\nWindows Sidebar is a new panel which can be placed on either the left or the right-hand side of the screen where a user can place Desktop Gadgets, which are small applets designed for a specialized purpose (such as displaying the weather or sports scores). The gadgets can also be placed on other parts of the desktop, if desired, by dragging. By default, Windows Vista ships with thirteen gadgets: Calculator, Clock, CPU Meter, Currency Conversion, Feed Viewer, Feed Watcher, Notes, Number Puzzle, Picture Puzzle, Recycle Bin, Slide Show, Stocks, and an egg timer. Additional gadgets are published at Microsoft&amp;#039;s web site, which offers both Microsoft-created and user-submitted gadgets in a gallery.\n\nGadgets are written using a combination of DHTML for visual layout, JScript and VBScript for functional code, and an XML file for defining the gadget&amp;#039;s metadata (author name, description, etc.) The gadget is then distributed as a ZIP file with a .gadget extension. Displaying the gadget using DHTML allows the same gadget to be used on Microsoft&amp;#039;s Live.com and Windows Live Spaces sites. Alternatively, on Windows Vista, the gadget can detect that WPF is available and take advantage of its graphical abilities to display in a different way from the web.\n\n[edit] New and upgraded applications\nWindows Calendar\nWindows Calendar\nPaint\nPaint\n\n    * Windows Mail replaces Outlook Express, the email client in previous Windows versions. It has the Phishing Filter like IE7 and a Bayesian junk mail filtering, which is updated monthly via Windows Update. Also, e-mail messages are now stored as individual files rather than in a binary database to reduce frequent corruption and make messages searchable in real-time. Backing up and restoring account setup information, configuration and mail store is now made easier. It does however omit some features of Outlook Express , such as a &quot;Block sender&quot; for Usenet access. Windows Mail is itself being replaced with Windows Live Mail.\n    * Windows Contacts, a new unified contact and personal information management application, replaces Windows Address Book (WAB). It is based on a new XML based propriety file format where each contact appears as an individual .contact file, and features extensibility APIs for integration with other applications. It can store custom information related to contacts, including display pictures. The legacy *.wab format and the open standard *.vcf (vCard) and *.csv (Comma separated values) file formats are also supported.\n    * Windows Calendar is the new calendar application that is included in Windows Vista. It supports the popular iCalendar format as well as sharing, subscribing and publishing of calendars on WebDAV-enabled web servers and network shares.\n    * Windows Fax and Scan is an integrated faxing and scanning application. With this users can send and receive faxes, fax or email scanned documents and forward faxes as email attachments from the computer. It replaces (or enhances) the &amp;#039;Fax Services&amp;#039; component which was available as an optional component in Windows XP. It is available by default in the Ultimate edition and is also available in the Business and Enterprise editions. By connecting a scanner and a fax-capable modem to the computer, users can preview documents before scanning them and can choose to directly fax or email the scanned documents. The user interface resembles that of &amp;#039;Windows Mail&amp;#039; with preview pane, tree views etc.\n    * Windows Meeting Space, the replacement for NetMeeting, is a peer-to-peer (p2p) collaboration application. Users can share applications (or their entire desktop) with other users on the local network, or over the Internet. Windows Meeting Space allows sharing of the desktop with other co-workers, distribution and collaborative editing of documents, and passing notes to other participants. Windows Meeting Space automatically finds other users using People Near Me, a technology that uses WS-Discovery to see other users on a local network.\n    * Paint has new features such as a crop function and the undo limit has been raised from 3 to 10.\n    * WordPad now supports the Text Services Framework, using which Windows Speech Recognition is implemented. Therefore, it is possible to dictate text in WordPad, and similar other applications which support RichEdit.\n    * Sound Recorder has been rewritten and now supports recording clips of any length and saving them as WMA. However, saving to WAV format is not supported except in the N editions of Windows Vista.\n\nSnipping Tool\nSnipping Tool\n\n    * Snipping Tool, first introduced in Experience Pack for Windows XP Tablet PC Edition 2005, is a screen-capture tool that allows for taking screen shots (called snips) of windows, rectangular areas, or free-form areas. Snips can then be annotated, saved (as an image file or HTML page), or e-mailed.\n    * The Magnifier accessibility tool uses WPF, which in turn uses vector images to render the content. As a result, the rendered magnified image is sharp and not pixelated.[9] However, this applies only to WPF applications. Non-WPF applications are still magnified the traditional way. Microsoft has also released a Magnification API to allow assistive technology applications to use the Magnifier engine. [10]\n\nWindows Photo Gallery\nWindows Photo Gallery\n\n    * Windows Photo Gallery, a photo and video library management application. It can import from digital cameras, tag and rate individual pictures including custom metadata. It also allows basic editing of images, such as adjusting color and exposure, resizing, cropping, red-eye reduction and printing. Slideshows, with pan, fade and other effects, can also be created, and burnt to DVD. It allows custom metadata to be added to images and videos, and enables searching by the attributes. It also supports RAW images natively and can open and organize any image format for which image codecs are installed in the Windows Imaging Component. Images, and videos too, may be viewed in the Windows Photo Gallery Viewer with options to zoom, pan and losslessly rotate images; pause or play videos; and bring up the Info pane to view and edit metadata about a photo or a video. ICC V4 color profiles embedded in images are also supported. The Photo Print Wizard has been improved to offer a lot of customizability.\n    * Windows Movie Maker supports editing and outputting HD video, as well as burning the output movie on a CD. The ability to burn to a DVD requires the Windows DVD Maker add-on (Home Premium &amp; Ultimate only). DVR-MS videos can now be edited with Windows Movie Maker. Some new effects and transitions have been added and the transitions are now smoother. All Windows Vista Movie Maker versions require pixel shader hardware support.\n    * Windows DVD Maker, a DVD creation application. Applications can also pass an XML file to DVD maker for authoring and burning.\n    * Games: Minesweeper, Solitaire, Hearts, FreeCell and Spider Solitaire have been updated and rewritten to take advantage of Windows Vista&amp;#039;s new graphics capabilities. Also included are new games, namely, Purble Place, Chess Titans and Mahjong Titans. InkBall, a game previously available only with Windows XP Tablet PC Edition, has been included and can also be played using a mouse. Pinball has been dropped. As of the consumer launch of 30th January 2007, users of the Ultimate edition of Windows Vista can also download Texas Hold &amp;#039;Em Poker as an Ultimate Extra.\n\n[edit] Windows Internet Explorer 7\nWindows Internet Explorer 7\nWindows Internet Explorer 7\n\n    Main articles: Internet Explorer and Internet Explorer 7\n\nWindows Vista includes the latest version of Internet Explorer, which adds support for tabbed browsing, Atom, RSS, internationalized domain names, a search box, a phishing filter, an anti-spoofing URL engine, fine-grained control over ActiveX add-ons, thumbnails of all open tabs in a single window (called Quick Tabs), page zoom, and tab groups. Tab groups make it possible to open a folder of Favorites in tabs with a single click. Importing bookmarks and cookies from other web browsers is also supported. Additionally, there is now proper support for PNG images with transparency as well as improvements and fixes to CSS and HTML rendering. The Windows RSS Platform offers native RSS support, with developer APIs.\n\nOn Windows Vista, Internet Explorer operates in a special &quot;Protected Mode&quot;, which runs the browser in a security sandbox that has no access to the rest of the operating system or file system, except the Temporary Internet Files folder. This feature aims to mitigate problems whereby newly-discovered flaws in the browser (or in ActiveX controls hosted inside it) allowed hackers to subversively install software on the user&amp;#039;s computer (typically spyware).[11][12]\n\nInternet Explorer 7 additionally features an update to the WinInet API. The new version has better support for IPv6, and handles hexadecimal literals in the IPv6 address. It also includes better support for Gzip and deflate compression, so that communication with a web server can be compressed and thus will require less data to be transferred.[13][14] Internet Explorer Protected Mode support in WinInet is exclusive to Windows Vista.\n\n[edit] Windows Media Player 11\nWindows Media Player 11\nWindows Media Player 11\n\n    Main article: Windows Media Player\n\nWindows Media Player 11, which is also available on Windows XP, features a fully revamped interface. Windows Media Player 11 in Windows Vista Home Premium and Ultimate Editions natively supports playback of HD DVD. Specifically, Windows Vista supports the MMC-5 commands, the driver commands for the AACS content protection scheme, as well as the UDF file system. Windows Vista Home Premium and Ultimate Editions also natively include the VC-1 and the MPEG-2 video decoders, as well as the Dolby Digital (AC-3) 5.1 audio decoder. H.264 video and other multichannel surround sound audio standards still require third party decoders.[15][16] Blu-ray Disc playback also requires third-party components to be installed. The Media Library is now presented without the category trees which were prominent in the earlier versions. Rather, on selecting the category in the left pane, the contents appear on the right, in a graphical manner with thumbnails ? a stark departure from textual presentation of information. Search has been upgraded to be much faster.\n\nOther features of Windows Media Player 11 include:\n\n    * Stacking - Stacking allows graphical viewing of how many albums exist in a specific category of music. The pile appears larger as the category contains more albums.\n    * Media Sharing - which allows one to share their Media library and make it accessible to other PCs running Windows Vista, Xbox 360, or networked Media Receivers.\n    * Word Wheel - Searches and displays results as characters are being entered, without waiting for Enter key to be hit. Results are refined based on further characters that are typed.\n    * CD Burning - CD burning now shows a graphical bar showing how much space will be used on the disc.\n    * URGE - The new music store from Microsoft and MTV networks is integrated with the player. As of October 28, 2007, the URGE service was discontinued when it merged with Rhapsody; the link in WMP11 remains but is no longer functional. In order to use Rhapsody, a separate download is required.\n    * Global Status - Global status shows a broad overview of what the player is doing. The information presented include status information regarding buffering, ripping, burning and synchronization.\n    * RSS feed support through the integrated feed store that comes with Internet Explorer 7.\n\nWindows Media Player 11 for Windows Vista is a superset of features of what is in the version for previous Windows versions.[17]\n\n[edit] Windows Media Center\nWindows Media Center\nWindows Media Center\n\n    Main article: Windows Media Center\n\nMedia Center in Windows Vista, available in the Home Premium and Ultimate editions, has been upgraded significantly, including a considerable overhaul of the user interface. Each button in the main menu, which contains sections such as &quot;Music&quot;, &quot;Videos&quot;, and &quot;TV&quot;, gets encased in a box when selected, and for each selection, a submenu comes up, extending horizontally. When any of the options is selected, the entries for each are presented in a grid-like structure, with each item being identified by album art, if its an audio file, or a thumbnail image if it is a picture, a video or a TV recording, and other related options, such as different views for the music collection if &quot;Music&quot; is selected, extend horizontally along the top of the grid. Similarly, other items are identified by suggestive artwork. The grid displaying the items is also extended horizontally, and the selected item is enlarged compared to the rest. Other features of Windows Media Center include:\n\n    * Support for two dual-tuner cards\n    * Native DVD/MPEG-2 support\n    * Addition of Movies and DVD button which lists all the movies on the hard drive and DVD.\n    * Tasks button that provides access to jobs such as setting up and configuring a media center extender device.\n    * Any video playing is overlaid on the background of the user interface, if the UI is navigated while the video is still playing.\n    * Support for high-definition (HD) content, and CableCARD support.\n    * Uses the .NET 2.0 CLR\n\n[edit] Internet Information Services 7\nIIS 7&amp;#039;s redesigned management console\nIIS 7&amp;#039;s redesigned management console\n\n    Main article: Internet Information Services\n\nWindows Vista includes Internet Information Services (IIS) version 7, which has been refactored into a modular architecture, with integrated .NET extensibility. Instead of a monolithic server which features all services, IIS 7 has a core web server engine, and modules offering specific functionality can be added to the engine to enable its features. Writing extensions to IIS 7 using ISAPI has been deprecated in favor of the module API. Much of IIS&amp;#039;s own functionality is built on this API, and as such, developers will have much more control over a request process than was possible in prior versions.\n\nA significant change from previous versions of IIS is that all web server configuration information is stored solely in XML configuration files, instead of in the metabase. The server has a global configuration file that provides defaults, and each virtual web&amp;#039;s document root (and any subdirectory thereof) may contain a web.config containing settings that augment or override the defaults. Changes to these files take effect immediately. This marks a significant departure from previous versions whereby web interfaces, or machine administrator access, was required to change simple settings such as default document, active modules, and security/authentication.\n\nIIS 7 also features a completely rewritten administration interface that takes advantage of modern MMC features such as task panes and asynchronous operation. Configuration of ASP.NET is more fully integrated into the administrative interface.\n\nPrevious versions of IIS included with Windows XP had hard limits on concurrent connections and defined web servers; IIS 7.0 on Windows Vista will not limit the number of connections allowed but will limit workloads based on the active concurrent requests to 10.\n\n[edit] Security and safety\n\n    Main article: Security and safety features new to Windows Vista\n\nBeginning in early 2002 with Microsoft&amp;#039;s announcement of their Trustworthy Computing initiative, a great deal of work has gone into making Windows Vista a more secure operating system than its predecessors. Internally, Microsoft adopted a &quot;Secure Development Lifecycle&quot;[18] with the underlying ethos of, &quot;Secure by design, secure by default, secure in deployment&quot;. New code for Windows Vista was developed with the SDL methodology, and all existing code was reviewed and refactored to improve security.\n\nSome of the most significant and most discussed security features included with Windows Vista include User Account Control, Kernel Patch Protection, BitLocker Drive Encryption, Mandatory Integrity Control, Digital Rights Management, TCP/IP stack security improvements, Address Space Layout Randomization and the EFS and cryptography improvements. Additionally, Windows Vista includes a range of parental controls, which give owners of a computer a set of tools to limit what other accounts on a computer can do, and an improved Windows Firewall which supports both inbound and outbound packet filtering, IPv6 connection filtering and more detailed configurable rules and policies.\n\n[edit] Management and administration\n\n    Main article: Management features new to Windows Vista\n\nWindows Vista contains a range of new technologies and features that are intended to help network administrators and power users better manage their systems. Notable changes include a complete replacement of the &quot;Windows Setup&quot; process based on Windows Preinstallation Environment (WinPE), completely rewritten image-based deployment mechanisms, a significantly improved Task Scheduler, a revamped eventing infrastructure, GUI recovery tools, support for per-application Remote Desktop sessions, new diagnostic, health monitoring and system administration tools, and a range of new Group Policy settings covering many of the new features.\n\n[edit] Graphics\n\n[edit] Desktop Window Manager\n\n    Main article: Desktop Window Manager\n\nThe Desktop Window Manager is the new windowing system which handles the drawing of all content to the screen. Instead of windows drawing directly to the video card&amp;#039;s memory buffers, contents are instead rendered to back-buffers (technically Direct3D surfaces), which are then arranged in the appropriate Z-order, then displayed to the user. This drawing method uses significantly more video memory than the traditional window-drawing method used in previous versions of Windows, which only required enough memory to contain the composite of all currently visible windows at any given time. With the entire contents of windows being stored in video memory, a user can move windows around the screen smoothly, without having &quot;tearing&quot; artifacts be visible while the operating system asks applications to redraw the newly visible parts of their windows. Other features new to Windows Vista such as live thumbnail window previews and Flip 3D are implemented through the DWM.\n\nUsers need to have a DirectX 9 capable video card to be able to use the Desktop Window Manager. Machines that can&amp;#039;t use the DWM fall back to a &quot;Basic&quot; theme, and use screen drawing methods similar to Windows XP.\n\nThe Desktop Window Manager (DWM) is included in all editions of Windows Vista except the Starter edition.\n\n[edit] DirectX\n\n    Main article: Direct3D\n\nWindows Vista includes a new version of Direct3D, called Direct3D 10. It adds scheduling and memory virtualization capabilities to the graphics subsystem and foregoes the current DirectX practice of using &quot;capability bits&quot; to indicate which features are active on the current hardware. Instead, Direct3D 10 defines a minimum standard of hardware capabilities which must be supported for a display system to be &quot;Direct3D 10 compatible&quot;. Microsoft&amp;#039;s goal is to create an environment for developers and designers where they can be assured that the input they provide will be rendered in exactly the same fashion on all supported graphics cards. This has been a recurring problem with the DirectX 9 model, where different video cards have produced different results, thus requiring fixes keyed to specific cards to be produced by developers.\n\nAccording to Microsoft, Direct3D 10 will be able to display some graphics up to 8 times faster than DirectX 9.0c because of the new improved Windows Display Driver Model. In addition, Direct3D 10 incorporates Microsoft&amp;#039;s High Level Shader Language 4.0. However, Direct3D 10 is not backward compatible like prior versions of DirectX. The same game will not be compatible with both Direct3D 10 and Direct3D 9 or below. Games would need to be developed for both APIs, one version for Direct3D 9 and below if targeting Windows versions prior to Windows Vista and another version using Direct3D 10 if targeting only Windows Vista. Windows Vista does, however, contain a backward compatible Direct3D 9 implementation.\n\nThe Direct3D 10 API introduces unified vertex and pixel shaders. In addition, it also supports Geometry Shaders, which operate on entire geometric primitives (points, lines, and triangles), and can allow calculations based on adjacent primitives as well. The output of the geometry shader can be passed directly onwards to the rasterizer for interpolation and pixel shading, or written to a vertex buffer (known as &amp;#039;stream out&amp;#039;) to be fed back into the beginning of the pipeline.\n\nD3D10 functionality requires WDDM (Windows Display Driver Model) and new graphics hardware. The graphics hardware will be pre-emptively multithreaded, to allow multiple threads to use the GPU in turns. It will also provide paging of the graphics memory.\n\nThe version of Direct3D 9 available in Windows Vista is called Direct3D 9Ex. This modified API also uses the WDDM and allows Direct3D 9 applications to access some of the features available in Windows Vista such as cross-process shared surfaces, managed graphics memory, prioritization of resources, text anti-aliasing, advanced gamma functions, and device removal management.\n\nDeprecation of other DirectX APIs:\n\nIn Windows Vista, only Direct3D features an overhaul. The DirectX SDK mentions that most of the other APIs have been deprecated. DirectInput and DirectPlay have been deprecated. DirectSound lacks hardware abstraction and is emulated in software. Only DirectMusic has been included intact.\n\n[edit] Imaging\n\n    Main articles: Windows Imaging Component and HD Photo\n\nWindows Imaging Component (WIC) is a new extensible imaging framework that allows applications supporting the framework to automatically get support of installed codecs for graphics file formats. Windows Presentation Foundation applications also automatically support the installed image codecs. Third party developers can write their own image codecs for their specific image file formats. By default, Windows Vista ships with the JPEG, TIFF, GIF, PNG, BMP and HD Photo codecs. Codecs for RAW image formats used generally by high-end digital cameras are also supported in this manner. Windows Explorer, Windows Photo Gallery and Windows Photo Gallery Viewer are based on this new framework and can thus view and export images in any format for which the necessary codecs are installed.\n\nHD Photo (previously known as Windows Media Photo)[19] is a photographic still image file format, that is introduced with Windows Vista. It supports features such as high dynamic range imaging, lossy as well as lossless compression, up to 32-bpp fixed or floating point representation, transparency, RGB, CMYK and n-channel color spaces, Radiance RGBE, embedded ICC color profiles, multiple images per file and support for Exif and XMP metadata formats. It is the preferred image format for XPS documents.\n\n[edit] Color management\n\n    Main article: Windows Color System\n\nWindows Vista features Windows Color System (WCS),[20] a platform for color management. Its goal is to obtain color consistency across various software and hardware, including cameras, monitors, printers and scanners. Different devices interpret the same colors differently, according to their software and hardware configurations. As a result, they must be properly calibrated to reproduce colors consistently across different devices. WCS aims to make this process of color calibration automatic and transparent, as an evolution of ICC Color Profiles.\n\nWindows Color System is based on a completely new Color Infrastructure and Translation Engine (CITE). It is backed up by a new color processing pipeline that supports bit-depths more than 32 bits per pixel, multiple color channels (more than 3), alternative color spaces and high dynamic range coloring, using a technology named Kyuanos[21] developed by Canon. The color processing pipeline allows device developers to add their own gamut mapping algorithm into the pipeline to customize the color response of the device. The new pipeline also uses floating point calculations to minimize round-off losses, which are inherent in integer processing. Once the color pipeline finishes processing the colors, the CITE engine applies a color transform according to a color profile, specific to a device to ensure the output color matches to what is expected.\n\nWCS features explicit support for LCD as well as CRT monitors, projectors, printers, and other imaging devices and provides customized support for each. WCS uses color profiles according to the CIE Color Appearance Model recommendation (CIECAM02), defined using XML, to define how the color representation actually translates to a visible color. ICC V4 color profiles are also supported. Windows Photo Gallery and Photo Viewer, Windows Imaging Component, the HD Photo format, XPS print path and XPS documents all support color management.\n\n[edit] Mobile computing\n\nSome significant changes have been made to Windows Vista for mobile computing.\n\n[edit] Power management\n\nIn Windows Vista, a Sleep power state replaces Standby mode and is active by default. When chosen, this new &quot;Sleep&quot; mode saves information from the computer&amp;#039;s memory to the hibernation file on disk, but instead of turning off the computer, it simultaneously enters Standby mode. After the specified amount of time, it shuts down (hibernates). If power is lost during Standby mode, the system resumes from the existing hibernate image on disk. Sleep mode, thus, offers the benefits of fast suspend and resume when in Standby mode and relatively faster resuming and reliability when resuming from hibernation instead of a complete reboot, in case of power loss.\n\nAlso, in earlier Windows versions, drivers sometimes prevented Windows from entering or reliably resuming from a power-saving state. This problem has been solved in Windows Vista. Applications can disable sleep idle timers when needed such as when burning discs or recording media. Away mode, which is not a power plan by itself but a feature, automatically turns off displays, video rendering and sound but keeps the computer working when the user is away from the computer. Optionally, it can also switch to sleep mode. Advanced power settings can be configured using the Control Panel. Power settings are also configurable through Group Policy.\n\nThe battery icon in the notification area has been improved to let the user more easily select a &quot;Power plan&quot;. &quot;Presentation Settings&quot;, through the Transient Multimon Manager (TMM), allow saving of display preferences when an external display such as a projector or external monitor is connected. The setting can be restored when the same device is re-connected later. Presentation settings are available only on mobile computers.\n\n[edit] Other mobility enhancements\nScreenshot of the new Windows Mobility Center control panel.\nScreenshot of the new Windows Mobility Center control panel.\n\n    * Windows Mobility Center is a new control panel available only on mobile computers that centralizes relevant information and configuration. It is extensible so that hardware manufacturers can add further capabilities to control other features specific to their hardware.\n    * Windows Mobile Device Center centralizes management of external mobile devices. It includes a basic RNDIS driver to make simple connections to mobile devices. For complete functionality including synchronization of tasks, calendar data, contacts, email etc. with Microsoft Office Outlook, a driver needs to be downloaded. [22] Synchronization with Windows Mail, Windows Calendar or Windows Contacts is not supported. Whenever a Windows Mobile device is connected, the Mobile Device Center pane pops up giving options to manage media and other files on the device, as well as control their settings.\n    * A new Windows Portable Devices API has been introduced to communicate with attached media and all portable devices such as mobile phones, portable media players, PDAs etc.\n    * Sync Center is a centralized location which provides an organized summary view of any sync partnership users have created for synchronizing data and files, such as mobile devices, network syncing (offline files), portable media devices and so on. While the earlier promised ability to automatically synchronize files among computers using peer-to-peer technology is not included,[23] a powertoy, SyncToy, is available that supports synchronizing local and network files.[24]\n    * Windows SideShow is a new technology that lets Windows Vista drive a small external display that is built into the outside of a mobile PC&amp;#039;s lid. The display can be updated with a number of different kinds of information, such as contacts, maps, calendar, and email. This can then be consulted while the mobile PC is otherwise powered down.[25]\n    * All the features from Windows XP Tablet PC Edition have been included. There is intrinsic support for handwriting and ink, via the Ink Analysis API.[26] A new control, the InkCanvas is made available by the API to add ink support to applications. Ink support can not only recognize handwriting and formatting, but also hand-drawn shapes which are converted to vector-graphics, rendered as the shape that was intended to be drawn. [27] An update for Windows XP Tablet PC Edition containing Ink Analysis and StylusInput API support is also available. [28] Support for touchscreens is also included.\n","torrent":{"xt":"urn:btih:90b3d83567c8fdb3e79bba73e15d14d9382e39f5","amp;dn":"Microsoft+Windows+Vista+Ultimate","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90b3d83567c8fdb3e79bba73e15d14d9382e39f5","infoHashBuffer":{"type":"Buffer","data":[144,179,216,53,103,200,253,179,231,155,186,115,225,93,20,217,56,46,57,245]},"announce":[],"urlList":[]}}