{"title":"King Charles - LoveBlood [2012] [FLAC]","uid":8209034,"size":285702756,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:91d1a37655be2e2c281778e194e63bb278f1c513&amp;dn=King+Charles+-+LoveBlood+%5B2012%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":14,"time":1362189145,"description":"Artist: Release: LoveBlood\nMusicBrainz: 4b05fcd9-05be-4563-8b76-8b33cbbde840\nReleased: 2012-05-08\nLabel: Universal Records\nCountry: US\n\nTracklisting:\n\n01. LoveBlood (02:44)\n02. Mississippi Isabel (03:03)\n03. Bam Bam (02:55)\n04. Love Lust (02:58)\n05. Polar Bear (04:31)\n06. Lady Percy (03:19)\n07. Ivory Road (03:56)\n08. The Brightest Lights (03:36)\n09. Beating Hearts (03:54)\n10. Coco Chitty (03:25)\n11. Wilde Love (03:40)\n\n\nDressed in bouffant dreadlocks, Snidely Whiplash mustache, and a bootcase of frilly pirate blouses, London-based indie rocker Charles Costa (aka King Charles) comes off as a kind of latter-day Adam Ant on his 2012 debut, Loveblood. However, where Adam Ant pillaged the punk rock sound of '80s London, King Charles is a frothier regent with an ear for the campy '70s glitter-synth of Sparks combined with the indie Afro-pop meets neo-new wave of Vampire Weekend. Musically, Loveblood is an elaborately produced affair with a generous amount of orchestral sounds, as well as acoustic and percussion instruments dressing up the overall driving electronic and indie folk-rock vibe. And though he clearly aspires to the royal rock heights of Freddie Mercury, King Charles is less Queen and more Mumford &amp; Sons on Loveblood. Songs like the jaunty leadoff title track and the '50s doo wop meets &quot;hooked on the classics&quot;-style disco number &quot;Bam Bam&quot; are exuberantly batty, eminently hummable ditties that showcase King Charles' knack for laconic crooning and bodice-ripping romantic lyrics like &quot;I will build a towering pyre of passion built by my desire.&quot; Similarly engaging tracks like the tropical island steel drum fantasy &quot;Lady Percy,&quot; in which King Charles coos &quot;Oh, I know Lady Percy will never come to my show/Up in the highlands racing cars, building guns, and breaking hearts,&quot; and the anthemic banjo-driven country-rocker &quot;The Brightest Lights&quot; are sparkling, foot-tapping numbers that blithely play up Charles' lordly hedonistic persona. Ultimately, while King Charles' moniker would indicate he's crowned himself Lord of the Pop Manor, in truth, he's seated a bit further down the line from the throne. That turns out to be a good thing for the vocalist, who's clearly cut out for making silly, romantic, and catchy music that's not exactly what you would call &quot;regal.&quot;","torrent":{"xt":"urn:btih:91d1a37655be2e2c281778e194e63bb278f1c513","amp;dn":"King+Charles+-+LoveBlood+%5B2012%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91d1a37655be2e2c281778e194e63bb278f1c513","infoHashBuffer":{"type":"Buffer","data":[145,209,163,118,85,190,46,44,40,23,120,225,148,230,59,178,120,241,197,19]},"announce":[],"urlList":[]}}