{"title":"Sordid Lives: The Series - S01E01","uid":4333706,"size":337491998,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:91dada7b74697d650adb58cbd32c53c684291db5&amp;dn=Sordid+Lives%3A+The+Series+-+S01E01&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ksbnet","files":1,"time":1218187430,"description":"Sordid Lives - The Series - S01E02\n\nSeason 1 Episode 1\n\nName: The Day Tammy Wynette Died (1)\n\nLatrelle and LaVonda search for Peggy, who went to get Bitsy Mae out of prison; Brother Boy is upset by the news that his idol, Tammy Wynette died; Nolete confides in Sissy about her sexual problems with her husband; Ty sees a therapist and prepares to audition for a nude musical.\n\n\n-------------------------------------\n\n\nSordid Lives: The Series (created, written and directed by Del Shores) is the story of a small town Texas family presided over by matriarch Peggy Ingram (Rue McClanahan) who takes in the town bar singer Bitsy Mae Harling (Olivia Newton-John) who has just been released from prison. Peggy's wild child daughter LaVonda (Ann Walker) lives with Peggy's chain-smoking sister Sissy (Beth Grant), while Peggy's good girl Latrelle (Bonnie Bedelia) maintains an image of seeming perfection.\n\nThe series is based on the 2000 film Sordid Lives, also by Del Shores, and shares many cast members reprising their roles.\n\nPeggy's third child &quot;Brother Boy&quot; Ingram (Leslie Jordan) is locked in a mental institution where he performs as Tammy Wynette. He plots to escape while he attends therapy sessions with the crazy Dr. Eve (Rosemary Alexander) who believes she can dehomosexualize him.\n\nLaVonda's white trash best friend Noleta (Caroline Rhea) lives in a trailer in Sissy's backyard with her husband G.W. (David Steen), a Vietnam vet with two wooden legs. G.W. escapes regularly to the local bar in town amidst a small crowd of regulars including brothers Wardell (Newell Alexander) and Odell (David Cowgill), Bitsy and this bar's crazy old fly Juanita (Sarah Hunley).\n\nLatrelle's son Ty (Jason Dottley) is an actor living in Los Angeles and struggling with several therapists (Margaret Cho, Carson Kressley, Candis Cayne) to come to terms with his homosexuality. Along the way he deals with his first boyfriend (Ted Detwiler), his stalker ex-girlfriend (Sharron Alexis), a vengeful trick (Emerson Collins) and the difficulty of coming out to his straight best friend (Robert Lewis Stephenson) and his family back in Texas.\n","torrent":{"xt":"urn:btih:91dada7b74697d650adb58cbd32c53c684291db5","amp;dn":"Sordid+Lives%3A+The+Series+-+S01E01","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91dada7b74697d650adb58cbd32c53c684291db5","infoHashBuffer":{"type":"Buffer","data":[145,218,218,123,116,105,125,101,10,219,88,203,211,44,83,198,132,41,29,181]},"announce":[],"urlList":[]}}