{"title":"Naming Polyatomic Ions","uid":10397571,"size":147740,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9228e5f8280afe61d3b633f3bc75d2dce70134b6&amp;dn=Naming+Polyatomic+Ions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Sapphyreopal5","files":1,"time":1403290974,"description":"This is a help sheet I created when my Foundations of Chemistry class was going over the naming of polyatomic ions. I go over how to name acids, oxyacids, and covalent compounds in a systematic fashion. In this sheet I go over both how to derive a compound's formula from its name and also how to figure out a compound's name when given its formula. I do hope that you find this sheet helpful in learning how to name Polyatomic Ions. Please understand that you do need to remember the polyatomic ions sheet in order to actually be able to name them during the test. This sheet is merely a way to help people figure out a compound's name when given the formula and vice versa! The polyatomic ions your instructor wants you to know may vary course to course. \n\n\nP.S. In this sheet I do include some pretty charts, as well as step-by-step instructions above the charts to summarize what the instructions state. If you have any questions for me or need some help, I will try to look at the comments on this page and get to you when I can. I can sympathize with those of you who's chemistry instructors did not teach them these &quot;tricks&quot; to the art of naming polyatomic ions (had to figure them out for myself via researching online). Please reap the benefits of my hard work and ENJOY!\n\nDocument Title: Naming Polyatomic Ions Help Sheet\nDocument type: .PDF (requires Adobe Reader, Acrobat, something like that)\nAuthor: Sapphyreopal5 (me!)\nPages: 5\nDate of Creation: Fall 2012","torrent":{"xt":"urn:btih:9228e5f8280afe61d3b633f3bc75d2dce70134b6","amp;dn":"Naming+Polyatomic+Ions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9228e5f8280afe61d3b633f3bc75d2dce70134b6","infoHashBuffer":{"type":"Buffer","data":[146,40,229,248,40,10,254,97,211,182,51,243,188,117,210,220,231,1,52,182]},"announce":[],"urlList":[]}}