{"title":"Before We Met: A Novel (2014) Lucie Whitehouse (multi)","uid":9549191,"size":1314154,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:933d11e4c9b74478967238c3e3d96c9fa0b3ce2e&amp;dn=Before+We+Met%3A+A+Novel+%282014%29+Lucie+Whitehouse+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7","files":-1,"time":1391203539,"description":"\nBefore We Met: A Novel by Lucie Whitehouse\n\n\nFormat: mobi/epub/azw3\nLength: 288 pages\nGenre: Thriller/Suspense\nDate: 21 January 2014\n\nWhitehouse cleverly builds the suspense bit by bit, taking the reader deftly from the couple's initial newlywed bliss to Hannah's growing realization that things may not be what they seem. Astute readers will enjoy this well-drawn and taught thriller all the way to the end.\n\nHannah, independent, headstrong, and determined not to follow in the footsteps of her bitterly divorced mother, has always avoided commitment. But one hot New York summer she meets Mark Reilly, a fellow Brit, and is swept up in a love affair that changes all her ideas about what marriage might mean.\n\nBut when Mark does not return from a business trip to the U.S. and when the hours of waiting for him stretch into days, the foundations of Hannah's certainty begin to crack. Why do Mark's colleagues believe he has gone to Paris not America? Why is there no record of him at his hotel? And who is the mysterious woman who has been telephoning him over the last few weeks?\n\nHannah begins to dig into her husband's life, uncovering revelations that throw into doubt everything she has ever believed about him. As her investigation leads her away from their fairytale romance into a place of violence and fear she must decide whether the secrets Mark has been keeping are designed to protect him or protect her...\n\nAuthor:\n\nLucie Whitehouse was born in Warwickshire, England in 1975, read Classics at Oxford University and now lives in Brooklyn, New York. She is author of The House at Midnight and the The Bed I Made.","torrent":{"xt":"urn:btih:933d11e4c9b74478967238c3e3d96c9fa0b3ce2e","amp;dn":"Before+We+Met%3A+A+Novel+%282014%29+Lucie+Whitehouse+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"933d11e4c9b74478967238c3e3d96c9fa0b3ce2e","infoHashBuffer":{"type":"Buffer","data":[147,61,17,228,201,183,68,120,150,114,56,195,227,217,108,159,160,179,206,46]},"announce":[],"urlList":[]}}