{"title":"Sound Pellegrino Podcast (Season One)","uid":6925191,"size":6516514756,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:937bb4557a64b3a864cfefd9c3d337a50358ae3c&amp;dn=Sound+Pellegrino+Podcast+%28Season+One%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"soundpellegrino","files":-1,"time":1325453251,"description":"HAPPY NEW YEAR!\n\nAs we wrap up the first year of our weekly show, we decided to put the first 60 episodes of the show here on Soundcloud as a special gift to our fans who made it a success.\nHugs and kisses to all the listeners, all new talents sending us demos, all artists and labels who choose the Sound Pellegrino Podcast as the first show where they want to share their new music every week, to all the promoters and clubs who invited us to play this year!\n\nLaunched in December of 2010 The Sound Pellegrino podcast is our weekly show, hosted by Teki Latex &amp; Orgasmic aka Sound Pellegrino Thermal Team who set themselves the unbreakable rule of never playing a track twice in the entire run of the podcast, quite a commitment to the freshness of the selection and that adds up to... 500 new tracks in the course of this first season!\nEvery episode features a one-hourish live mix by the duo, with exclusives from the label and its huge extended family, our selection of cutting-edge electronica and dance music from established houses like Turbo, Boysnoize records, Fool\\'s Gold, Dirtybird or Made To Play, plus show favourites LOL Boys, Pearson Sound, Soul Clap... and guest mixes and interviews about twice a month!\n\n\nTune in every week in the first minutes of every wednesday (GMT) and catch our episodes on iTunes or on http://www.soundpellegrino.net\nSubscribe to the Sound Pellegrino Podcast on iTunes: http://itunes.apple.com/podcast/id409700483\nFull online archive of the podcast with direct download links and tracklistings: http://www.soundpellegrino.net/episodes\nListen to the Podcast on our free iPhone app without downloading or syncing: http://itunes.apple.com/app/id467907384\n","torrent":{"xt":"urn:btih:937bb4557a64b3a864cfefd9c3d337a50358ae3c","amp;dn":"Sound+Pellegrino+Podcast+%28Season+One%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"937bb4557a64b3a864cfefd9c3d337a50358ae3c","infoHashBuffer":{"type":"Buffer","data":[147,123,180,85,122,100,179,168,100,207,239,217,195,211,55,165,3,88,174,60]},"announce":[],"urlList":[]}}