{"title":"The Black Keys Discography FLAC","uid":4719244,"size":1656487489,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:940d8f8928d8c7d4928092f58499629166314d1e&amp;dn=The+Black+Keys+Discography+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sradams777","files":99,"time":1234398941,"description":"The Black Keys\n\n6 Lps and 1 Ep\n\nAttack And Release\nChulahoma\nMagic Potion\nRubber Factory\nThe Big Come Up\nThickfreakness\nThe Moan Ep\n\nThese are not my rips so thanx to whoever ripped them...sounds great.\nIf you like The White Stripes check these guys out.\nAll the artwork is included except for Attack And Release.\n\n\nBiography\tby Richie Unterberger\n\nThe Black Keys is a two-man duo comprising singer/guitarist Dan Auerbach and drummer Patrick Carney, both of whom were in their early twenties when the band's debut, The Big Come Up, was issued in 2002. Hailing from Akron, OH, they harnessed a close-to-the-bone, raw blues-rock sound on the album, whole sole instruments were Auerbach's guitar, Carney's drums, and the occasional organ. From the start, Auerbach flaunted a fine, mature, lived-in blues voice for one so young, and the group's material worked in funk, soul, and rock influences from the likes of Jimi Hendrix and James Brown, which helped avoid undue repetition of the overdone chord progressions and stock riffs common to so many such acts. Before the year's end, the band had amassed a loyal following and inked a deal with Fat Possum.\n\nThe Black Keys' second album, Thickfreakness, was recorded in 14 straight hours during a single day in 2002. To prepare for its April 2003 release, the duo joined Sleater-Kinney as their opening act for a North American winter tour. Rubber Factory followed in 2004 and earned notices as one of the best records of the year. A live DVD arrived in 2005, followed by the Chulahoma EP and the full-length Magic Potion in 2006. Two years later, the Keys issued the Danger Mouse-produced Attack &amp; Release, an album that was originally planned as a collaboration between the duo and Ike Turner (although Turner's death in December 2007 rendered the collaboration impossible). Attack &amp; Release debuted at number 14 on the Billboard 200, propelled in part by the band's string of incendiary live performances (as well as several festival appearances that summer).\n","torrent":{"xt":"urn:btih:940d8f8928d8c7d4928092f58499629166314d1e","amp;dn":"The+Black+Keys+Discography+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"940d8f8928d8c7d4928092f58499629166314d1e","infoHashBuffer":{"type":"Buffer","data":[148,13,143,137,40,216,199,212,146,128,146,245,132,153,98,145,102,49,77,30]},"announce":[],"urlList":[]}}