{"title":"Jim Morrison Speaks - The Lost Interview","uid":4045958,"size":60204855,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:947643d298515da859822ed1eba1a7ccb35276e3&amp;dn=Jim+Morrison+Speaks+-+The+Lost+Interview&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"butcherboys","files":44,"time":1203913191,"description":"This second volume of previously unavailable interviews from the Doors Archives features a never-before-released interview that was conducted on October 13, 1970 on the patio of The Doors&amp;#039; West Hollywood office by reporter Salli Stevenson for Circus Magazine (which, along with Rolling Stone and Creem, was one of the first outlets for rock journalism). The near-hour long conversation has been painstakingly restored and conveniently indexed into 41 separate questions and answers. It offers remarkable insight into Jim Morrison&amp;#039;s viewpoints and visions about his past, present, and future.  \n\n\nURL: http://www.rhinohandmade.com/browse/ProductLink.lasso?Number=7909\n\n\nTrack List:\n\n1. Jim Morrison - About Absolutely Live (0:42)\n2. Jim Morrison - Why The Lack Of Practive? (9:34)\n3. Jim Morrison - Do You Have A Great Big Ego? (3:03)\n4. Jim Morrison - How Do You Feel About Being Called The Lizard King? (1:06)\n5. Jim Morrison - Do You Believe In Reincarnation? (1:02)\n6. Jim Morrison - What Is Your Primary Belief? (2:37)\n7. Jim Morrison - What Kind Of Films Did You Make At Ucla? (0:22)\n8. Jim Morrison - What Grade Did They Give You? (1:13)\n9. Jim Morrison - The Idea For Theatricality In Rock (0:49)\n10. Jim Morrison - What Was Your State Of Mind In Miami? (0:48)\n11. Jim Morrison - Jim: I Had A Trial (1:51)\n12. Jim Morrison - What Did You Do That Evening? (1:11)\n13. Jim Morrison - People Say The Doors Have Declined (0:37)\n14. Jim Morrison - Pop Idols And Rock Stars (0:24)\n15. Jim Morrison - Jim: A Hero Is Someone Who Rebels Against The Facts Of Existance (1:18)\n16. Jim Morrison - What Do You Think Of Yourself As A Human Being? (0:42)\n17. Jim Morrison - If You Had To Do The Whole Thing Over What Would You Have Done? (0:17)\n18. Jim Morrison - What Do You Plan To Do In The Future? (1:32)\n19. Jim Morrison - How Is Your Book Doing? (0:59)\n20. Jim Morrison - With The Deaths Of Jimi And Janis, Why Do You Think They Burned... (1:04)\n21. Jim Morrison - How Do You Think You&amp;#039;ll Die? (1:04)\n22. Jim Morrison - What About The State Of America? (1:17)\n23. Jim Morrison - What Is The Climate Of America In Your Opinion? (2:24)\n24. Jim Morrison - If You Spend Eight Months In Jail, What&amp;#039;s Going To Happen To The... (0:30)\n25. Jim Morrison - Has It Definitely Been Decided That You&amp;#039;re Going To Jail? (1:55)\n26. Jim Morrison - What Was The Isle Of Wight Concert Like? (0:28)\n27. Jim Morrison - The Trial, Were You Scared? (0:16)\n28. Jim Morrison - What About The Police? (0:49)\n29. Jim Morrison - Have You Ever Been Hassled On The Road By The Police? (0:50)\n30. Jim Morrison - I Didn&amp;#039;t Know You Have A Sister (2:41)\n31. Jim Morrison - How Did The Fame Affect Your Family? (1:25)\n32. Jim Morrison - Have Your Earlier Visualizations For The Group Become A Realization? (1:50)\n33. Jim Morrison - Restart The Cassette Machine (0:36)\n34. Jim Morrison - Jim: I Like Interviews (0:57)\n35. Jim Morrison - The Stooges And Other Groups (0:53)\n36. Jim Morrison - Jim: About Love (1:54)\n37. Jim Morrison - Jim: John Got Married Sunday (1:36)\n38. Jim Morrison - Jim: The Group&amp;#039;s At A Critical Point (0:55)\n39. Jim Morrison - Jim: About Interviews (0:44)\n40. Jim Morrison - Have You Seen The Company Theatre Play? (8:14)\n41. Jim Morrison - How Do You Feel About Plays Written About You? (2:55)\n42. Jim Morrison - Unknown Dialogue (0:57)\n43. Jim Morrison - Unknown Dialogue 2/outro (0:13)\n\n","torrent":{"xt":"urn:btih:947643d298515da859822ed1eba1a7ccb35276e3","amp;dn":"Jim+Morrison+Speaks+-+The+Lost+Interview","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"947643d298515da859822ed1eba1a7ccb35276e3","infoHashBuffer":{"type":"Buffer","data":[148,118,67,210,152,81,93,168,89,130,46,209,235,161,167,204,179,82,118,227]},"announce":[],"urlList":[]}}