{"title":"Personal Folders Backup (Outlook)","uid":7973768,"size":163712,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:952b57782399f6dedfe7154ee758c26540e892f0&amp;dn=Personal+Folders+Backup+%28Outlook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TeamxSRK","files":1,"time":1356933287,"description":"No need if you want your system to be format. u can backup your mails data thru this software any where on your hard drives. \n\nUsing the PST Backup tool\nTIP   Before you begin the backup process, you might want to check the size of your .pst file. If you have multiple folders in your .pst file, you must select the top-level folder to determine the total file size for all the folders.\n\nTo install the Microsoft Outlook Personal Folders Backup tool\n\nQuit Outlook.Download the tool \nTo start the setup program, double-click the Pfbackup.exe program file on your hard disk. Follow the instructions on the screen to complete the installation.\nStart Outlook.Instructions for use\n\nThe Personal Folders file (.pst) that you want to back up must be open. If the file is visible in Folder List, it is open.\n\nOn the File menu, click Backup.Click Options.\nIn the Backup these personal folders files list, select the check box for each item you want to back up.\nChange the .pst file name shown. Or, to select a different folder, click Browse, navigate to the location you want, and then click Open.\n\nNOTE   The default file name and location where the .pst file is saved is shown in the File location box.\nTo have Microsoft Outlook automatically remind you to make a backup copy of this file, select the Remind me to backup every x days check box, and then type the number of days between 1 and 999.\nClick OK. Click Save Backup.\nNOTE The items selected will not be backed up until you quit Outlook.\n\nFOR OFFICE 2010\nHow to enable Personal Folders Backup add-in to work with Outlook 2010\n\nNote This step only needs to be performed one time.\nStart Outlook. On the Ribbon, click the Add-ins tab.\nClick the Backup button.\nClick Options and select the .pst files that you want to back up.\nThe Personal Folders Backup add-in can back up files to a disk. However, the add-in cannot spread the .pst file across multiple disks. When you change backup options, select a storage location that has sufficient free space to handle your whole .pst file.","torrent":{"xt":"urn:btih:952b57782399f6dedfe7154ee758c26540e892f0","amp;dn":"Personal+Folders+Backup+%28Outlook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"952b57782399f6dedfe7154ee758c26540e892f0","infoHashBuffer":{"type":"Buffer","data":[149,43,87,120,35,153,246,222,223,231,21,78,231,88,194,101,64,232,146,240]},"announce":[],"urlList":[]}}