{"title":"Tiny Monroe - Volcanoes [1996]","uid":9486217,"size":259226422,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9561e46e85e2caff378020cfeeb60b6e03914b6e&amp;dn=Tiny+Monroe+-+Volcanoes+%5B1996%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1389895080,"description":"Tiny Monroe were an English indie britpop band of the 1990s.\nThe band was formed in London in 1993 by founder members NJ Wilow (vocals), Alex Culpin (bass guitar), Philip Spalding (guitar) and Greg Sanford (drums). The line up was cemented when Richard Davies (guitar) and Jon Solomon (drums) replaced Spalding and Sanford. This was the line up that played at Glastonbury, Reading and T in the Park festivals in 1994, and who recorded the majority of the songs on the album 'Volcanoes'. A final line up appeared post recording of the band's only album 'Volcanoes' comprising NJ Wilow (vocals), Richard Davies (guitar), Garry Becker (bass) and Dan Neumann (drums) ref name=&quot;Strong&quot;&gt;Strong, Martin C. (2003) The Great Indie Discography, Canongate, ISBN 1-84195-335-0, p. 1031&lt;/ref&gt; The band quickly attracted press attention from the NME and Melody Maker. The band emerged as part of a perceived wave of female fronted bands influenced by the new wave sounds of the late 70s and early 80s. Other bands to emerge at the same time included Elastica, Sleeper, Echobelly and Salad.\nThe band released their debut single &quot;VHF855V&quot; (the tile coming from the number plate of NJ's Ford Escort) on their manager Howard Gough's Laurel record label in March 1994, and released their first album Volcanoes in July 1996.[1][2] Their most successful release, the Cream EP reached number 7 in the national indie chart in April 1994.\nEarly support tours with Cranes and Curve were followed by festival appearances at Glastonbury, Reading and T In The Park in 1994. Other festival appearances included Sweden's Hultsfred Festival and France's RouteRock festival in St. Malo. The band undertook several headline tours and supported the Pretenders, Suede and Radiohead at the invitation of all three groups.\nWhile in the band, NJ played the role of an alien in the BBC television film The Traveller.","torrent":{"xt":"urn:btih:9561e46e85e2caff378020cfeeb60b6e03914b6e","amp;dn":"Tiny+Monroe+-+Volcanoes+%5B1996%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9561e46e85e2caff378020cfeeb60b6e03914b6e","infoHashBuffer":{"type":"Buffer","data":[149,97,228,110,133,226,202,255,55,128,32,207,238,182,11,110,3,145,75,110]},"announce":[],"urlList":[]}}