{"title":"The_Sims_3_Store-May_2012_Update-admz0r (.sim3pack/.package)","uid":7310212,"size":484458034,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:96b294215c3aa76dbae3ba7577f4006cb674257d&amp;dn=The_Sims_3_Store-May_2012_Update-admz0r+%28.sim3pack%2F.package%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"admz0r","files":14,"time":1338321150,"description":"Here's the complete May update, and as many of you like in .package, I also included the May package too in this torrent (I will do in this way from now, so you can find both format in the same torrent file!) .sim3pack included too, you can find them in seperate folders. The .sim3pack's decrapified, and rigfixed, of course.\n\nIt's a month set, not like shits on TPB (missing items, previous month items,etc), if you want to get ALL the updates released in current month, always take mine. \n\nSo there's a FiXER folder in the torrent, you have to use the .packages inside to get work some new items, which got fucked up, because of the decrapifier. If you do this right, everything is going to work. (see below)\n\n!!!! WARNING !!!! IF YOU'RE GETTING MY SET'S FROM MONTH TO MONTH, YOU MUST DELETE FROM YOUR PACKAGES THE &quot;Lunar_Lakes-Tree_of_Prosperity_(FiX)&quot; (FROM FEBRUARY UPD) BECAUSE THE NEW FIX ALREADY INCLUDES THAT FIX TOO, AND IF YOU KEEP IT, THEY GOING TO CONFLICT WITH EACH OTHER. !!!!\n\niNSTRUCTiONS:\n--------------\n*This fix assumes that ALL affected items are installed the same way*\n\n1)  Everyone will need this file-----KT_StoreFix_Awesome.package\n2)  !!!!If you don't use Awesomemod you will also need this file!!!!-----KT_StoreFix_UnAwesome.package\n3)  If your premium store content is decrapified (like all of my sets) you need this too-----ccmerged_decrapped.package\n4)  Some people can't get the vintage phone work, this package might fix their problems (but all of you should use it)-----PhoneTableMidCModsuite_Script.package\n\n*!!!!If you use packages make sure to put these in your overrides folder, if you use the .sim3pack's put these in your packages folder!!!!*\n\nFiXES THE FOLLOWiNG:\n---------------------\n+No ladle for decrapped Lord Vladimir's Magic Cauldron\n+No needle for decrapped Malleable Mimic Voodoo Doll\n+No fruit for decrapped Tree of Prosperity\n+No food for decrapped Sizzle Baby Pro Deep Fryer and Frost-Bite Pro Ice Cream Machine\n+No handset for the decrapped Vintage Rotary Phone\n+Routing issue with Banquett Fan\n+Wall cut-outs for the Modernism Window, Not-So-Private Study Door, Nega-Door, Gothique Window and the Muntin Window\n+Fixed middle slots on the Vineyard Vittles Dining Table \n+The Ultimate Career Bundle unlocked\n+Working Pet Register\n+Buff conflicts with the following items: Sharper Sim's Super Sleeper, MultiTab 6000, The Hypnotizer, Malleable Mimic Voodoo Doll, Lord Vladimir's Magic Cauldron, Frost-Bite Pro Ice Cream Machine, Sizzle Baby Pro Deep Fryer, Leon's Fountain of Youth\n+Reset bug with Lady Ravendancer Goth's Book o' Spells\n\n\nMAY SET:\n---------\n-BeachCAS2Set\n-CarPriusPlugIn\n-FiestaNSOMexKitDiningSET\n-GGWorkFromHomeNSOSET\n-KidsJammiesCASSet\n-LLRocksSET\n-ModCamboBedBathSET\n-paintingPosterKatyPerry\n-TipTopToddlerCompilationSet\n\n\nWRITE ONLY USERES PLEASE STOP IRRATING. EVERYTHING IS IN THE DESCRIPTION/IN THE FIRST COMMENT.\n\n-admz0r-","torrent":{"xt":"urn:btih:96b294215c3aa76dbae3ba7577f4006cb674257d","amp;dn":"The_Sims_3_Store-May_2012_Update-admz0r+%28.sim3pack%2F.package%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96b294215c3aa76dbae3ba7577f4006cb674257d","infoHashBuffer":{"type":"Buffer","data":[150,178,148,33,92,58,167,109,186,227,186,117,119,244,0,108,182,116,37,125]},"announce":[],"urlList":[]}}