{"title":"Havoc-Hidden Files[2009/mp3/320kbps] [kilo]","uid":4819588,"size":107395201,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9717ae830ac5a6cca29f76cd673ecea8b8fcb147&amp;dn=Havoc-Hidden+Files%5B2009%2Fmp3%2F320kbps%5D+%5Bkilo%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"akhiugo","files":-1,"time":1238715647,"description":"+----------------------------------------------------------------------------+\n|                                                                            |\n| Artist     : Havoc                                                         |\n| Album      : Hidden Files                                                  |\n| Bitrate    : 320kbps                                                       |\n| Label      : KOCH                                                          |\n| Year       : 2009                                                          |\n| Genre      : Rap                                                           |\n| Rip date   : Feb-18-2009                                                   |\n| Store date : Feb-10-2009                                                   |\n| Size       : 102MB                                                         |\n|                                                                            |\n+--------------------------------[Track List]--------------------------------+\n|                                                                            |\n|Track Listing:                                                              |\n|                                                                            |\n| 01 - Can't Get Touched                         02:37                       |\n| 02 - I Clap Em Up                              03:42                       |\n| 03 - Watch Me feat. Ricky Blaze                03:15                       |\n| 04 - Heart Of The Grind                        02:58                       |\n| 05 - You Treated Me feat. Cassidy              02:58                       |\n| 06 - My Life                                   03:16                       |\n| 07 - That's My Word                            03:42                       |\n| 08 - The Hustler                               03:18                       |\n| 09 - The Millenium                             03:13                       |\n| 10 - Walk Wit Me                               03:09                       |\n| 11 - On A Mission feat. Prodigy                03:38                       |\n| 12 - This Is Where It's At feat. Big Noyd      02:55                       |\n| 13 - Don't Knock It Til You Try It             03:11                       |\n| 14 - Tell Me More feat. Sonyae Elise           02:51                       |\n|                                                                            |\n|                                                                            |\n|                                                44:43 min                   |\n|                                                                            |\n+----------------------------------[Notes]-----------------------------------+\n|                                                                            |\n|  2009 solo album from the Mobb Deep legend. The Queens duo of Havoc and    |\n|  Prodigy (AKA Mobb Deep) are one of the biggest groups in Rap music,       |\n|  selling over four million albums worldwide. With classic albums like The  |\n|  Infamous, Hell On Earth, Murda Muzik, and Infamy, Mobb Deep have become   |\n|  household names in the Hip Hop community. Not only a respected MC, Havoc  |\n|  has also created the sonic backdrops for the likes of The Game, G-Unit,   |\n|  Jadakiss, and others.                                                     |\n|                                                                            |\n|  As golden age rap suddenly gave way to West Coast gangsta in the early    |\n|  '90s, an East Coast variety of hardcore rap arose in turn, with Mobb      |\n|  Deep initially standing tall as one of New York's hardcore figureheads    |\n|  on the basis of their epochal album The Infamous. Released in April       |\n|  1995, The Infamous was released almost exactly a year after Illmatic and  |\n|  about a half year after Ready to Die ÃƒÂ¹ the debut masterpieces of Nas and  |\n|  the Notorious B.I.G., respectively, both albums likewise of momentous     |\n|  significance for East Coast hardcore rap. On The Infamous, Mobb Deep      |\n|  (comprised of Prodigy and Havoc) set the tone for future generations of   |\n|  hardcore New York rappers, from G-Unit to Dipset. Subsequent releases     |\n|  from the duo were likewise influential, especially Hell on Earth (1996).  |\n|  However, by the late '90s, Mobb Deep was no longer setting trends; in     |\n|  fact, they seemed to be following them, and they lost some of their       |\n|  stature as subsequent generations of hardcore rappers arose. For a few    |\n|  years, Mobb Deep struggled to reclaim their commercial standing, until    |\n|  they eventually drifted into the G-Unit camp, where they signed a         |\n|  lucrative deal to join 50 Cent and company. Blood Money (2006), Mobb      |\n|  Deep's first release under the G-Unit banner, rekindled interest in the   |\n|  veteran duo, who enjoyed a substantial uptick in sales and airplay.       |\n|                                                                            |\n|  Prodigy (Albert Johnson, born November 2, 1974) and Havoc (Kejuan         |\n|  Muchita, born May 21, 1974) grew up in Queens, specifically the           |\n|  Queensbridge area, yet met in Manhattan, where both were students at      |\n|  Graphic Arts High School. Their shared love of hip-hop resulted in a      |\n|  natural companionship, and while they were still teens, the two young     |\n|  men had themselves a record deal with 4th &amp; Broadway, a major rap label   |\n|  affiliated with Island Records. In 1993, the label released Juvenile      |\n|  Hell, a confrontational album featuring noteworthy production work by DJ  |\n|  Premier and Large Professor, who both within a year's time would move on  |\n|  to produce the debut of another young Queensbridge rapper, Nas. Not much  |\n|  came of Juvenile Hell, however, and it would be two more years before     |\n|  Mobb Deep would return.                                                   |\n|                                                                            |\n|  When they did return in 1995, it was on a different label, Loud Records,  |\n|  and with a significantly developed approach. The Infamous featured a      |\n|  mammoth street anthem, &quot;Shook Ones, Pt. 2,&quot; but it was a solid album all  |\n|  around, featuring also the in-house production work of Havoc and a        |\n|  couple high-profile features (Nas, Raekwon). The Infamous was more        |\n|  hardcore than its two key stylistic predecessors, Illmatic and Ready to   |\n|  Die; the beats were darker and harder-hitting while the rhymes were       |\n|  downright threatening yet still inventive and crafty. Moreover, there     |\n|  were no crossover hits like &quot;Big Poppa&quot; or &quot;Juicy.&quot; In fact, there were   |\n|  no light moments at all. The Infamous was an uncompromising album for     |\n|  the streets, and it was championed as such.                               |\n|                                                                            |\n|  A year later, in 1996, Mobb Deep returned with a follow-up, Hell on       |\n|  Earth, which was a little slicker than The Infamous yet still emphasized  |\n|  hardcore motifs. It spawned a couple hit singles that were given          |\n|  appropriately theatrical videos. At this point, hardcore rap was at its   |\n|  peak, with Death Row Records flourishing on the West Coast and a legion   |\n|  of New Yorkers jumping into the scene, following the lead of Nas, the     |\n|  Notorious B.I.G., and Mobb Deep. So when it took over two years for Mobb  |\n|  Deep to return with a new album, Murda Muzik, not released until April    |\n|  1999, the rap landscape had changed significantly. Mobb Deep now had      |\n|  significant competition, and since Murda Muzik offered few innovations    |\n|  and lacked the spark of the duo's past two albums, it was met with some   |\n|  disappointment. By and large, fans enjoyed it, yet the album didn't       |\n|  appeal beyond the already established fan base, as the album only         |\n|  offered one major hit, &quot;Quiet Storm.&quot; The following year, Prodigy         |\n|  released a solo album, H.N.I.C. (2000). It got a lukewarm reception,      |\n|  appealing to the duo's fan base yet spawning no hits.                     |\n|                                                                            |\n|  When Mobb Deep resurfaced, in December 2001 with Infamy, they showcased   |\n|  a new willingness to reach beyond their fan base. &quot;Hey Luv&quot; was issued    |\n|  as a single, and it was the first Mobb Deep song to flirt with R&amp;B        |\n|  crossover, or even to mention love, for that matter. The song got some    |\n|  airplay, thanks in part to its hook, which is sung by the R&amp;B act 112,    |\n|  and its video, which played up the song's air of seduction. Nonetheless,  |\n|  Infamy proved to be a relative disappointment commercially, and it        |\n|  seemed like Mobb Deep was beginning to see their popularity erode with    |\n|  each passing year. It didn't help, either, that around this time the duo  |\n|  ÃƒÂ¹ and Prodigy, in particular ÃƒÂ¹ had been attacked by Jay-Z on &quot;Takeover.&quot;  |\n|  And too, that Loud Records would go out of business, leaving Mobb Deep    |\n|  without a label deal. For the next few years, from roughly 2002-2005,     |\n|  Prodigy and Havoc tried to regain their footing. There were one-off       |\n|  albums released via various label arrangements ÃƒÂ¹ Free Agents: The Murda   |\n|  Mix Tape (Landspeed, 2003), Amerikaz Nightmare (Jive, 2004), and The Mix  |\n|  Tape Before 9/11 (X-Ray, 2004) ÃƒÂ¹ that made minimal impact. By this        |\n|  point, not even the fan base was all that interested; it had been eroded  |\n|  with each passing year, leaving few faithful.                             |\n|                                                                            |\n|  Then came a surprise announcement that 50 Cent had signed Mobb Deep to    |\n|  his G-Unit family and that an album would be forthcoming. First came a    |\n|  quick remix featuring the latest G-Unit signing, &quot;Outta Control,&quot; which   |\n|  supplanted the original version when 50's The Massacre was reissued in    |\n|  2005 as a CD/DVD. Too, Mobb Deep had become omnipresent on the New York   |\n|  mixtape scene, releasing all kinds of streets-only material in attempt    |\n|  to re-establish themselves. It evidently worked, as Blood Money debuted   |\n|  in the Top Ten of Billboard's album chart and brought more exposure to    |\n|  Mobb Deep than the duo had enjoyed since their late-'90s heyday. Not      |\n|  everyone was convinced by the group's makeover, however, as the G-Unit    |\n|  approach was substantially more polished than the Mobb Deep of The        |\n|  Infamous. Still, Mobb Deep found a new generation of younger listeners ÃƒÂ¹  |\n|  the large G-Unit market base, in particular ÃƒÂ¹ who were mostly unfamiliar  |\n|  with them. It had been over a decade since The Infamous, after all, and   |\n|  Mobb Deep had been out of the spotlight for years. Then, in early 2008,   |\n|  Prodigy went away to prison to serve a three-year sentence, putting Mobb  |\n|  Deep's future in question.                                                |\n|                                                                            |\n+----------------------------------------------------------------------------+\n\n\nPlease help your fellow pirates by seeding after download!","torrent":{"xt":"urn:btih:9717ae830ac5a6cca29f76cd673ecea8b8fcb147","amp;dn":"Havoc-Hidden+Files%5B2009%2Fmp3%2F320kbps%5D+%5Bkilo%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9717ae830ac5a6cca29f76cd673ecea8b8fcb147","infoHashBuffer":{"type":"Buffer","data":[151,23,174,131,10,197,166,204,162,159,118,205,103,62,206,168,184,252,177,71]},"announce":[],"urlList":[]}}