{"title":"[Psx] [Ntsc-us] Elemental Gearbolt","uid":4355717,"size":341555243,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:977c000f04a886f90313352aead71d708f57c9ca&amp;dn=%5BPsx%5D+%5BNtsc-us%5D+Elemental+Gearbolt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big_dude","files":-1,"time":1219402057,"description":"Elemental Gearbolt                          Light-Gun Game\n                                            \n                                            1-2 Players\n\n\n(Ntsc-Us) For the Ps-one / Released in 1998 By Working Designs.\n\n\nMedia Format:  CD-R\nLanguage:      English\nDiscs:         1\nImage:         MDS/MDF\nRequirements:  Modded/Chipped playstation or Ps2, Retail Breaker Pro/Boot-cd, \n               Game Enchancer/Built-in Mod, (Need spring it comes with\n               for both boot cd and game echancer on a psx console) or a\n               psx emulator. (You only need to use one of these mentioned methods)\n\nNote: You should only use high quality cd-r recording media to burn psone games one. Like Taiyo Yuden, or Verbatim DataLifePlus cd-r media for example.\n\nCompressed with Winrar\n\n\n                          \nDescription:\n\nIn a fantastic world divided by class and race, technology from a mysterious source has imbued a young prince with the key to unimaginable power. \n\nBy means of a Neural Network Computer fueled by the grey matter of unfortunate 'volunteers', he plans to conquer the known world, replacing it \nwith a new order of his design. \n\nThe only fly in the ointment is disturbing reports of two powerful Elementals storming across the land on a direct course toward the palace.\n\nOne or two players can assume the identities of these Elementals as they crusade for an unknown master toward a climactic battle. \n\nThe gripping story unfolds by means of heart-stopping fully-3D action levels interspersed with gorgeous hand-drawn animation scenes.\n\n\nA very awesome and unique ps-one game worthy of playing.\n\n\n\nDidn't seem like anyone uploaded this psx game on the pirate bay so I thought what the heck, why not I guess I will.\n\n\nIncludes game pics\n\n\nImage is in mds/mdf format so Burn with Alcohol 120% on playstation datatype setting.\n\nUse High quality recording discs always when regarding backups of any game for the ps, ps2, or xbox, you get the picture. (were talking modded consoles here).\n\n\n\nEnjoy!\n\n\nYou guys and anyone else downloading this need to seed don't just leech, I can't seed all the time. \n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:977c000f04a886f90313352aead71d708f57c9ca","amp;dn":"%5BPsx%5D+%5BNtsc-us%5D+Elemental+Gearbolt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"977c000f04a886f90313352aead71d708f57c9ca","infoHashBuffer":{"type":"Buffer","data":[151,124,0,15,4,168,134,249,3,19,53,42,234,215,29,112,143,87,201,202]},"announce":[],"urlList":[]}}