{"title":"Nirvana - In Utero [24 bit FLAC] vinyl","uid":8110217,"size":945980691,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:97bcc5345d1ca99bba90a11b50a0643fa8045a98&amp;dn=Nirvana+-+In+Utero+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"24.96","files":-1,"time":1360172010,"description":"Nirvana probably hired Steve Albini to produce In Utero with the hopes of creating their own Surfer Rosa, or at least shoring up their indie cred after becoming a pop phenomenon with a glossy punk record. In Utero, of course, turned out to be their last record, and it's hard not to hear it as Kurt Cobain's suicide note, since Albini's stark, uncompromising sound provides the perfect setting for Cobain's bleak, even nihilistic, lyrics. Even if the album wasn't a literal suicide note, it was certainly a conscious attempt to shed their audience -- an attempt that worked, by the way, since the record had lost its momentum when Cobain died in the spring of 1994. Even though the band tempered some of Albini's extreme tactics in a remix, the record remains a deliberately alienating experience, front-loaded with many of its strongest songs, then descending into a series of brief, dissonant squalls before concluding with &quot;All Apologies,&quot; which only gets sadder with each passing year. Throughout it all, Cobain's songwriting is typically haunting, and its best moments rank among his finest work, but the over-amped dynamicism of the recording seems like a way to camouflage his dispiritedness - as does the fact that he consigned such great songs as &quot;Verse Chorus Verse&quot; and &quot;I Hate Myself and Want to Die&quot; to compilations, when they would have fit, even illuminated the themes of In Utero. Even without those songs, In Utero remains a shattering listen, whether it's viewed as Cobain's farewell letter or self-styled audience alienation. Few other records are as willfully difficult as this.","torrent":{"xt":"urn:btih:97bcc5345d1ca99bba90a11b50a0643fa8045a98","amp;dn":"Nirvana+-+In+Utero+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97bcc5345d1ca99bba90a11b50a0643fa8045a98","infoHashBuffer":{"type":"Buffer","data":[151,188,197,52,93,28,169,155,186,144,161,27,80,160,100,63,168,4,90,152]},"announce":[],"urlList":[]}}