{"title":"Lena Willemark-Ale Moller - Agram 1996","uid":6546571,"size":321275991,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:97ed501dead0b381c7320b51267e65834de5a7d7&amp;dn=Lena+Willemark-Ale+Moller+-+Agram+1996&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1310891703,"description":"Agram represents the second coming of the Nordan Project whose 1994 release Nordan was highly acclaimed. Defined by its co-leaders vocalist Lena Willemark and multi-instrumentalist Ale MÃƒÂ¶ller as a meeting-place for Swedish folk musicians and musicians from the world of improvisation, the group's music is based upon, but not limited by, the Swedish folk tradition. Willemark and MÃƒÂ¶ller select the songs, some of which are hundreds of years old, and write new material and fresh arrangements. MÃƒÂ¶ller's unorthodox biography has included extended stopovers in rock and jazz and Greek music on the way to his current, and enduring, commitment to Swedish folk. Willemark, the daughter of a forest-keeper, embodie's the musical tradition giving it new life with her stunning vocal abilities. Together, the Nordan Project is concerned both with the preservation and the rejuvenation of the folk tradition. MÃƒÂ¶ller and Willemark met ECM's Manfred Eicher by chance in 1992 when the musicians were appearing at a folk-festival while the producer was in town for a Arvo PÃƒÂ¤rt premiere. Over the next year and half they discussed the form that their collaboration should take and the Nordan Project was born. A key figure in its line-up is bassist Palle Danielsson, who has been associated with ECM almost from the beginning of its history. He has been a member of several important ECM bands including Keith Jarrett's Belonging group, the Jan Garbarek-Bobo Stenson Quartet, the quartets of Enrico Rava and Charles Lloyd.\n\nLena Willemark-Ale MÃƒÂ¶ller - Agram 1996\n(Munchen ECM)\n\n 1. Syster Glas\n 2. Agram\n 3. SÃƒÂ¥som FÃƒÂ¥gelen\n 4. FastÃƒÂ¤n\n 5. BjÃƒÂ¶rnen\n 6. Samsingen\n 7. Per Andsu lietjin\n 8. Josef fran Arimatea\n 9. Lager och Jon\n10. BlÃƒÂ¥mÃƒÂ¥iri\n11. SlÃƒÂ¤ngpolskor\n12. Elvedansen\n13. Simonpolskan\n\n\nAle MÃƒÂ¶ller: mandola, lute, natural flutes, folk-harp, shawm, wooden trumpet, hammered dulcimer\nPalle Danielsson: double bass\nMats Eden: drone fiddle\nTina Johansson: percussion\nJonas Knutsson: soprano and baritone saxophones, percussion\nLena Willemark: vocal, fiddle, viola\n","torrent":{"xt":"urn:btih:97ed501dead0b381c7320b51267e65834de5a7d7","amp;dn":"Lena+Willemark-Ale+Moller+-+Agram+1996","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97ed501dead0b381c7320b51267e65834de5a7d7","infoHashBuffer":{"type":"Buffer","data":[151,237,80,29,234,208,179,129,199,50,11,81,38,126,101,131,77,229,167,215]},"announce":[],"urlList":[]}}