{"title":"Disciples.II.Galleans Return.iso","uid":4120198,"size":1280563040,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:97fc26e5deb391737e5cd1af023461872af826ba&amp;dn=Disciples.II.Galleans+Return.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xGothicAngelx","files":4,"time":1207508904,"description":"~ GoThIcHaCk.cOm PrEsEnTs ~\n\nDisciples II Gallean's Return\n\nDisciples II has been awarded countless honors for its unique game play and challenging scenarios including game of the year and many editor's choice awards. Disciples II Gallean's Return is a must for any Disciples fan and a great value for anyone who has never played Disciples before. All of the Disciples II\ncampaigns and hundreds of hours of game play in one adventure-packed box.\n-----\n\nGame contents:\n-Dark Prophecy\nA decade has past since the first Great War of the original Disciples game.\nThe final prophecy continues to unfold. Deep in the crevices of the Sacred Lands, the Chosen One has emerged, fated to bring salvation to some and destruction to others. Playing as one of four races, gamers must take up the sword and fight for the glory of their God.\n\n-Servants of the Dark\nServants allows gamers to play the two 'evil' races while the Disciples story continues to unfold. Play as either the Legions of the Damned - spreading Brethrezen's plague across the land while sensing a greater threat in the Elven god, or the Undead Hordes - seeking revenge against Gallean, one that will scar his people for eternity.\n\n-Guardians of the Light\nContinuing the story that began in Dark Prophecy, Guardians allows gamers to play either the Empire -trying to gain control of the now vacant throne while a cruel inquisition sweeps their lands, or the Mountain Clans -trying to reunite their tribes after their near-destruction by the Chosen One.\n-----\n\nTorrent Contains two iso files. (D2PAK.iso, D2PAK.iso; (cd 1 and cd 2))\nDownload Alcohol 120%, http://thepiratebay.se/search/alcohol%20120/0/99/300\n, mount the first iso, install, then when game asks for cd2, change the first mount to the second iso. Use first iso to play game.\n\n\n~ GoThIcHaCk.cOm DreamHack ~\nFinal farewells; only in fairy tales.\n\n[Comments welcome and encouraged.]\n-----\n\nNOTE: \ncroon4558 (user in the comments) still sucks, for complaining so much for things hes getting for free.\n\nelectheone (user in the comments) rules, for saying this is the best disciples torrent. Thanks. ;)\n\nThanks to Delb for specifying this is Galleans Return.","torrent":{"xt":"urn:btih:97fc26e5deb391737e5cd1af023461872af826ba","amp;dn":"Disciples.II.Galleans+Return.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97fc26e5deb391737e5cd1af023461872af826ba","infoHashBuffer":{"type":"Buffer","data":[151,252,38,229,222,179,145,115,126,92,209,175,2,52,97,135,42,248,38,186]},"announce":[],"urlList":[]}}