{"title":"ECGs Made Easy Aehlert","uid":8848004,"size":5404838,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9818898d658f86cbff03901c8024a665c4e3c76a&amp;dn=ECGs+Made+Easy+Aehlert&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Sapphyreopal5","files":2,"time":1377452510,"description":"Book Title: Pocket Reference for ECGs Made Easy, 5th edition\nAuthor: Barbara J. Aehlert\nISBN-13: 9780323101080\nISBN-10: 0323101089\nDescription: Put essential ECG information at your fingertips! Based on Barbara Aehlert's popular ECGs Made Easy, 5th Edition, this full-color pocket reference makes it easy to identify ECG rhythms and highlights basic information on cardiac conditions that cause dysrhythmias. Each rhythm includes a brief description, a summary of the characteristics of the rhythm, and a sample rhythm strip. A handy, compact size makes this reference ideal for use in the field!\n\nPlease read the following before downloading!!!\n************************************************************\nI initially bought the Kindle edition of this book. I then converted the original format to become a mobi file to remove the DRM, and afterwards converted the same file also to become a pdf file. This torrent contains both the mobi file AND the pdf file. The reason for this is that I recognize some people would rather have a pdf file and there are also those who may want the mobi file for their own personal reasons. It seems that the mobi file has better quality pictures but nonetheless it's all the same content. Again both files are in this torrent ready for download. If you want just one of the formats, there may or may not be a way to download just part of the torrent depending on which torrent downloader you use. \nIf you do not like the quality of this torrent due to the layout of the pages not being as pretty as the textbook version, you are more than welcome to buy the paperback version of this book online or better yet from your school bookstore!\n*************************************************************\nWith all this being said, please enjoy! Comment below and please please let me know if there are any issues with this torrent, as this method is new for me!","torrent":{"xt":"urn:btih:9818898d658f86cbff03901c8024a665c4e3c76a","amp;dn":"ECGs+Made+Easy+Aehlert","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9818898d658f86cbff03901c8024a665c4e3c76a","infoHashBuffer":{"type":"Buffer","data":[152,24,137,141,101,143,134,203,255,3,144,28,128,36,166,101,196,227,199,106]},"announce":[],"urlList":[]}}