{"title":"The_Watchmen....DVDrip(vice)","uid":4984196,"size":626204805,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:987d4e64d97622a837c2ea2bc62cd088209132f9&amp;dn=The_Watchmen....DVDrip%28vice%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vicerock","files":-1,"time":1246543723,"description":"THE WATCHMEN DVDrip...PSP...IPOD\n\nResolution    : 320X240 (Full Screen)\n              \nVideo Codec   : MPEG4\nVideo Bitrate : 448 Kbps\nAudio Codec   : AAC\nAudio Bitrate : 64 Kbps\n\nThe story takes place in an alternate timeline in which masked, costumed vigilantes fight crime in America. In the 1930s and 40s, the vigilantes form a group called the Minutemen. Decades later, a second generation of superheroes attempt to form a team as well, calling themselves the Watchmen. Various historical events are shown to have been altered or impacted by the existence of superheroes, such as the assassination of John F. Kennedy and the Vietnam War. The American victory in the Vietnam War, due to the intervention of the godlike being Doctor Manhattan, leads to Richard Nixon's third term as President following the repeal of term limits in the United States. By the 1980s, however, the Watchmen have been outlawed, and tensions between the United States and the Soviet Union have escalated the Cold War with threats of nuclear attack.\n\nBy 1985, only three adventurers remain active: the Comedian and Dr. Manhattan, who act with government sanction, and the masked vigilante Rorschach, who refuses to retire and remains active illegally. Investigating the murder of government agent Edward Blake, Rorschach, knowing that Blake was the Comedian, concludes that someone is trying to eliminate masked heroes. He goes off to warn his retired comrades: the emotionally detached Dr. Jon Osterman (Dr. Manhattan) and his lover Laurie Juspeczyk (Silk Spectre II), Daniel Dreiberg (Nite Owl II), and Adrian Veidt (Ozymandias), but makes little progress.\n\nAfter Blake's funeral, Dr. Manhattan is accused of causing the cancers afflicting his former girlfriend and colleagues from before the accident that turned him into the being he is now. Manhattan exiles himself to Mars, giving the Soviet Union the confidence to invade Afghanistan in his absence. Later, Rorschach's conspiracy theory appears to be justified when Adrian, who had long since made his identity as Ozymandias public before retiring, narrowly avoids an assassination attempt, and Rorschach himself is framed for murder.\n\nMeanwhile, Juspeczyk, having previously broken up with Manhattan, falls in love with Dreiberg, and the two former heroes decide to come out of retirement as they grow closer to one another. After breaking Rorschach out of prison alongside Nite Owl, Silk Spectre is confronted by Manhattan. He takes her to Mars and explains he is no longer interested in humanity, after she asks him to intervene. Probing her memories, they both discover that the Comedian was her father. His interest in humanity renewed, Manhattan returns to Earth with Silk Spectre.\n\nPLEASE...SEED...AND...ENJOY...THANKS","torrent":{"xt":"urn:btih:987d4e64d97622a837c2ea2bc62cd088209132f9","amp;dn":"The_Watchmen....DVDrip%28vice%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"987d4e64d97622a837c2ea2bc62cd088209132f9","infoHashBuffer":{"type":"Buffer","data":[152,125,78,100,217,118,34,168,55,194,234,43,198,44,208,136,32,145,50,249]},"announce":[],"urlList":[]}}