{"title":"[DC] Zombie Revenge [NTSC] [SB] [CDI]","uid":5827208,"size":194246803,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:9888c7c6c7409dc004d0a45505c041bb31f5e0d9&amp;dn=%5BDC%5D+Zombie+Revenge+%5BNTSC%5D+%5BSB%5D+%5BCDI%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big_dude","files":-1,"time":1284340094,"description":"Zombie Revenge for the Sega Dreamcast                               Rel. 11/30/1999\n\n\nFormat:\t     CD-R NTSC-USA\nLang.:\t     English\nDiscs:        1\nImage:        CDI\nGener.:       Arcade/Coin-op\nSelfboot:     Yes\nRequirements: Dreamcast Console, or DC Emulator.\n\n\nCompressed with 7Zip, Game was tested and works. \n\n\n\nImportant: Some later versions of Sega dreamcast consoles supposedly won't allow\n           utopia or copies of games, not sure if this is true but to be on the \n           safe side try to use a console manufactured before october 2000.  You\n           can find the manufacture date on the bottom of the console on the     \n           sticker in fine print just look for it. Of course the only way to know\n           is to just try it on your dreamcast.\n\n\n\nGame Description:\n\nA top secret government plan to use undead soldiers has gone horribly wrong. Just before it was ready to be put into operation, someone unknown interfered. Now a year later the city is the home for the undead. Three agents, Stick Breitling, Linda Rotta and Rikiya Busujima, who have come together from various paths of fate, now join together to do battle against the army of the undead and rid the streets of the zombie scum!\n\nThe game features multiple weapons and 1 or 2-player arcade action. Each of the characters have different attributes, agility, strength, better with weapons as opposed to unarmed combat. \n\nThere are a multitude of weapons that can be found through the game such as shotguns and machine guns to battle the undead. There are a range of attacks that can be performed, charging your shot by holding down the button longer, variable shots by locking on the zombie longer, rolling attacks, backward and dash attacks and more.\n\nThere are a number of game modes accessible from the main menu. The Arcade mode from the coin-op version, an Original Dreamcast version, which gives you options of playing the game with more focus on either weapons only or bare knuckle fighting. There is also a vs Boss and Fighting mode, as well as a Training Room.\n\nZombie Revenge also features downloadable mini games for your VM unit. There is a Zombie Revenge Raising Game where you feed and raise your own zombie. Playing the above mentioned Original mode provides food items for your zombie. The zombie you have raised can also be uploaded to the Internet, or emailed to someone, and other peoples zombies can be downloaded.\n\nThere are two other mini-games: Zombie Fishing (fish for zombies) and Zombie Doubt (memory test with symbols).\n\n\nGame Pics included.\n\n\nBurn both games with Alcohol 120% or Discjuggler (Both included in download).\n\nIn Options enable overburn disc in Alcohol or DiscJuggler. \n(Do this for all DC games)\n\nSet Write Method To Raw/Dao and burn at 4x Speed for Alcohol 120%.\n\nIf you wanna burn using DiscJuggler Set Burn settings to Raw Write Mode 2 2352 \nCD-DA or Mode 1 2048 Raw Write and burn at 4x Speed.\n\n\nUse Verbatim or Taiyo Yuden CD-R Media for best quality, or if other media isn't working.\n\n\n(No CD-RW will not work).\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!\t","torrent":{"xt":"urn:btih:9888c7c6c7409dc004d0a45505c041bb31f5e0d9","amp;dn":"%5BDC%5D+Zombie+Revenge+%5BNTSC%5D+%5BSB%5D+%5BCDI%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9888c7c6c7409dc004d0a45505c041bb31f5e0d9","infoHashBuffer":{"type":"Buffer","data":[152,136,199,198,199,64,157,192,4,208,164,85,5,192,65,187,49,245,224,217]},"announce":[],"urlList":[]}}