{"title":"Jesus: Neither God Nor Man {BBS}","uid":6963077,"size":7846583,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:98a54164363db1f8463c27b34f67cc235963508b&amp;dn=Jesus%3A+Neither+God+Nor+Man+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1326827605,"description":"___________________________________________________________________________\n    ____                   ____                            __              \n    /   )    ,             /   )    /                    /    )            \n---/__ /---------__-------/__ /----/-----------__--------\\--------__----__-\n  /    )   /   /   )     /    )   /   /   /  /___)        \\     /___) /   )\n_/____/___/___(___/_____/____/___/___(___(__(___ _____(____/___(___ _(___(_\n                 /                                                         \n             (_ /                                                          \n\n****************************************************************************\n\nMainstream biblical scholarship is far from achieving consensus in its ongoing attempt to separate the glorified Jesus of faith from the ever elusive Jesus of history. It remains to be seen how soon traditional academia will overcome its reluctance to take the plunge into the New Testament s final, uncharted territory: the theory that Christianity began with belief in a spiritual heavenly Son of God, that the Gospels are essentially allegory and fiction, and that no historical Jesus worthy of the name existed...\n\nThe Gospels and Acts of the Apostles form one small portion of the early Christian documentary record. They reflect but one category of thought and witness to what that broad movement came to believe in. Modern scholars and believers alike view the world of early Christianity through the prism of this narrow handful of inbred writings, a chain of literary dependency and enlargement on the first one written, and it has distorted all that they see. The Gospels and Acts need to be put in their proper perspective, so that they no longer obscure a more clear-eyed view of what early Christianity constituted. That view can be found in everything from the New Testament epistles to the non-canonical documents, to the writings of the Gnostics and second century apologists. Until we allow ourselves to recognize what broader factors of the era brought the idea of a Jesus into being, and how he evolved over the first 150 years, the Western world will continue to live and perpetuate a fantasy...\n\nEarl Doherty, through his website and first book, The Jesus Puzzle, is regarded by many as having given Jesus Mythicism its most legitimate and convincing expression in over a generation. Jesus: Neither God Nor Man is a new and revised expansion of that work. The product of almost three decades of study, it presents a case of unprecedented depth and lucidity for the non-existence of an historical Jesus. (The original The Jesus Puzzle will continue to be available as a condensed version of that case.) In this age of the Internet and the increased dissemination of knowledge and ideas across a wide public constituency, the true beginnings of one of the world s major religions may finally be ready to emerge.\n\n\n# Perfect Paperback: 814 pages\n# Publisher: Age of Reason Publications; First edition (October 5, 2009)\n# Language: English\n# ISBN-10: 0968925928\n# ISBN-13: 978-0968925928","torrent":{"xt":"urn:btih:98a54164363db1f8463c27b34f67cc235963508b","amp;dn":"Jesus%3A+Neither+God+Nor+Man+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98a54164363db1f8463c27b34f67cc235963508b","infoHashBuffer":{"type":"Buffer","data":[152,165,65,100,54,61,177,248,70,60,39,179,79,103,204,35,89,99,80,139]},"announce":[],"urlList":[]}}