{"title":"HTML5 Enterprise Application Development 2013","uid":8850825,"size":23582587,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:98c95d96b57af1eba807f1f1d494a3649fe885fe&amp;dn=HTML5+Enterprise+Application+Development+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"d347hBy73","files":-1,"time":1377517925,"description":"HTML5 Enterprise Application Development\n\nBook Details:\n\nPages: 332 \nPublisher: Packt Publishing (February 2013)\nLanguage: English\nISBN-10: 1849685681\nISBN-13: 978-1849685689\nFormat: PDF, EPUB\n\nBook Description:\n\nHTML5 has been a trending topic for a long time, but the lack of Flash support on iOS devices has sped up its penetration. New features in HTML5 come at a time when web developers are pushing the limits of what is achievable and HTML5, CSS3, and JavaScript have become an important alternative for building rich user interfaces.\n\nHTML5 Enterprise Application Development will guide you through the process of building an enterprise application with HTML5, CSS3, and JavaScript through creating a movie finder application. You will learn how to apply HTML5 capabilities in real development problems and how to support consistent user experiences across multiple browsers and operating systems, including mobile platforms.\n\nThis book will teach you how to build an enterprise application from scratch using HTML5, CSS3, JavaScript, and external APIs.\n\nYou will discover how to develop engaging experiences using HTML5 capabilities, including video and audio management, location services, and 3D and 2D animations. We will also cover debugging techniques, automated testing, and performance evaluations to give you all the tools needed for an efficient development workflow.\n\nHTML5 Enterprise Application Development is a comprehensive guide for anyone who wants to build an enterprise web application. You will learn through the implementation of a real-world application as we show you handy libraries, development tips, and development tools.\n\nWhat you will learn from this book:\n\nWrite easy to read HTML using semantic tags and use canvas to draw 2D and 3D elements in your browser in real time\nLearn how to create consistent experiences through multiple browsers and devices\nManage video and audio in modern browsers with no extra plugins needed\nAdd AJAX calls to your applications for loading data with no browser refresh and parallelize your JavaScript calls using web workers\nImplement drag-and-drop using HTML5 capabilities and style your enterprise application using new CSS3 properties\nDiscover the use of APIs though Twitters API examples\nLearn how to automate your test using web applications testing systems and evaluate your application performance using profiling tools\n\nApproach:\n\nA practical development tutorial, giving users step-by-step instructions to allow them to create an enterprise web application.\n\nWho this book is for:\n\nThis book is for developers who want to create enterprise web applications with engaging user experiences with no browser plugins. Basic JavaScript programming and knowledge of HTML and CSS is required. No knowledge of HTML5 or CSS3 is assumed.\n","torrent":{"xt":"urn:btih:98c95d96b57af1eba807f1f1d494a3649fe885fe","amp;dn":"HTML5+Enterprise+Application+Development+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98c95d96b57af1eba807f1f1d494a3649fe885fe","infoHashBuffer":{"type":"Buffer","data":[152,201,93,150,181,122,241,235,168,7,241,241,212,148,163,100,159,232,133,254]},"announce":[],"urlList":[]}}