{"title":"Charalambides - Joy Shapes [2004][EAC,log,cue. FLAC]","uid":8905861,"size":402755692,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:993d912ac14d90244042c61929ef54651302002c&amp;dn=Charalambides+-+Joy+Shapes+%5B2004%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":7,"time":1378860405,"description":"Artist:Charalambides\nRelease:Joy Shapes\nReleased: 2004\nLabel: Kranky\nCatalog#: 068\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle:alternative, experimental, folk, psychedelic\n\n\n1. Here, Not Here (21:54)\n2. Stroke (10:01)\n3. Joy Shapes (10:59)\n4. Natural Night (17:15)\n5. Voice for You (15:44)\n\nCharalambides are a whole thing. Over the past decade or so, in their incarnations as both a duo and as a trio, they have given us many recorded examples of how improvisation, dynamic, tension, and sonic inquiry are used to full genre-defying effect in creating a music that is as ghostly and strange as it is exciting. Joy Shapes is the band's first record in two years -- 2003's Unknown Spin was a re-release of a limited-edition CD-Rom, and as such, it shows a deepening and widening of their trio aesthetic. Along with Tom and Christina Carter, Heather Leigh Murray adds dimension and tonal possibility with her psaltery and pedal steel, as well as her voice. There are five tracks on Joy Shapes, and the length of the set is over 75 minutes. It is a wandering, sparely paced but very intense ride into a netherworld of sound, texture, and tone. The most striking element of the album is the new range of possibilities that Christina Carter's voice brings into play. She's taking chances, pushing her dynamic and harmonic range, and singing above the music now as opposed to being a part of it. The liner notes offer references to Patty Waters and Meredith Monk that are not inaccurate, and it would also be prudent to offer Linda Perhacs and the softer moments of Jeanne Lee. Her elliptical lyrics and jarring alto bring an entirely different set of possibilities to the fore -- especially as the interplay between psaltery and electric guitars is on &quot;Here Not Here,&quot; and the instrumental &quot;Stroke.&quot; The title track is perhaps the most accessible and dreamy thing here, with Murray's pedal steel slipping with a nocturnal elegance between Carter's voice and Tom Carter's hypnotic, skeletal riffing. Charalambides offer sound as an end in both composition and improvisation; they indulge it and attempt to rein it in, all the while allowing for wonderful chance occurrences of displacement, slippage, and empty space. The way the instruments begin to swirl together in a conical fashion after about five minutes is compelling in that once this contact its made, it begins to ebb and flow and undulate as it folds and glides through the mix for nearly 11 minutes. The middle section of &quot;Natural Night,&quot; where guitars and bells roll over and under one another, is an experience akin to encountering the monster in Cocteau's La Belle et la Bette for the first time: disturbing, somewhat frightening, unsettling, but it is impossible not to listen even deeper to hear the meld of textures and tones. The set closes with &quot;Voice for You,&quot; Ms. Carter's most stunning vocal appearance on a recording. Singing with Murray, who underscores her lines with wordless lilts and sparse syllables, the piece begins as a series of open-chorded drones that coruscate through the layered spaces, strings echoing in the silences, as voices come from the ether and caress them. Joy Shapes is easily the most intimate yet far-reaching offering yet from Charalambides. It is nocturnal, erotic, and marvelously innovative, yet remains an intimate and sublime work of the human heart, an undefinable spiritual consciousness, and of course, aesthetic ambition combined with musical vision.","torrent":{"xt":"urn:btih:993d912ac14d90244042c61929ef54651302002c","amp;dn":"Charalambides+-+Joy+Shapes+%5B2004%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"993d912ac14d90244042c61929ef54651302002c","infoHashBuffer":{"type":"Buffer","data":[153,61,145,42,193,77,144,36,64,66,198,25,41,239,84,101,19,2,0,44]},"announce":[],"urlList":[]}}