{"title":"Developer's Guide to Web Application Security by Syngress Publi","uid":3626115,"size":11450332,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:99d1a0e694c5c93ed0f65897f6389e83ca010312&amp;dn=Developer%5C%27s+Guide+to+Web+Application+Security+by+Syngress+Publi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tweekie","files":2,"time":1172366991,"description":"Developer&amp;#039;s Guide to Web Application Security (c) by Syngress Publishing publisher \n\nThe PDF eBook with ISBN: 159749061X and Pub Date: January 01, 2007\n  \n\nOver 75% of network attacks are targeted at the web application layer. This book \nprovides explicit hacks, tutorials, penetration tests, and step-by-step demonstrations\nfor security professionals and Web application developers to defend their most \nvulnerable applications.  This book defines Web application security, why it should be\naddressed earlier in the lifecycle in development and quality assurance, and how it \ndiffers from other types of Internet security. Additionally, the book examines the \nprocedures and technologies that are essential to developing, penetration testing \nand releasing a secure Web application. Through a review of recent Web application \nbreaches, the book will expose the prolific methods hackers use to execute Web \nattacks using common vulnerabilities such as SQL Injection, Cross-Site Scripting and \nBuffer Overflows in the application layer. By taking an in-depth look at the techniques\nhackers use to exploit Web applications, readers will be better equipped to protect \nconfidential. \n   \n   * The Yankee Group estimates the market for Web application-security \n   products and services will grow to $1.74 billion by 2007 from $140 \n   million in 2002  \n   \n   * Author Matt Fisher is a highly sought after speaker who regularly \n   delivers Web Application presentations at leading conferences including: \n   Black Hat, TechnoSecurity, CanSec West, Shmoo Con, Information Security, \n   RSA Conferences, and more  \n   \n   * The Companion Web site will have downloadable code and scripts \n   presented in the book","torrent":{"xt":"urn:btih:99d1a0e694c5c93ed0f65897f6389e83ca010312","amp;dn":"Developer%5C%27s+Guide+to+Web+Application+Security+by+Syngress+Publi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99d1a0e694c5c93ed0f65897f6389e83ca010312","infoHashBuffer":{"type":"Buffer","data":[153,209,160,230,148,197,201,62,208,246,88,151,246,56,158,131,202,1,3,18]},"announce":[],"urlList":[]}}