{"title":"[XviD - Eng Ac3 - Sub Ita Eng Esp] Auschwitz:The Nazis And The F","uid":5210755,"size":734410236,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:99e5405f7259a37bf67972d7f125d1d051d95858&amp;dn=%5BXviD+-+Eng+Ac3+-+Sub+Ita+Eng+Esp%5D+Auschwitz%3AThe+Nazis+And+The+F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pir84u","files":4,"time":1260581021,"description":"[XviD - Eng Ac3 - Sub Ita Eng Esp] Auschwitz - The Nazis And The Final Solution S01e01 [Tntvillage.Scambioetico]\n\n[b]Visit this link: [url=http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=Auschwitz:The%20Nazis%20And%20The%20Final%20Solution%20S01e01&amp;sb=1&amp;sd=0&amp;cat=0]More info on this torrent[/url][/b]\n\n[b]Visit this link: [url=http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=pir8&amp;sb=1&amp;sd=0&amp;cat=0]All My Torrent[/url][/b]\n\n[b]Auschwitz:The Nazis And The Final Solution[/b]\n[img]http://img130.imageshack.us/img130/3513/10auschwitzthenazisandt.jpg[/img]\nPlot\nWith a number of recent high profile Hollywood films such as Schindler's List and The Pianist and iconic books such as The Diary of Anne Frank it is easy to assume that everyone is familiar with the Holocaust and Auschwitz.\n\nYet a recent BBC survey suggests that almost half the adult population (45%) claim to have never even heard of Auschwitz.\n\nAmongst women and people aged under 35 the figure is even higher at 60%.\n\nEven among those who have heard of Auschwitz, 70% felt that they did not know a great deal about the subject.\n\nMost of them (76%) were unaware of its roots as a concentration camp for Polish political prisoners; the majority (74%) did not know that people other than Jews were killed there and only a few recognised the name of the camp commandant or knew who finally liberated the camp at the end of the war.\n\nThe BBC's research informs a definitive new series which has been made to mark the 60th anniversary of the liberation of Auschwitz in January 2005.\n\nWritten and produced by Bafta Award-winning producer Laurence Rees, Auschwitz: The Nazis &amp; the 'Final Solution' offers a unique perspective on the camp in which more than one million people were ruthlessly murdered.\n\n&quot;We were amazed by the results of our audience research&quot; says series producer Laurence Rees. &quot;It's easy to presume that the horrors of Auschwitz are engrained in the nation's collective memory but obviously this is not the case.\n\n&quot;We were particularly startled by the fact that less than 40% of younger people have even heard of Auschwitz.\n\n&quot;The research reinforced the importance of making this series and trying to ensure the atrocities that unfolded at Auschwitz are never forgotten.&quot;\n\nThe series is the result of three years of in-depth research, drawing on the close involvement of world experts on the period, including Professors Sir Ian Kershaw and David Cesarani.\n\nIt is based on nearly 100 interviews with survivors and perpetrators, many of whom are speaking in detail for the first time.\n\nSensitively shot drama sequences, filmed on location using German and Polish actors, bring recently discovered documents to life on screen, whilst specially commissioned computer images give a historically accurate view of Auschwitz-Birkenau at all its many stages of development.\n\n&quot;The name Auschwitz is quite rightly a byword for horror,&quot; says Laurence Rees. &quot;But the problem with thinking about horror is that we naturally turn away from it.\n\n&quot;Our series is not only about the shocking, almost unimaginable pain of those who died, or survived, Auschwitz. It's about how the Nazis came to do what they did.\n\n&quot;I feel passionately that being horrified is not enough. We need to make an attempt to understand how and why such horrors happened if we are ever to be able to stop them occurring again.&quot;\n\nThe BBC will be marking Holocaust Memorial Day (27 January 2005) with a number of other television and radio programmes, including a live event on the day, an international musical performance in and around the museum of Auschwitz-Birkenau, and a documentary that traces one woman's story of survival told through her grandson's eyes.\n\nNotes to Editors\n\nThe research findings were based on a nationally representative postal survey of 4,000 adults aged 16+ conducted by IPSOS RSL as part of their weekly Quest survey.\n\nAll respondents recruited were mailed a questionnaire to complete covering a number of topics, with quota controls imposed, within region, by age within sex and social class.\n\nFieldwork was conducted during February 2004. \n\nScreenshots\n[url=http://img130.imageshack.us/i/bbcauschwitzthenazisand.png/][img]http://img130.imageshack.us/img130/301/bbcauschwitzthenazisand.th.png[/img][/url]\n\nTech Sheet\n[b]Nome File: BBC.Auschwitz.The.Nazis.and.the.Final.Solution.1of6.avi[/b]\n[b]Dimensione: 734,253,056 Bytes[/b]\n[b]Durata: 47:22.320[/b]\n\n[b]Video Codec: XviD 1.2 SMP[/b]\n[b]Video Bitrate: 1835 kb/s[/b]\n[b]Risoluzione: 720x400[/b]\n[b]FPS (Frames/sec): 25.000[/b]\n[b]QF (Frame quality): 0.255 b/px[/b]\n\n[b]Audio Codec: 0x2000 (Dolby AC3) AC3[/b]\n[b]Audio Bitrate: 224 kb/s[/b]\n[b]Freq Audio: 48000 Hz[/b]\n\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:99e5405f7259a37bf67972d7f125d1d051d95858","amp;dn":"%5BXviD+-+Eng+Ac3+-+Sub+Ita+Eng+Esp%5D+Auschwitz%3AThe+Nazis+And+The+F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99e5405f7259a37bf67972d7f125d1d051d95858","infoHashBuffer":{"type":"Buffer","data":[153,229,64,95,114,89,163,123,246,121,114,215,241,37,209,208,81,217,88,88]},"announce":[],"urlList":[]}}