{"title":"Antipasti by Joyce Goldstein","uid":9683850,"size":6191260,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9a30c7f75fd4fe950d6fdb3874f56ad3543e0fe1&amp;dn=Antipasti+by+Joyce+Goldstein&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":1,"time":1393716758,"description":"\nWith growing numbers of restaurants specializing in &quot;small plates,&quot; the antipasto is back in style. These little dishes of savory appetizers or small first courses (perfect cocktail food) whet the appetite, enticing the palate for the meal to comeand can even become the meal itself. In Antipasti, Joyce Goldstein reveals the history of antipasti and a host of very delicious recipes. \n\nWhat could be better suited to a La Dolce Vitainspired event replete with sparkling Bellinis than sun-dried tomatotopped crostini, little panzerotti (pastries stuffed with Gruyre and ham), or prosciutto-wrapped shrimp? \n\nFor easier fare, a snap to prepare, there is an entire chapter on Shop and Serve antipastimolto tasty recipes that use high quality store-bought foods such as roasted peppers, olives, soft creamy cheeses, and crusty artisan breads that anyone can throw together for a last minute appetizer or elegant snack. \n\nWhether it's bite-sized pieces of Parmigiano-Reggiano cheese drizzled with balsamic vinegar to serve before a dinner party or a more substantial first course of roasted duck breast salad, Antipasti welcomes everyone to the table.\n\nGenre: Non-Fiction, Cookery","torrent":{"xt":"urn:btih:9a30c7f75fd4fe950d6fdb3874f56ad3543e0fe1","amp;dn":"Antipasti+by+Joyce+Goldstein","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a30c7f75fd4fe950d6fdb3874f56ad3543e0fe1","infoHashBuffer":{"type":"Buffer","data":[154,48,199,247,95,212,254,149,13,111,219,56,116,245,106,211,84,62,15,225]},"announce":[],"urlList":[]}}