{"title":"May Roosevelt...Haunted(2011)[FLAC]","uid":6581131,"size":238593463,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9a317a0035a905f2e49f40facb65121003d865b2&amp;dn=May+Roosevelt...Haunted%282011%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":13,"time":1312405746,"description":"[img]http://i240.photobucket.com/albums/ff298/SUK_ME/62444204351153173153.jpg[/img]\n[color=LimeGreen]Haunted [2011][/color]\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n1. The Unicorn Died 2:32\n2. Oomph 4:16\n3. Vow 4:39\n4. Dark the Night 6:10\n5. Mass Extermination 4:05\n6. Young Night Thought 4:59\n7. Chasm 5:59\n8. Outcry 4:37\n\nMay Roosevelt's new album &quot;Haunted&quot; opens doors to phantoms of the past. The work's eight musical compositions are supernatural entities of modern technology that hover in the air, bursting open the chest of rustic tradition only to be transformed into rhythms of Greek dances.\n\nFollowing &quot;Panda, a story about love and fear&quot;, composer and thereminist May Roosevelt uncovers a dark and reclusive universe defined by motion and dance. &quot;Haunted&quot; starts with the zeibekiko dance rhythm in 'The Unicorn Died', which was composed and presented for the first time in London at the Red Bull Music Academy in February 2010. The original idea evolved through an intense speculation about the place held by traditional Greek rhythms in the canon of Greek electronic music. This exploration subsequently led to the creative transformation of eight different Greek dances presented in &quot;Haunted&quot;.\n\nThe Theremin, a very complex instrument yet absolutely submissive to the hands of May Roosevelt, was used to create a plethora of curious sounds ranging from wind and stringed instruments to an imitation of human voice. The Theremin's unique sound also shifted from a bagpipe (in 'Oomph') to a Pontic Lyre (in 'Mass Extermination'), and from a clarinet (in 'Vow') into a violin (in 'Dark the Night'). Through the use of electronic beats to form each rhythm alongside synthesizers and vocals, May Roosevelt attempts to embed anew Greek musical idioms within contemporary music while retaining all their respectable characteristics.\n\nThe title &quot;Haunted&quot; - inspired by the idea of hauntology, introduced by French philosopher Jacques Derrida - defines the concept and underscores the character of the compositions: The phantoms of the past and the spirit of future, mingled, haunt the music of May Roosevelt.\n\ncd ripped by EAC\n\nplease seed\n\n[url]http://dickthespic.org/2011/06/13/may-roosevelt/[/url]","torrent":{"xt":"urn:btih:9a317a0035a905f2e49f40facb65121003d865b2","amp;dn":"May+Roosevelt...Haunted%282011%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a317a0035a905f2e49f40facb65121003d865b2","infoHashBuffer":{"type":"Buffer","data":[154,49,122,0,53,169,5,242,228,159,64,250,203,101,18,16,3,216,101,178]},"announce":[],"urlList":[]}}