{"title":"Comedy - A Southern Belle Primer - Maryln Schwartz","uid":4201867,"size":28029043,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9bf20392a014005280bb7ad7d53a664d85d6a6ed&amp;dn=Comedy+-+A+Southern+Belle+Primer+-+Maryln+Schwartz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":3,"time":1211548138,"description":"A Southern Belle Primer: Why Princess Margaret Will Never Be a Kappa Kappa Gamma\n\nBy Maryln Schwartz\n\nThere are very few books about which I would claim it is better to listen to it than to read it. This recording is such an example. Read by DESIGNING WOMEN actress Dixie Carter, she brings a drawl and character to this humor that could ONLY be had from an authentic Southern Belle. If you know anybody who is from the American South, this recording will have them howling. \n\nKeep in mind that there is an updated version to cover events of the last 20 odd years, and I do not doubt this recording will prompt some of you to buy it as a gift for that Southern Belle you happen to know. I include below the review from Amazon, as well as a review written by a Belle that does more to promote the book than I ever could.\n\nEditorial Reviews\nProduct Description\nThe Southern belle lives on, in a world of  proprieties and protocols that would shame the Royal  Family (and have). An uproarious guide to the  manners, mores, and mystique of the legendary ladies of  the South. What The Official Preppy  Handbook did for the madras-and-penny-loafer  set, A Southern Belle Primer  does for the indestructible ladies from below the  Mason-Dixon line. \n\nFrom the Publisher\nThe Southern belle lives on, in a world of proprieties and protocols that would shame the Royal Family (and have). An uproarious guide to the manners, mores, and mystique of the legendary ladies of the South. What The Official Preppy Handbook did for the madras-and-penny-loafer set, A Southern Belle Primer does for the indestructible ladies from below the Mason-Dixon line. \n\nProduct Details\n?\tPaperback: 144 pages \n?\tPublisher: Main Street Books; 1 edition (August 1, 1991) \n?\tLanguage: English \n?\tISBN-10: 0385416679 \n?\tISBN-13: 978-0385416672 \n\nI would give it six stars, but that wasn&amp;#039;t an option, May 16, 2001 \nBy \t&quot;whitneybelle&quot;  (Spartanburg, South Carolina)\n\nAfter finishing my freshman year at Duke University, I was a little confused as to why most of the people I met were surprised when they found out that I had already chosen my silver pattern (Francis I) and that I was actually looking forward to Rush Week. And when I came back to the dorm incensed one afternoon because I had had to stand up on the bus while young men were sitting down, these same friends just stared blankly at me. After coming home for the summer and complaining to a fellow belle about my confusion and their inability to sympathize, she told me to read this lovely book. After doing so, I felt once again that all was right with the world. Mrs. Schwartz ratifies my southern belle credo like nobody&amp;#039;s business. She also presented many things that I had always known but was never aware that I had known, like why it was WRONG to wear red during rush, and why I was scandalized to see women going to class in pajamas. Many of my Yankee girlfriends considered my outlook on life to be somewhat superficial, but after reading this book I realized that this is because they were never taught to &quot;sparkle&quot; and because they were not raised to believe with all their hearts that they were princesses. A SOUTHERN BELLE PRIMER is a must-read for anyone looking for re-affirmation of his or her southern views, or for anyone confused about what that southern heritage actually is.\n\nThis version - http://www.amazon.com/Southern-Belle-Primer-Princess-Margaret/dp/0385416679/ref=pd_bbs_sr_1?ie=UTF8&amp;s=books&amp;qid=1211534336&amp;sr=8-1\n\nUpdated VErsion - http://www.amazon.com/Southern-Belle-Primer-Paris-Hilton/dp/0767925270/ref=sr_1_2?ie=UTF8&amp;s=books&amp;qid=1211535365&amp;sr=1-2","torrent":{"xt":"urn:btih:9bf20392a014005280bb7ad7d53a664d85d6a6ed","amp;dn":"Comedy+-+A+Southern+Belle+Primer+-+Maryln+Schwartz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9bf20392a014005280bb7ad7d53a664d85d6a6ed","infoHashBuffer":{"type":"Buffer","data":[155,242,3,146,160,20,0,82,128,187,122,215,213,58,102,77,133,214,166,237]},"announce":[],"urlList":[]}}