{"title":"BlacksOnBlondes - Natasha Starr HD 720","uid":7752076,"size":780749913,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:9c548dcca47d5ecfd74cdf112bc5958b8882d7d1&amp;dn=BlacksOnBlondes+-+Natasha+Starr+HD+720&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"R0thschild","files":1,"time":1350991158,"description":"Gallery: \n &lt;a href=&quot;\nhttp://imagedomino.com/?g=118719&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imagedomino.com/?g=118719&lt;/a&gt;\n\nThe blazing sun has no affect on Rico Strong's and Lee Bangg's ability to pick up white girls. Natasha Starr is looking for a bus\nand her cell phone is dead. Natasha Starr's double whammy soon turns into a double-dicking courtesy of some American big black cocks. Natasha Starr\nloses her innocence when she tells both guys that she has something clogging up her Polish booty. Rico and Lee nearly lose their minds when she bends\nover and shows them that, she um, wasn't shitting them. Natasha's search for a bus is temporarily halted when two black freight trains take turns\njabbing her throat. Natasha Starr gets blitzkrieged by both huge black cocks and this interracial threesome melts gets underway. Natasha Starr works\non one huge cock while the other invades her pussy until it nearly collapses from the onslaught. The princess from Poland takes it up a notch by\nhaving her ass and pussy slammed at the same time. The make-up slowly begins to melt and the outside sun's affects have nothing on what Rico and Lee\nare doing to this lost foreign whore. The constant friction from both gigantic black cocks bring Natasha to her knees in order to pray for a couple\nof huge loads of black gravy. Rico and Lee leave no part of Natasha Starr's face void of black nutsauce, and Natasha's phone is fully charged again.\nNatasha won't be able to call a cab because they no longer come to this part of the &quot;hood&quot;.","torrent":{"xt":"urn:btih:9c548dcca47d5ecfd74cdf112bc5958b8882d7d1","amp;dn":"BlacksOnBlondes+-+Natasha+Starr+HD+720","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c548dcca47d5ecfd74cdf112bc5958b8882d7d1","infoHashBuffer":{"type":"Buffer","data":[156,84,141,204,164,125,94,207,215,76,223,17,43,197,149,139,136,130,215,209]},"announce":[],"urlList":[]}}