{"title":"The Thieves 2012 XviD XYZ","uid":7927940,"size":734511104,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9c6e70235f33c74d6a22efc26d49e56e3ae55260&amp;dn=The+Thieves+2012+XviD+XYZ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"krdramasorg","files":1,"time":1355630346,"description":"Plot\n\nPopie (Lee Jung-Jae), Yenicall (Gianna Jun), Chewingum (Kim Hae-Suk) and Zampano (Kim Soo-Hyun) are a team of professional thieves in South Korea. After they score a valuable antique vase, they hear from Macao Park (Kim Yun-Seok) in which he proposes a highly lucrative new job in Macau. Meanwhile, Pepsee (Kim Hye-Soo) is released from prison on a special pardon.\nA few years back Macao Park, Pepsee and Popie worked together as a crew. Macao Park and Pepsee were also in a romantic relationship. Then, while stealing gold bars, Macao Park's cable snapped in a elevator shaft and he disappeared with the gold bars. Pepsee was arrested shortly afterwards.\nNow, Popie, Yenicall, Chewinggum and Zampano head off to Hong Kong to work with Macao Park. What Macao Park doesn't know is that Pepsee is also coming with them.\nIn Hong Kong, a separate crew awaits for the Korean thieves. The four Hong Kong thieves consists of Chen (Simon Yam), Andrew (Oh Dal-Su), Julie (Angelica Lee) and Johnny (Kwok Cheung Tsang). When the Hong Kong and Korean teams finally meet, tension rises immediately between the two groups. Macao Park then enters the meeting and lays out the plan. Their goal is to steal the &quot;Tear of Sun&quot; diamond. The diamond itself is currently in the possession of ruthless criminal Wei Yong. Furthermore, the diamond is stashed safely in the suite room of a Macau casino &amp; resort. Macao Park also lays another bombshell. He can easily sell the &quot;Tear of Sun&quot; diamond for $20 million dollars.\nNow the two teams work together in what will surely turn out to be the heist of their lives, but the 10 thieves all have their own agendas.","torrent":{"xt":"urn:btih:9c6e70235f33c74d6a22efc26d49e56e3ae55260","amp;dn":"The+Thieves+2012+XviD+XYZ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c6e70235f33c74d6a22efc26d49e56e3ae55260","infoHashBuffer":{"type":"Buffer","data":[156,110,112,35,95,51,199,77,106,34,239,194,109,73,229,110,58,229,82,96]},"announce":[],"urlList":[]}}