{"title":"Falls from Height - A Guide to Rescue Planning (gnv64)","uid":8804741,"size":12647974,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9d8f9784a95aa03cccc27aac5d1ff1ba7a01c2a7&amp;dn=Falls+from+Height+-+A+Guide+to+Rescue+Planning+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":-1,"time":1376301547,"description":"Falls from Height - A Guide to Rescue Planning\nby Loui McCurley\nWiley | June 2013 | ISBN-10: 1118094808 | PDF | 376 pages | 12 mb &lt;a href=&quot;\nhttp://www.amazon.com/Falls-Height-Guide-Rescue-Planning/dp/1118094808&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Falls-Height-Guide-Rescue-Planning/dp/1118094808&lt;/a&gt;\n\nEnables workplace responders to prepare for and respond to falls from height\nHow do you rescue someone suspended in midair or trapped above ground? Author Loui McCurley, an expert in technical rope rescue with more than twenty-five years of experience, has the answers. Following her tested and proven advice, readers will learn how to prepare for and safely rescue &quot;at-height&quot; workers and others from &quot;falls from height.&quot; The book fully bridges the gap between planning and execution, steering readers toward simple workplace-specific solutions. Moreover, it explains how to develop and implement a comprehensive protection program, enabling all organizations and their employees to fully prepare themselves to respond to a fall from height.\n\nFalls from Height is divided into four parts:\n-    Part I: Regulatory Considerations, Rescue Plans, and Developing a Rescue Capability underscores the need for a rescue program, explaining how to fully leverage available resources to optimize the program.\n-    Part II: Equipment, Systems, and Skills details the skills that all rescuers should have and the equipment they need to perform a rescue at height.\n-    Part III: Putting It All Together discusses principles of rigging, single-rescuer methods, and group-rescuer methods.\n-    Part IV: Successful Workplace Planning examines the unique challenges of different workplace environments and then offers a step-by-step guide for implementing the book's recommendations.\n\nBased on the premise that a fallen worker must be rescued quickly and efficiently, without putting others in harm's way, Falls from Height is a must for all workplace responders, enabling them to prepare for and respond to fall victims like experienced rescuers.\n\nAbout the Author &lt;a href=&quot;\nhttp://www.verticalrescuesolutions.com/uploaded-files/BioPics/LouiMcCurley.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.verticalrescuesolutions.com/uploaded-files/BioPics/LouiMcCurley.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://www.verticalrescuesolutions.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.verticalrescuesolutions.com/&lt;/a&gt;\nLoui McCurley is Vice President of Pigeon Mountain Industries and Vertical Rescue Solutions and is an experienced rescue professional and certified rope access technician. A rescuer, instructor, conference speaker, and contributor to such publications as Occupational Health &amp; Safety, High Angle Rescue Techniques, and Wilderness Medicine, Ms. McCurley is dedicated to bringing at-height safety to industry. In addition to serving as President and Regulatory Assistance Chairman for the Society of Professional Rope Access Technicians, Ms. McCurley is actively involved in standards development for ANSI, ASTM, NFPA, and other organizations.\n","torrent":{"xt":"urn:btih:9d8f9784a95aa03cccc27aac5d1ff1ba7a01c2a7","amp;dn":"Falls+from+Height+-+A+Guide+to+Rescue+Planning+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d8f9784a95aa03cccc27aac5d1ff1ba7a01c2a7","infoHashBuffer":{"type":"Buffer","data":[157,143,151,132,169,90,160,60,204,194,122,172,93,31,241,186,122,1,194,167]},"announce":[],"urlList":[]}}