{"title":"Keller - Teenage Wasteland (eng subs) [2005]  Eva Urthaler","uid":6872712,"size":988584887,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9dea868985c5d19ecd4b791dda1790cbe66ef09d&amp;dn=Keller+-+Teenage+Wasteland+%28eng+subs%29+%5B2005%5D++Eva+Urthaler&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1323322893,"description":" &lt;a href=&quot;http://bayimg.com/jALABAade&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/jALABAade&lt;/a&gt;\n\nOut of Hand (2005) \n\nKeller - Teenage Wasteland (original title) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0470832/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0470832/&lt;/a&gt;\n\nDirector: Eva Urthaler\n\nGerman language with hard English subtitles\n\nHere's a nasty little German story of teens gone bad. Adolescent hijinks spin out of control in Out of Hand when two boys bored with shoplifting liquor bottles from a convenience store decide to shoplift the pretty cashier instead. It's quite a leap from petty crime to kidnapping, but they make it effortlessly. \n\nBlame Sebastian (Sergej Moya), the badder of the two bad boys. Charismatic and fun, he easily charms his buddy Paul (Ludwig Trepte), a more nervous kid who loves little thrills but is prone to ask 'Are you sure we can get away with this?' No problem, Sebastian typically responds. Let's have some fun.\n\nIt's not as much fun for the unnamed woman in peril. Young and pretty, she has no idea what hits her (the butt of a gun, which is deployed to hit many people many times throughout the movie). Next thing she knows, she's tied to a lawn chair in a bunker in an abandoned army base, with Sebastian and Paul leering at her. Now that they've gotten her there -- the hard part of the operation -- they're not sure what to do with her. Rape would seem the obvious thing, but instead they toy with her. Sebastian makes her as uncomfortable as possible while Paul immediately feels pity and tries to comfort her when his friend is looking the other way.\n\nDays pass and the woman suffers, and she wonders out loud what's supposed to happen next. Paul and Sebastian truly don't know. They forgot to plan ahead, and now they're criminals without a way out of their master plan. At the same time, a little psychosexual drama unfolds, as Paul falls for the victim and Sebastian falls for Paul. This little triangle could get messy because the last thing you want to do to the unstable Sebastian is get his jealousy fired up.\n\nIt's interesting how the movie puts itself into a long holding pattern, leaving you wondering how it will resolve. Eventually it will take a misguided trip back to town by Paul to force an exciting and ugly climax.\n\nGiven that in Hollywood it's usually male writers and directors who like to see women tied up, it's interesting to note that Out of Hand is helmed by Eva Urthaler. While it's not exactly a story of a brave woman conquering her two assailants, the victim does exhibit some smarts and 'girl power' in trying to stay alive, no small trick given Sebastian's rapidly crumbling sanity.\n\nThis is a disturbing and powerful first film from a woman director who did no other films before that and went to no film school. You can't tell from the film. It looks like the work of an experienced professional who knows exactly how to direct the cast and use the language of film to get the desired effects. Two teenage boys meet and strike up a friendship in a short time. They are caught stealing in a supermarket by an employee, a young woman. They are thrown out by her. They follow her home... In no time the boys and we, the audience, enter another world as Jeffrey does in &quot;Blue Velvet&quot;. A disturbing world of the human mind where the lines between victim and perpetrator, right and wrong, the normal and the abnormal start to dissolve. The film is deeply disturbing because it goes to extremes, but stays believable, even plausible till the end. The cast is excellent throughout. No doubt this film will be controversial which might cost it the main prize here at Locarno. But on day one we have already seen what might be the most important film in the competition this year. \n\n","torrent":{"xt":"urn:btih:9dea868985c5d19ecd4b791dda1790cbe66ef09d","amp;dn":"Keller+-+Teenage+Wasteland+%28eng+subs%29+%5B2005%5D++Eva+Urthaler","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9dea868985c5d19ecd4b791dda1790cbe66ef09d","infoHashBuffer":{"type":"Buffer","data":[157,234,134,137,133,197,209,158,205,75,121,29,218,23,144,203,230,110,240,157]},"announce":[],"urlList":[]}}