{"title":"Radiohead - House Of Cards (2nafish)","uid":5980296,"size":169318404,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9e7fe7265e0712c8636759876fe535f08fe1f945&amp;dn=Radiohead+-+House+Of+Cards+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1290567590,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;House of Cards&quot; is a song by English alternative rock band Radiohead and is the eighth track on their 2007 album In Rainbows. The song was released alongside &quot;Bodysnatchers&quot; as a promotional single and video from In Rainbows in late June 2008.\n\nThe music video features clips of Thom Yorke's face as well as those of several other people, interspersed with images of suburban landscapes, and people coming and going at a party. In lieu of traditional cameras, the video is made with lidar technology which detects the proximity of objects from the sensor. This gives the video a grainy and grid-like appearance. Sheets of acrylic glass and mirrors are passed in front of the lasers to create scenes in which the image appears distorted, partially disappears, or begins to disintegrate as if being carried by wind.\n\nThe video was made on a minimal set in Florida. The data used to make the video was released under Creative Commons Attribution-Noncommercial-Share Alike 3.0 license and is available at Google Code.\n\nThe song was nominated for three Grammys for the 51st Grammy Awards: Best Rock Performance by a Duo or Group with Vocal, Best Rock Song and Best Short Form Music Video.\n\nIn Rainbows is the seventh studio album by English alternative rock band Radiohead. It was first released on 10 October 2007 as a digital download that customers could order for whatever price they saw fit, followed by a standard CD release in most countries during the last week of 2007. The album was released in North America on 1 January 2008. In Rainbows was Radiohead's first release after the end of their contract with EMI and the end of the longest gap between studio albums in their career.\n\nRecording with producers Mark Stent and Nigel Godrich, Radiohead worked on In Rainbows for more than two years, beginning in early 2005. In between recording, the band toured Europe and North America for three months in mid-2006. The songwriting on In Rainbows was more personal than that on Radiohead's other albums, with singer Thom Yorke describing most tracks as his versions of &quot;seduction songs&quot;. Radiohead incorporated a wide variety of musical styles and instruments on the album, using not only electronic music and string arrangements, but also pianos, celestes, and the ondes Martenot.\n\nUpon its retail release, In Rainbows entered the UK Album Chart and the U.S. Billboard 200 at number one; by October 2008, it had sold more than three million copies worldwide in both digital and physical formats. The album earned widespread critical acclaim, and was ranked as one of the best albums of 2007 by several publications. In 2009, the record won two Grammy Awards for Best Alternative Music Album and Best Special Limited Edition Package.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:9e7fe7265e0712c8636759876fe535f08fe1f945","amp;dn":"Radiohead+-+House+Of+Cards+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e7fe7265e0712c8636759876fe535f08fe1f945","infoHashBuffer":{"type":"Buffer","data":[158,127,231,38,94,7,18,200,99,103,89,135,111,229,53,240,143,225,249,69]},"announce":[],"urlList":[]}}