{"title":"Robert B. Parker - Blue Screen","uid":4787847,"size":447689772,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9f272cf32596244784705182aa003dc69d715e44&amp;dn=Robert+B.+Parker+-+Blue+Screen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"g-roid","files":-1,"time":1237613413,"description":"ROBERT B. PARKER\n\nBlue Screen\n\nA Sunny Randall Novel\n\n\nSunny Randall, the Boston P.I. with a personal life as tangled as that of her clients, is hired on as bodyguard to an up-and-coming starlet, and discovers some ugly truths behind her glossy facade.\n \nBuddy Bollen is a C-list movie mogul who made his fortune producing films of questionable artistic merit. When Buddy hires Sunny Randall to protect his rising star and girlfriend, Erin Flint, Sunny knows from the start that the prickly, spoiled beauty won't make her job easy. And when Erin's sister, Misty, is found dead in the lavish home they share with sugar daddy Bollen, there doesn't seem to be a single lead worth pursuing.\n\nBut then Sunny meets Jesse Stone, chief of police in Paradise, Massachusetts, under whose jurisdiction the case falls. It immediately becomes clear that Jesse and Sunny have much in common. While searching for the killer, they learn an awful lot about each other--and themselves.\n \nTracking Misty's murderer reveals a host of seedy complications behind Erin's glamorous lifestyle as well as Buddy Bollen's entertainment empire, made up of shady film deals and mobsters out for revenge. But in a world where there's little difference between the good guys and the bad, exposing the killer could prove to be Sunny's undoing. \n\nROBERT B. PARKER is the author of more than fifty books. He lives in Boston.\n\nRead by: Kate Burton\n\nFrom 5 Audio CDs at 160 kbps in MP3 format.\n\n","torrent":{"xt":"urn:btih:9f272cf32596244784705182aa003dc69d715e44","amp;dn":"Robert+B.+Parker+-+Blue+Screen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f272cf32596244784705182aa003dc69d715e44","infoHashBuffer":{"type":"Buffer","data":[159,39,44,243,37,150,36,71,132,112,81,130,170,0,61,198,157,113,94,68]},"announce":[],"urlList":[]}}