{"title":"El informe de Judea [ebook].","uid":6085510,"size":7117144,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a067249d60bf2102272b3f7d9dd39f399fd51d38&amp;dn=El+informe+de+Judea+%5Bebook%5D.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zurera","files":-1,"time":1294309702,"description":"El magistrado Julio Varo viaja hasta Judea cuarenta aÃƒÂ±os despuÃƒÂ©s de la muerte de JesÃƒÂºs, con la peligrosa misiÃƒÂ³n de demostrar que ÃƒÂ©ste jamÃƒÂ¡s resucitÃƒÂ³. Su informe confidencial podrÃƒÂ­a cambiar el curso de la historia. Tras su periplo investigatorio irÃƒÂ¡ encontrando distintos personajes que avalarÃƒÂ¡n su controvertido informe, aunque en las sombras se oculta un siniestro personaje empeÃƒÂ±ado en impedir la publicaciÃƒÂ³n del mismo...\n\n\n\nMientras Roma intenta controlar a un grupo de insurrectos judÃƒÂ­os denominados &quot;los nazareos&quot;,cuyo populismo amenaza la integridad de Imperio, el poder romano abre una investigaciÃƒÂ³n que podria acabar con este movimiento fomentando la duda en torno a los pilares que lo sustentan. La muerte y resurrecciÃƒÂ³n de Jesucristo es la base del dogma de fe que mueve a estos nazareos, si se desmonta la resurrecciÃƒÂ³n de JesÃƒÂºs Ã‚Â¿quÃƒÂ© les queda?.\n\nLa ardua tarea de investigaciÃƒÂ³n no es fÃƒÂ¡cil, dado que la mayoria de los testigos han muerto cuarenta aÃƒÂ±os atrÃƒÂ¡s o son tan mayores que sus memorias flaquean,sin contar con los interesados porque el informe nunca llegue a Roma. Pero Julio Varo acompaÃƒÂ±ado de un fuerte despliegue militar, no cejarÃƒÂ¡ en el empeÃƒÂ±o de desarrollar su labor de investigaciÃƒÂ³n y estÃƒÂ¡ dispuesto de llegar hasta el final y esclarecer si la resurrecciÃƒÂ³n de JesÃƒÂºs fue obra del poder divino o una conspiraciÃƒÂ³n para sustentar la veracidad de un mito.\n","torrent":{"xt":"urn:btih:a067249d60bf2102272b3f7d9dd39f399fd51d38","amp;dn":"El+informe+de+Judea+%5Bebook%5D.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a067249d60bf2102272b3f7d9dd39f399fd51d38","infoHashBuffer":{"type":"Buffer","data":[160,103,36,157,96,191,33,2,39,43,63,125,157,211,159,57,159,213,29,56]},"announce":[],"urlList":[]}}