{"title":"Mike Oldfield - Incantations TQMP","uid":4825477,"size":492875140,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a088158a1b365d0ea2c9e94bae6f1b54d0e2bc78&amp;dn=Mike+Oldfield+-+Incantations+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zootallure","files":15,"time":1238931467,"description":"Incantations is a double album, released in late 1978 It was his fourth studio album, and the first to feature a piece divided into more than two movements.\n\nThe current CD issue fits the entire album onto one disc. It is the second longest work Oldfield has ever released.\n\nDespite being the most large-scale work by Oldfield, many moments of the album can be described as being compositionally minimalist, featuring melodic lines repeated in simple forms with only a few instruments at a time.\n\nIncantations was recorded at Througham, Mike Oldfield's home after he completed Ommadawn. It was his desire to create an album that would make use of a small orchestra, and some of his own statements indicate that he may have moved into his new house simply because it had room for one. He had used &quot;extra-instrumental&quot; ensembles previously, such as the brass ensemble on Ommadawn and the string/choir group on Hergest Ridge before that, but they form a major part of Incantations.\n\nIt was during the creation of Incantations that Mike Oldfield underwent the assertiveness training course &quot;Exegesis&quot;, and between the earlier parts and the later parts of the album there is a definite difference in style, possibly due to the course. The course may have had added effects to bolster his confidence, as it was almost immediately thereafter that Oldfield went on his first live tour with Incantations.\n\nThe lyrics in &quot;Part Two&quot; are taken from Longfellow's &quot;The Song of Hiawatha&quot;, though rearranged in places to conform more to the music.\n\nThe lyrics in &quot;Part Four&quot; are Ben Jonson's &quot;Ode to Cynthia&quot; from Cynthia's Revels, but adjusted again to match the music.\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at: &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)\n\n","torrent":{"xt":"urn:btih:a088158a1b365d0ea2c9e94bae6f1b54d0e2bc78","amp;dn":"Mike+Oldfield+-+Incantations+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a088158a1b365d0ea2c9e94bae6f1b54d0e2bc78","infoHashBuffer":{"type":"Buffer","data":[160,136,21,138,27,54,93,14,162,201,233,75,174,111,27,84,208,226,188,120]},"announce":[],"urlList":[]}}