{"title":"Coast to Coast AM December 17 2012","uid":7935620,"size":55698733,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:a1d56744f52d99195b89b05b5bde7de5fbee8153&amp;dn=Coast+to+Coast+AM+December+17+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1355838436,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t12-17-12\nHost: \tGeorge Noory\nGuests: \tJim Vieira, Greg Hunter\n\nStonemason and historical detective, Jim Vieira, discussed the ceremonial stone structures of North America including mounds, walls and star cities, as well as the archaeological evidence for giants that existed in ancient America, and the complex explanation for how this evidence could possibly be covered up. &quot;There are structures of earth and stone, thousands of years old, in every part of the United States,&quot; Vieira marveled. While he has found over 10,000 stone mounds around Massachusetts alone, he lamented that many great works were dismantled during colonial times as settlers used the materials for their roads and bridges. For instance, Vieira cited an archaeologist's report of a 55-foot high stone pyramid in Illinois that had been plundered by colonists, who removed &quot;tens of thousands of cartloads of stone.&quot;\n\nRegarding giants in America, Vieira explained that, while searching through old town histories in Massachusetts for information on stone structures, he stumbled upon remarkable accounts of anomalous human skeletons being discovered. According to the reports from the time, the skeletons ranged from 7 to 11 feet tall and had skulls which sported double rows of teeth. &quot;There are thousands of these accounts,&quot; Vieira said, &quot;by doctors, scientists, anthropologists, archaeologists, farmers and over decades and decades of time all around the country.&quot; These skeletons, he added, were often found within the mysterious stone mounds and, sometimes, were sometimes buried amongst great treasures.\n\nVieira attributed the suppression of information on the ancient American giants to the Smithsonian Institute, specially their first director of anthropology Ales Hrdlicka. Described by Vieira as a &quot;pre-Nazi eugenicist,&quot; Hrdlicka allegedly censored reports of giants and marginalized them from the historic record in order to depict Native Americans as &quot;unsophisticated and uninspiring.&quot; Additionally, Vieira reported that there are many accounts of the Smithsonian traveling around the country to where these anomalous remains were discovered and &quot;taking the giant skeletons away, never to be seen again.&quot; Ultimately, he contended that the cover up continues to this day and claimed that a TEDx presentation on his findings was pulled from the Internet because it threatened the scientific orthodoxy.\n2012: The Best Year Ever?\n\nIn the first hour, investigative reporter Greg Hunter responded to the British Spectator article calling 2012 the &quot;best year ever.&quot; He rejected the article's stance that &quot;the forces of peace, progress and prosperity are prevailing&quot; by declaring that the true winners are &quot;the forces of crime, bailout, and fraud.&quot; He credited global quantitative easing for creating the illusion of an economic recovery, noted that the US dollar is being shunned as the world's reserve currency, and added that 1 in 6 Americans are now on food stamps. Looking ahead to 2013, Hunter warned that war with Iran appears imminent which could be a &quot;disaster of world economic proportions.&quot;\n\nNews segment guests: John Lott &amp; Lauren Weinstein\nWebsite(s):\n\n    Stone Builders, Mound Builders and the Giants of Ancient America\n    usawatchdog.com\n\n","torrent":{"xt":"urn:btih:a1d56744f52d99195b89b05b5bde7de5fbee8153","amp;dn":"Coast+to+Coast+AM+December+17+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1d56744f52d99195b89b05b5bde7de5fbee8153","infoHashBuffer":{"type":"Buffer","data":[161,213,103,68,245,45,153,25,91,137,176,91,91,222,125,229,251,238,129,83]},"announce":[],"urlList":[]}}