{"title":"Millennium - Texe Marrs","uid":11712899,"size":6106625,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a24510c4dc0a5769319a435207a1b33ef339be57&amp;dn=Millennium+-+Texe+Marrs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1424399050,"description":"\nThe sparkling 1990s! Gateway to an incredible Seventh Millennium of man on planet Earth. Economies are booming, money flowing, communist regimes in disarray, democracy on the rise. Peace is breaking out all over, and interest in religion is at an all-time high. Politicians promise the best is yet to come. What could possibly go wrong?\n\nMillennium reveals astonishing Bible prophecies for our day. Will the coming United States of Europe pave the way for the Antichrist? Is a reunited and arrogant Germany about to produce a monstrous new &quot;Hitler&quot; and a Fourth Reich? Will they take our money away and issue &quot;new&quot; currency as financial panic grips America and economic disaster plunges the nations into dark depression? Could mounting global catastrophes and international crises cause peoples everywhere to cry out for World Government? Is there a mysterious conspiracy by false &quot;Christs&quot; and religious cults to set up a One World Religion? And most important: Will Jesus himself return in the next few years to establish His glorious Millennial Kingdom?\n\n\nAbout the author:\n Texe Marrs is author of 46 books, including The Personal Robot Book; Careers with Robots; The Great Robot Book; and Codex Magica: Secret Signs, Mysterious Symbols, and Hidden Codes of the Illuminati. A retired United States Air Force officer, he graduated Summa Cum Laude from Park University and earned his Masters Degree at North Carolina State University. Mr. Marrs is founder and president of powerofprophecy.com in Austin, Texas and is host of a popular radio program heard around the world","torrent":{"xt":"urn:btih:a24510c4dc0a5769319a435207a1b33ef339be57","amp;dn":"Millennium+-+Texe+Marrs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a24510c4dc0a5769319a435207a1b33ef339be57","infoHashBuffer":{"type":"Buffer","data":[162,69,16,196,220,10,87,105,49,154,67,82,7,161,179,62,243,57,190,87]},"announce":[],"urlList":[]}}