{"title":"MechRunner-SKIDROW","uid":15333257,"size":560056830,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a411fb582fa92e98a9a2322ae564890e3f974fa0&amp;dn=MechRunner-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":null,"files":1,"time":1468759862,"description":"MechRunner\r\n(c) Spark Plug Games\r\n\r\nProtection.................Steam\r\nAction.............Game Type\r\n\r\nRELEASE NOTES\r\n\r\nMechRunner is an endless action game that casts you as a powerful mech\r\nin stunning cinematic battles against a relentless robotic army\r\n\r\nGame Story\r\nOn June 30th, 1908 a mysterious explosion took place over the Tunguska\r\nRiver in Siberia, Russia that wiped out trees and wildlife for over 800\r\nsquare miles. To this day it remains the largest impact event in our\r\nplanet's recorded history\r\nIn the years that followed, dozens of scientific expeditions to the\r\nsite attempted to explain the disaster but failed to come to any\r\nconclusions. In the mid-1940s however, a team of scientists from the\r\nRussian secret service visiting the site stumbled upon the wreckage of\r\nan alien spacecraft containing technology that far exceeded our own. In\r\nthe years that followed, the KGB set to work harnessing this mysterious\r\nnew power source and created a new secret weapons program - The\r\nDivision of Advanced Weaponry or &quot;O.S.O.&quot;\r\n\r\nThey thought they could control the new power they'd discovered, but it\r\nbegan to do more than run their machines. It began to drive the men\r\nworking on it mad. The man in charge of the O.S.O., General Yuri\r\nPetrakoff, seemed particularly affected and on April 14th, 1949\r\nPetrakoff launched a full scale assault on Europe\r\n\r\nOne of Petrakoff's lead engineers, Jesper Teterev, went AWOL and left\r\nthe program early, wary of what was happening there. He went to live in\r\nsecret with his sister, Isabel and niece, Allison. While in hiding\r\nhowever, Jesper (with the help of budding engineer and pilot Allison)\r\nwas busy building his own mechanized war machine, called the XP-41\r\ncertain it may be needed one day to stave off the O.S.O.'s evil\r\ncreations. He was right\r\nGameplay\r\n\r\nMechRunner is an endless-style action game mixed with fast and furious\r\nmode-changing mech action!\r\nIt is a &quot;runner&quot; in that the player is constantly moving forward while\r\ntracking down lethal O.S.O. forces but what makes it special is that\r\nyou're piloting a giant robot capable of some serious destruction!\r\nOther endless runners feature action elements, but none like this. Heat\r\nseeking missiles, heavy caliber bullets, laser cannons, and concussion\r\nbombs meet destructible buildings, debris littered streets, and tons of\r\nslice-able enemies to create a fast paced, visually stunning\r\nexperience!\r\n\r\nA typical game may take anywhere from a few seconds to several minutes\r\nto play. The higher your skill, the longer the game, the more rewards\r\nyou will collect, and the more content you will unlock!\r\n\r\nFeatures\r\nMeticulously detailed, fast-paced action\r\nSwitch between Tank and Robot modes on the fly\r\nSlice &amp; Dice disabled enemies in cinematic fashion!\r\nExtensive arsenal of weapons, customizations, and power-ups\r\n3 unique environments that blend seamlessly together - you decide when\r\nit's time to switch\r\nProcedurally generated levels for endless variety\r\nNumerous enemy types with different tactics\r\nEpic boss battles!\r\nDynamic environmental obstacles\r\nUnlockable skins, upgrades, and achievements\r\nRescue civilians and escort them to safety\r\nAmazing Hollywood quality soundtrack\r\nOptional controls - play with a mouse or controller\r\n\r\nINSTALL NOTES\r\n\r\n1. Unpack the release\r\n2. Mount or burn image\r\n3. Install\r\n4. Copy the cracked content from the SKIDROW folder and into the main\r\ninstall folder and overwrite\r\n5. Block the game in your firewall and mark our cracked content as\r\nsecure/trusted in your antivirus program\r\n6. Play the game\r\n7. Support the companies, which software you actually enjoy!","torrent":{"xt":"urn:btih:a411fb582fa92e98a9a2322ae564890e3f974fa0","amp;dn":"MechRunner-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a411fb582fa92e98a9a2322ae564890e3f974fa0","infoHashBuffer":{"type":"Buffer","data":[164,17,251,88,47,169,46,152,169,162,50,42,229,100,137,14,63,151,79,160]},"announce":[],"urlList":[]}}