{"title":"Bunker Hill: A City, a Siege, a Revolution (Audiobook) by Philbr","uid":8639107,"size":284094648,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a423eb1afa7397caeecee1a42e2b85bf293aa32a&amp;dn=Bunker+Hill%3A+A+City%2C+a+Siege%2C+a+Revolution+%28Audiobook%29+by+Philbr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BosuxRedsux","files":24,"time":1372836742,"description":"Bunker Hill: A City, a Siege, a Revolution (Audiobook) By Nathaniel Philbrick, read by Chris Sorense\nISBN: 1611761654, ASIN: B00CKZHL50 | 2013 | MP3 48 kbps | 12:58:00 | 273 MB\n\nNathaniel Philbrick, the bestselling author of In the Heart of the Sea and Mayflower, brings his prodigious talents to the story of the Boston battle that ignited the American Revolution. Boston in 1775 is an island city occupied by British troops after a series of incendiary incidents by patriots who range from sober citizens to thuggish vigilantes. After the Boston Tea Party, British and American soldiers and Massachusetts residents have warily maneuvered around each other until April 19, when violence finally erupts at Lexington and Concord. In June, however, with the city cut off from supplies by a British blockade and Patriot militia poised in siege, skirmishes give way to outright war in the Battle of Bunker Hill. It would be the bloodiest battle of the Revolution to come, and the point of no return for the rebellious colonists.\n\nPhilbrick brings a fresh perspective to every aspect of the story. He finds new characters, and new facets to familiar ones. The real work of choreographing rebellion falls to a thirty-three year old physician named Joseph Warren who emerges as the on-the-ground leader of the Patriot cause and is fated to die at Bunker Hill. Others in the cast include Paul Revere, Warren's fiance the poet Mercy Scollay, a newly recruited George Washington, the reluctant British combatant General Thomas Gage and his more bellicose successor William Howe, who leads the three charges at Bunker Hill and presides over the claustrophobic cauldron of a city under siege as both sides play a nervy game of brinkmanship for control.\n\nWith passion and insight, Philbrick reconstructs the revolutionary landscape-geographic and ideological-in a mesmerizing narrative of the robust, messy, blisteringly real origins of America. ","torrent":{"xt":"urn:btih:a423eb1afa7397caeecee1a42e2b85bf293aa32a","amp;dn":"Bunker+Hill%3A+A+City%2C+a+Siege%2C+a+Revolution+%28Audiobook%29+by+Philbr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a423eb1afa7397caeecee1a42e2b85bf293aa32a","infoHashBuffer":{"type":"Buffer","data":[164,35,235,26,250,115,151,202,238,206,225,164,46,43,133,191,41,58,163,42]},"announce":[],"urlList":[]}}