{"title":"Democracy Now - 28 oct 2011","uid":6778756,"size":451715397,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a5a52ccff4cc8b2af76d0c15b57b96ed43825088&amp;dn=Democracy+Now+-+28+oct+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1319821856,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Oct 28, 2011\n\n-  Condition of Injured Occupy Oakland Protester Upgraded to Fair\n-  Oakland Mayor Quan Apologizes to Occupy Oakland\n-  Police Raid Occupations in Nashville and San Diego\n-  Arrest Total in Tucson Tops 350; Occupy Wall Street to March on Big Banks Today\n-  Study Confirms Wealth Distribution in United States is Most Unequal Among Industrialized Nations\n-  St. Paul's Cathedral Moves to Evict Occupy London Stock Exchange Protesters\n-  Thousands of Youth Activists March For Jobs in South Africa\n-  Report: U.S. Operates Secret Drone Base in Somalia\n-  Study: Radioactive Release in Japan Twice as Large as Estimated\n-  Obama Relies on Lobbyists to Raise Millions for Campaign\n-  Female Workers at Wal-Mart File New Sex Discrimination Lawsuit\n\n\nSpecial reports\n\n- &quot;Blood on the Tracks&quot;: Brian Willson's Memoir of Transformation from Vietnam Vet to Radical Pacifist\n\nToday we spend the hour with a man who put his life on the line twice: once when he served in the Vietnam War and again when he came back. On September 1, 1987, Brian Willson took part in a nonviolent political action outside the Concord Naval Weapons Station in California. He sat down on the train tracks along with two other veterans to try to stop a U.S. government munitions train sending weapons to Central America during the time of the Contra wars. The train didn't stop. Willson suffered 19 broken bones, a fractured skull and lost both of his legs. &quot;Before, I had spent many months in Nicaragua in the war zones, and I had been to El Salvador talking to guerrillas and talking to human rights workers. Understanding incredible extent of murders that were going on and maimings and displacements cause of fear of being murdered,&quot; Willson said. He decided, &quot;I have to at least escalate my own nonviolent occupation, if you will, of the tracks.&quot; In retrospect, Willson added, &quot;I regret that I lost my legs, but I don't regret that I was there. I did what I said I was going to do... Following orders, I discovered, is not what I'm about.&quot; Today, he is traveling the country visiting solidarity protests with Occupy Wall Street, where some of his fellow protesters are also veterans. He's also been talking about his new memoir, &quot;Blood on the Tracks: The Life and Times of S. Brian Willson.&quot; On the West Coast, he completed much of the tour on his handcycle.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:a5a52ccff4cc8b2af76d0c15b57b96ed43825088","amp;dn":"Democracy+Now+-+28+oct+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5a52ccff4cc8b2af76d0c15b57b96ed43825088","infoHashBuffer":{"type":"Buffer","data":[165,165,44,207,244,204,139,42,247,109,12,21,181,123,150,237,67,130,80,136]},"announce":[],"urlList":[]}}