{"title":"New York - 8 -The Center of the World","uid":5353353,"size":2761475131,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a5e0e7186739b70e61e12654680ecef3d853315e&amp;dn=New+York+-+8+-The+Center+of+the+World&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"rambam1776","files":-1,"time":1265852954,"description":"American Experience - History of New York - The Center of the World (WTC)\n \nVideo Codec..........: DivX 5.x/6.x \nVideo Bitrate........: 1794kbps \nDuration.............: 1:37:04\nResolution...........: 720*416 \nFramerate............: 29.970 \nAudio Codec..........: 0x2000 (Dolby AC3) AC3 \nAudio Bitrate........: 192 kbps CBR \nAudio Channels.......: 2 \nNo Subtitles\nAll DVD Extras Included\n\n   &lt;a href=&quot;\nhttp://bayimg.com/nAKNBaACE&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/nAKNBaACE&lt;/a&gt;\n   &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1406210/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1406210/&lt;/a&gt;\n   &lt;a href=&quot;\nhttp://www.pbs.org/wnet/newyork/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pbs.org/wnet/newyork/&lt;/a&gt;\n   &lt;a href=&quot;\nhttp://www.pbs.org/wgbh/amex/newyork/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pbs.org/wgbh/amex/newyork/&lt;/a&gt;\n\n\nEpisode 8: The Center of the World (WTC)\n\n \nWorld Trade Center Whether you grow up in Bilbao, Beijing or Bombay, everyone has a New York in their heads, even if they have never been there -- which is why the destruction of the twin towers had such an impact.\n-- historian Timothy Garton Ash, in the New York Times, April 9, 2002\n\n\nConceived in the giddy aftermath of World War II, and rising as America itself rose to global power in the decades following the war, the twin towers of the World Trade Center were the real and symbolic center of an economic system that would come to dominate much of the face of the planet. For nearly 30 years, they stood at the tip of lower Manhattan -- two of the tallest and most instantly recognizable structures on earth, the mightiest and most ambivalent monuments of their age -- and, in the end, the most tragic.\n\n\nAcclaimed filmmaker Ric Burns's The Center of the World (New York, Episode 8) paints a portrait of the World Trade Center -- culminating in the events of September 11, 2001, and their aftermath. Spanning more than 50 years, the film traces the origins and development of the twin towers -- called the &quot;moonshot&quot; of structural engineering and skyscraper construction by journalist and author James Glanz -- the controversies and challenges that surrounded their rise into the sky, and the complex relationship of the project, the city and the nation to the global economic dynamic that gave the World Trade Center its name and its rationale.\n\n\nThe film also recounts the terrible events of September 11 -- exploring the meaning of the attacks, and the attempt to rebuild and recover from them. &quot;Hundreds of millions of people around the world are changing the way they live because of what happened at the World Trade Center,&quot; observes historian Kenneth T. Jackson.\n\n\nTurning again to many of the interviewees who helped make sense of 400 years of New York's history in the first seven episodes of New York: A Documentary Film -- Pete Hamill, Mike Wallace, Robert A.M. Stern and Ada Louise Huxtable among them -- the film explores the urban, economic, architectural and symbolic significance of the great towers, their horrific demise, and the ongoing effort to come to terms with their loss.\n\n\nAlso appearing in &quot;The Center of the World&quot; are several new on-camera contributors, including William Langewiesche, author of American Ground: Unbuilding the World Trade Center; Niall Ferguson, a distinguished author and expert on globalization; James Glanz and Eric Lipton, New York Times journalists who have painstakingly reconstructed the final hours within the towers; Guy Tozzoli, director of the Trade Center's construction and operation, and Leslie Robertson, the project's structural engineer, who both share firsthand accounts of the life and death of the buildings; former governor Mario Cuomo, former mayor Ed Koch, current mayor Michael I. Bloomberg; and Philippe Petit, whose heart-stopping high-wire walk between the two towers transfixed the nation and the world nearly three decades ago. &quot;My love for the towers was for their life,&quot; says Petit. &quot;They were alive -- they were vibrating with the passage of a cloud over the sun, difference of temperature, the wind. I love those towers. I love them from the inside.&quot;\n\n\nWorld Trade Center To understand what happened on that terrible September morning in 2001, Burns looks back to the fall of 1946 -- when the idea of a &quot;world trade center&quot; was first conceived -- as a new global order based on world trade was taking shape in Washington and New York. The Center of the World looks at the extraordinary individuals who propelled the project forward more than a decade later -- among them, David and Nelson Rockefeller. In one of the greatest real-estate gambles in the city's history, the brothers deployed a unique combination of public and private power to rescue lower Manhattan from decline by undertaking a project of what David called &quot;catalytic bigness.&quot;\n\n\nThe film also presents the extraordinary story of the towers themselves: the bitter political controversies surrounding their planning and development, the daunting engineering challenges of their design and construction, and the tenuous first years of their operation. The Center of the World relates how, opening amidst the city's fiscal crisis and a national energy crisis, the towers faced both the threat of financial insolvency and the scorn of critics, who mocked the massive buildings as &quot;a standing monument to architectural boredom&quot; and &quot;the largest aluminum siding job in history.&quot;\n\n\nBut in the final two decades of the 20th century the towers emerged triumphant, as the forces of globalization propelled New York to an astonishing renaissance and allowed the towering complex at the foot of Manhattan to live up to the lofty promise of its name. Though New Yorkers might look upon the complex as &quot;the biggest shadow-casting pieces of real estate downtown,&quot; Niall Ferguson observes, &quot;for the rest of the world... it came to be the quintessential expression of globalization.&quot; That status made the World Trade Center a fatally attractive target for terrorists -- as became clear in February 1993 when a 1,500-pound bomb exploded in the basement garage of the North Tower, killing six people, injuring more than a thousand and inflicting serious structural damage.\n\n\n&quot;More than any symbol in America,&quot; notes architecture critic Paul Goldberger, the towers &quot;said to the world not just, 'This is America,' but 'This is a modern place -- this is a place of the 20th century.' And that made them a very potent target.&quot;\n\n\nThe Center of the World comes to a deeply moving climax as the events of September 11, 2001, and their aftermath put into play, in new and harrowing ways, every theme and issue in the city's four-century-long history: commerce and diversity, capitalism and democracy, globalization and the creation of a new kind of multi-cultural society. &quot;Little could we have imagined,&quot; Burns says, &quot;when we completed what we thought was the final episode of New York: A Documentary Film in the summer of 2001, how powerfully these underlying themes would resonate with the events that overtook New York just a few weeks later -- or the unforgettable response of the city in the months after that.&quot; ","torrent":{"xt":"urn:btih:a5e0e7186739b70e61e12654680ecef3d853315e","amp;dn":"New+York+-+8+-The+Center+of+the+World","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5e0e7186739b70e61e12654680ecef3d853315e","infoHashBuffer":{"type":"Buffer","data":[165,224,231,24,103,57,183,14,97,225,38,84,104,14,206,243,216,83,49,94]},"announce":[],"urlList":[]}}