{"title":"Microeconomics for MBAs","uid":4004744,"size":9242658,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a5e97b64cb1974eef029bf2a69b075288c28d175&amp;dn=Microeconomics+for+MBAs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jtnatoli","files":1,"time":1201760306,"description":"#######\n\nMicroeconomics for MBAs: The Economic Way of Thinking for Managers\nby Richard Mckenzie\n\nThis is the first textbook in microeconomics written exclusively for MBA students. McKenzie/Lee minimizes attention to mathematics and maximizes attention to intuitive economic thinking. The text is structured clearly and accessibly: Part I of each chapter outlines the basic theory and Part II applies this basic theory to management issues. &amp;#039;Perspective&amp;#039; sections in each chapter provide a new line of argument or different take on a business or policy issue, and carefully chosen topics and review questions are designed to spark lively and instructive debates. The accompanying DVD contains modules of Professor McKenzie talking informally with students, and elucidates complex lines of argument as well as acting as a revision aid. Throughout the book, McKenzie and Lee aim to infuse students with the economic way of thinking in the context of a host of problems that MBA students, as future managers of real-world firms, will find relevant to their career goals.\n\n#######\n\nThis is a great book and you can download his video podcasts to compliment the book for free. Open this link with iTunes: http://media.merage.uci.edu/Richard/Microecon/VideoModules/Podcast/Podcast.xml","torrent":{"xt":"urn:btih:a5e97b64cb1974eef029bf2a69b075288c28d175","amp;dn":"Microeconomics+for+MBAs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5e97b64cb1974eef029bf2a69b075288c28d175","infoHashBuffer":{"type":"Buffer","data":[165,233,123,100,203,25,116,238,240,41,191,42,105,176,117,40,140,40,209,117]},"announce":[],"urlList":[]}}