{"title":"The Protestant's Dilemma: How the Reformation's Shocking Consequ","uid":10205059,"size":1696240,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a66c62fe2076dc4ccf7417a45adbbc7700f74db8&amp;dn=The+Protestant%27s+Dilemma%3A+How+the+Reformation%27s+Shocking+Consequ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ancapcatholic","files":-1,"time":1400834882,"description":"The Protestant's Dilemma: How the Reformation's Shocking Consequences Point to the Truth of Catholicism\n\nEPUB, MOBI, PDF\n\nWhat if Protestantism were true? What if the Reformers really were heroes, the Bible the sole rule of faith, and Christ s Church just an invisible collection of loosely united believers? As an Evangelical, Devin Rose used to believe all of it. Then one day the nagging questions began. He noticed things about Protestant belief and practice that didn t add up. He began following the logic of Protestant claims to places he never expected it to go -leading to conclusions no Christians would ever admit to holding. In The Protestant s Dilemma, Rose examines over thirty of those conclusions, showing with solid evidence, compelling reason, and gentle humor how the major tenets of Protestantism - if honestly pursued to their furthest extent - wind up in dead ends. The only escape? Catholic truth. Rose patiently unpacks each instance, and shows how Catholicism solves the Protestant s dilemma through the witness of Scripture, Christian history, and the authority with which Christ himself undeniably vested his Church. The Protestant s Dilemma is the perfect book for non-Catholics trying to work through their own nagging doubts, or for Catholics looking for a fresh way to deepen their understanding of the Faith.\n\nMore: https://thepiratebay.se/user/ancapcatholic\n\nBTC: 1N3Y2HNWe3xWY4qdYricHRKz58zqqi5MZp\t","torrent":{"xt":"urn:btih:a66c62fe2076dc4ccf7417a45adbbc7700f74db8","amp;dn":"The+Protestant%27s+Dilemma%3A+How+the+Reformation%27s+Shocking+Consequ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a66c62fe2076dc4ccf7417a45adbbc7700f74db8","infoHashBuffer":{"type":"Buffer","data":[166,108,98,254,32,118,220,76,207,116,23,164,90,219,188,119,0,247,77,184]},"announce":[],"urlList":[]}}