{"title":"Colin Kapp - The Unorthodox Engineers.epub","uid":9137035,"size":424847,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a684e4abd298b57fcfe61655b415c7a5095ced0b&amp;dn=Colin+Kapp+-+The+Unorthodox+Engineers.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":1,"time":1383431759,"description":"The Unorthodox Engineers are a misfit bunch of engineers, commanded by maverick engineer Fritz van Noon and including, amongst others, a convicted bank robber as quartermaster (on the entirely-sound grounds that he was likely to be the most capable person for the job). They solve problems of alien technology and weird planets in the future.\nA very rare and precious book, this one, and long out of print; nobody is selling their copy! Colin Kapp was one of the best hard-science SF short-story writers of the lot; sadly, he died just a couple of years ago.\nThis collection of little gems poses intriguing puzzles to the Engineers who are exploring new planets and new technologies. Morals are carefully hidden, but still there, like in The Subways of Tazoo where a wonderful technology wipes out its alien creators because they were too dependant on it and did not see the consequences of adopting it. The Engineers, of course, always solve the riddle.\nThe clever bit is that people remember these highly original little stories for years afterwards, and they are often quoted in other books!\nI just wish there were more like these. (Amazon Review)\nGenre: Sci-fi\n","torrent":{"xt":"urn:btih:a684e4abd298b57fcfe61655b415c7a5095ced0b","amp;dn":"Colin+Kapp+-+The+Unorthodox+Engineers.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a684e4abd298b57fcfe61655b415c7a5095ced0b","infoHashBuffer":{"type":"Buffer","data":[166,132,228,171,210,152,181,127,207,230,22,85,180,21,199,165,9,92,237,11]},"announce":[],"urlList":[]}}