{"title":"Bang My Tranny Ass - Venus Lux and Christian","uid":7817867,"size":653835751,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:a6d2e5485c0819200da32c0bc47e5d872a6e513a&amp;dn=Bang+My+Tranny+Ass+-+Venus+Lux+and+Christian&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"R0thschild","files":3,"time":1352681551,"description":"Gallery: \n &lt;a href=&quot;\nhttp://imagedomino.com/?g=263171&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imagedomino.com/?g=263171&lt;/a&gt;\n\nA fantastic scene with the phenomenal Venus Lux and Christian XXX.  It starts with Venus doing downward facing dog in a sexy hot pink and black dress, shortly followed by her getting on her knees and sucking Christian's massive cock.  They slowly strip while she works his cock, but it's not too long before he can't resist sucking that amazing hard as a rock cock of hers, which is already standing at full attention just from blowing him.  They waste no time getting to fucking doggy style, followed by spooning.  Then Christian decides he needs another taste of that amazing dick of hers, which has been hard as steel the entire time, in true Venus fashion.  They begin fucking again, with her on her back, and after a bit of this he pins her knees to her ears and starts to really hammer at her.  She then hops on top and rides him facing him, sucks his cock a little, then they finish with her facing us, with an awesome shot of Venus, cumming while getting fucked.  Venus's dick still doesn't go down!  Christian then cums all over her tongue and lips while she scoops it all into her mouth and swallows to end this amazing scene.","torrent":{"xt":"urn:btih:a6d2e5485c0819200da32c0bc47e5d872a6e513a","amp;dn":"Bang+My+Tranny+Ass+-+Venus+Lux+and+Christian","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6d2e5485c0819200da32c0bc47e5d872a6e513a","infoHashBuffer":{"type":"Buffer","data":[166,210,229,72,92,8,25,32,13,163,44,11,196,126,93,135,42,110,81,58]},"announce":[],"urlList":[]}}