{"title":"The Patron Saint of Lost Dogs - Nick Trout - Audiobook MP3","uid":10438278,"size":285250787,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a6e47bb396eac3ad469ce28fd09c2ac3531feb66&amp;dn=The+Patron+Saint+of+Lost+Dogs+-+Nick+Trout+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1403863123,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\nIf you need the single MP3 file chopped up into smaller segments, you can use Audiobook Cutter.\n\n\nThe Patron Saint of Lost Dogs\n\nWritten by: Nick Trout\nNarrated by: Peter Berkrot\nLength: 9 hrs and 52 mins\nFormat: Unabridged\nRelease Date:06-03-13\nProgram Type: Audiobook\n\nDr. Cyrus Mills returns to his hometown after inheriting his father's failing veterinary practice. Cyrus intends to sell the practice and get out of town as fast as he can, but when his first patient - a down-on-her-luck golden retriever named Frieda Fuzzypaws - wags her way through the door, life suddenly gets complicated.\n\nWith the help of a black Labrador gifted in the art of swallowing underwear, a Persian cat determined to expose her owner's lover as a gold digger, and the allure of a feisty, pretty waitress from the local diner, Cyrus gets caught up in a new community and its endearing residents, both human and animal. Sensing he may have misjudged the past, he begins to realize it's not just his patients that need healing.\n\nThe Patron Saint of Lost Dogs is a winsome tale of new beginnings, forgiveness, and the joy of finding your way home. ","torrent":{"xt":"urn:btih:a6e47bb396eac3ad469ce28fd09c2ac3531feb66","amp;dn":"The+Patron+Saint+of+Lost+Dogs+-+Nick+Trout+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6e47bb396eac3ad469ce28fd09c2ac3531feb66","infoHashBuffer":{"type":"Buffer","data":[166,228,123,179,150,234,195,173,70,156,226,143,208,156,42,195,83,31,235,102]},"announce":[],"urlList":[]}}