{"title":"Glenn.Gould.On.And.Off.The.Record.AVC.AC3.1080p","uid":11160196,"size":1526657103,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:a85a4de8b47d4dad2586a7594fe058c655fb2a1b&amp;dn=Glenn.Gould.On.And.Off.The.Record.AVC.AC3.1080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"user101966","files":2,"time":1412515922,"description":"Ages ago I had, and had been sharing this collection of two short films by the NFBC which otherwise had not been accessible to the public.\n\nIt turns out that now the CBC (God bless 'em) has posted the two of them, in full, on its YouTube page and at quite high quality in both audio and video. Well, of course you can just watch them online, but I wanted to have a copy anyway for two reasons:\n\n    1. I wanted to see if I could further improve on the sound quality (which I think I have, but not by much)\n\n    2. The 1080p version on YouTube has lower sound quality than the 720p version! \n\nDon't ask me why, but that's just how it worked out. So I took the sound from the 720p version, de-noised it somewhat, converted to Dolby and then attached the result to the 1080p version from YouTube.\n\nSo, if you want the best of both worlds you can download this file instead of the ones on YouTube!\n\n***** BUT ALL THE THANKS AND THE CREDIT SHOULD GO TO THE CBC ******\n\nEspecially for the &quot;adult&quot; way in which they've handled all of this &quot;intellectual property&quot; and copyright baloney. That is to say, they have made *all* of their Glenn Gould related archival footage publicly available and have made no attempts to block the displaying of this material by individuals through video sharing websites. \n\nInstead they've been remastering the originals and sharing them for free. Which is the way *you're supposed to* treat a national treasure: By displaying it and making available for all who care to look.\n\n- user101966","torrent":{"xt":"urn:btih:a85a4de8b47d4dad2586a7594fe058c655fb2a1b","amp;dn":"Glenn.Gould.On.And.Off.The.Record.AVC.AC3.1080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a85a4de8b47d4dad2586a7594fe058c655fb2a1b","infoHashBuffer":{"type":"Buffer","data":[168,90,77,232,180,125,77,173,37,134,167,89,79,224,88,198,85,251,42,27]},"announce":[],"urlList":[]}}