{"title":"SchÃƒÂ¶n-Mythos Neu-Schwabenland(nazi antarctic expedition 1938-39","uid":4574339,"size":14084431,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a867bc8a93c00e709256e44a676b674fa5bb8654&amp;dn=Sch%C3%83%C2%B6n-Mythos+Neu-Schwabenland%28nazi+antarctic+expedition+1938-39&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"red_gonzo","files":1,"time":1229175576,"description":"For english-only speaking:\nThis book is in german language. English title would be: The Myth of New-Schwabenland - The German Antarctic Expedition 1938-39 (2004). Heinz SchÃƒÂ¶n documents the amazing voyage of several dozens Germans which eventually discovered a vast area of Antarctic that was very different as previously assumed. With Lufthansa catapult aircraft - fired off the expedition ship &quot;Schwabenland&quot; - did 83 members of German expedition in february 1939 under constantly lifethreatening conditions fly over a gigantic area of Antarctic - a part noone has ever seen before - which was also photographed and cartographed. From endless white plains there suddenly arose 4000 m high mountains, frozen sweet water lakes and enormous oasis that provided the material for the spectacular photos that are included in this fascinating book. Under the command of Alfred Ritscher, hundreds of steel arrows with swastika on them were thrown from the air to the land to assure the territorial right for the German Reich. Almost 100 mostly color photographs allow the reader to experience the most distant part of Germany - an area that most Germans have never heard of - which carries the name of &quot;Neu Schwabenland&quot; or &quot;New Germany&quot;. The story of this unique expedition is not known in general public due to mostly ideological reasons. There were also rumors that before the 2nd world war ended another series of secret &quot;expeditions&quot; took place that created a German high-tech military colony there and a deep submarine base entirely under the ice. This was probably the reason that another military operation was started a couple of years after by the Allies - with disastrous results - someone surely was there. 180 pages, many pictures.\n\nFur Deutschsprachige:\nSie kennen die deutsche Geschichte in- und auswendig? WuÃƒÅ¸ten Sie auch, daÃƒÅ¸ das Deutsche Reich 1939 mit einer spektakulÃƒÂ¤ren Expedition vÃƒÂ¶lkerrechtliche AnsprÃƒÂ¼che auf 600.000 Quadratkilometer Antarktis anmeldete? Nur NS-Propaganda? Keineswegs: Am 5. August 1952 pochte das AuswÃƒÂ¤rtige Amt der BRD im amtlichen &quot;Bundesanzeiger&quot; auf die AnsprÃƒÂ¼che Deutschlands auf 84 deutsche Namen fÃƒÂ¼r Gebiete, Berge, HÃƒÂ¶henzÃƒÂ¼ge und Gebirge &quot;im Gebiet Neu-Schwabenland&quot;. Mit Katapultflugzeugen der Lufthansa - abgeschossen von dem Expeditionsschiff &quot;Schwabenland&quot; - hatten Mitglieder der 83kÃƒÂ¶pfigen deutschen Expedition im Februar 1939 unter stÃƒÂ¤ndiger Lebensgefahr ein riesiges Gebiet der Antarktis ÃƒÂ¼berflogen, fotografiert und kartiert, das zuvor noch kein menschliches Auge gesehen hatte. Aus unendlichen weiÃƒÅ¸en FlÃƒÂ¤chen tauchten dabei plÃƒÂ¶tzlich 4.000 Meter hohe Gebirge, zugefrorene SÃƒÂ¼ÃƒÅ¸wasserseen und eine gewaltige Oase auf, die in spektakulÃƒÂ¤ren Fotos festgehalten wurden. Eine Entdecker-GroÃƒÅ¸tat! Tausende von Stahlpfeilen mit Hakenkreuzfahnen wurden rund um das Gebiet aus der Luft abgeworfen, um die vÃƒÂ¶lkerrechtlichen AnsprÃƒÂ¼che des Reiches zu bekrÃƒÂ¤ftigen. Nach 1945 schossen Spekulationen ins Kraut: Hatten sich deutsche U-Boote nach Neu-Schwabenland abgesetzt? Hatte Hitler sich dort in Sicherheit gebracht? Hatten die Deutschen am SÃƒÂ¼dpol Basen fÃƒÂ¼r Geheimwaffen gebaut? Hatten gar die immer hÃƒÂ¤ufiger auftauchenden Berichte ÃƒÂ¼ber UFO-Sichtungen etwas mit deutschen Wunderwaffen zu tun? 1947 brach eine gewaltige US-Armada unter Admiral Richard Byrd nach Neu-Schwabenland auf. Warum verlor diese Expedition mehrere Flugzeuge? Warum setzten ihre Kompasse aus? Warum muÃƒÅ¸te das auf sechs Monate geplante Unternehmen bereits nach drei Wochen abgebrochen werden? Dieses spannende Sachbuch geht allen bohrenden Fragen um Neu-Schwabenland hartnÃƒÂ¤ckig nach und dokumentiert u.a. ein GesprÃƒÂ¤ch mit dem einzigen noch lebenden Teilnehmer der Expedition von 1939. Rund 200, oft farbige, Fotos lassen uns die Entdeckung miterleben und entfÃƒÂ¼hren uns in den fernsten Teil Deutschlands, von dessen Existenz die meisten Deutschen nicht einmal eine Ahnung haben, geschweige denn seinen Namen kennen: Neu-Schwabenland! 180 Seiten, viele Abbildungen.\n","torrent":{"xt":"urn:btih:a867bc8a93c00e709256e44a676b674fa5bb8654","amp;dn":"Sch%C3%83%C2%B6n-Mythos+Neu-Schwabenland%28nazi+antarctic+expedition+1938-39","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a867bc8a93c00e709256e44a676b674fa5bb8654","infoHashBuffer":{"type":"Buffer","data":[168,103,188,138,147,192,14,112,146,86,228,74,103,107,103,79,165,187,134,84]},"announce":[],"urlList":[]}}