{"title":"Tapestry in the Renaissance - Art and Magnificence (Art Ebook).p","uid":10276232,"size":199568378,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a8fb4ca4c209a5a381bfd169d09c689d09bd673a&amp;dn=Tapestry+in+the+Renaissance+-+Art+and+Magnificence+%28Art+Ebook%29.p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":-1,"time":1401653616,"description":"Campbell, Thomas P., &quot;Tapestry in the Renaissance: Art and Magnificence&quot;\n2002 | ISBN: 030012063X/1588390217 | English | PDF | 606 pages | 190 Mb\n\nTapestries - the art form of kings - were a principal element in the ostentatious magnificence used by powerful Renaissance rulers to broadcast their wealth and might. During the period between 1460 and 1560, courts and churches lavished vast sums on costly weavings in silk and gold thread from designs by leading artists. In this illustrated volume, contributors analyze some of these tapestries; examine the stylistic and technical development of tapestry production in the Low Countries, France and Italy during the Renaissance; and discuss the contribution that the medium made to the art, liturgy and propaganda of the day. The survey presents 45 surviving tapestries along with some 20 preparatory drawings and cartoon fragments. Featured are examples designed by Italian masters Raphael, Giulio Romano and Perino del Vaga. In addition, works by Netherlandish designers such as Bernaert van Orley and his followers are included, demonstrating how elements of the northern design tradition were fused with Italianate innovations, resulting in an extraordinarily rich aesthetic, ideally suited to the medium.","torrent":{"xt":"urn:btih:a8fb4ca4c209a5a381bfd169d09c689d09bd673a","amp;dn":"Tapestry+in+the+Renaissance+-+Art+and+Magnificence+%28Art+Ebook%29.p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8fb4ca4c209a5a381bfd169d09c689d09bd673a","infoHashBuffer":{"type":"Buffer","data":[168,251,76,164,194,9,165,163,129,191,209,105,208,156,104,157,9,189,103,58]},"announce":[],"urlList":[]}}