{"title":"COLLINS COMPLETE WOODWORKER'S MANUAL 2005","uid":5565571,"size":64578196,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a934169566e0ab284bcdbf21f993952ce2345b22&amp;dn=COLLINS+COMPLETE+WOODWORKER%5C%27S+MANUAL+2005&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1273969060,"description":"A completely revised, redesigned and updated edition of the definitive and bestselling woodworker's bible. Authoritative, superbly crafted and easy to use, Collins Complete Woodworker's Manual is the UK bestseller and the one book every woodworker needs. This revised edition has been extensively rewritten and contains new photographs and illustrations. It includes new products and techniques developed since the last edition. Every stage in crafting furniture and other decorative pieces are fully explained starting with the basics; the nature of wood, the tools required and setting up a workshop. The book then examines the principles of three-dimensional design from inspiration to construction. Step-by-step illustrations demonstrate how to make every type of joint and all the major crafts are given detailed coverage with the same step-by-step approach: bending wood, veneering and marquetry, woodcarving and finishing. The book also includes a chapter on using other materials, such as metal, glass and leather in combination with wood, plus a chapter on fixings and fittings.\n\n","torrent":{"xt":"urn:btih:a934169566e0ab284bcdbf21f993952ce2345b22","amp;dn":"COLLINS+COMPLETE+WOODWORKER%5C%27S+MANUAL+2005","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a934169566e0ab284bcdbf21f993952ce2345b22","infoHashBuffer":{"type":"Buffer","data":[169,52,22,149,102,224,171,40,75,205,191,33,249,147,149,44,226,52,91,34]},"announce":[],"urlList":[]}}