{"title":"JLA 16-23 (1998) (digital) (DreamGirl-Novus-HD) [NVS-D]","uid":9735812,"size":216202109,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:aa4717a9a437a112c61c7af705c371fcb0fa9e7c&amp;dn=JLA+16-23+%281998%29+%28digital%29+%28DreamGirl-Novus-HD%29+%5BNVS-D%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackcanary","files":-1,"time":1394442339,"description":"English | CBZ | 8 Issues\n\nThe Kingdom #1-2\nPublisher:  DC Comics\nPublication Date:  March - October 1998\n\nWriters:  Grant Morrison (#16-19, 22-23) and Mark Waid (#20-21)\nPencillers:  Howard Porter (#16, 18-19, 22-23) and Arnie Jorgenson (#17, 20-21)\nInkers:  John Dell (#16, 18-19, 22-23), David Meikis (#17, 20-21), Mark Pennington (#17), Walden Wong (#18), and Doug Hazlewood (#21)\nColorists:  Pat Garrahy and Heroic Age (separator)\nLetterers:  Ken Lopez (#16-20, 22-23) and Kurt Hathaway (#21)\nCover Artists:  Howard Porter and John Dell\n\nJLA #16\nPart 1 of a 2-part story introducing the new 14-member roster of the JLA! Will the new League stand a chance against a new villain calling himself Prometheus? All we can reveal here is that the first hero to fall is...Batman! \n\nJLA #17\nConcluding a 2-part story! Prometheus has taken out Batman and Superman, and now he's draining the air out of the JLA's moon headquarters. The lives of all his hostages--including reporter Lois Lane--hang in the balance. It'll all come down to one unexpected guest-star to beat Prometheus!\n\nJLA #18\nWriter Mark Waid (KINGDOM COME) takes the reins for a 2-issue story pitting the JLA against its greatest challenge! As seemingly unrelated catastrophes spring up across the globe, only the JLA knows the cause. But can they thwart Dr. Julian September before his freak coincidences eliminate them?\n\nJLA #19\nIn this conclusion to a 2-part story, the mad Dr. Julian September has lost control of his diabolical Engine of Chance! As probability runs wild, the origins of the Leaguers are retroactively erased from the history books. Can one of the team's earliest members turn the tide?\n\nJLA #20\nAdam Strange guests in part 1 of a 2-part story written by Mark Waid! Kidnapped and enslaved by an advanced alien race, the JLA is shocked to discover that their taskmaster is none other than their former ally--Adam Strange! Can they solve this &quot;mystery in space?&quot;\n\nJLA #21\nAdam Strange guests in part 2 of a 2-part story written by Mark Waid! Marooned on the faraway planet Rann, Superman, Green Lantern and the rest of the Leaguers must find a way to break the chains of their jailer, Adam Strange--and expose and punish the traitor from within who serves as Adam's spy!\n\nJLA #22\nGrant Morrison returns to JLA! The sleep of the world is tormented and haunted by a terrible, unblinking menace. But help arrives in the form of an unexpected ally: Daniel, The Lord of Dreams, from the pages of the best-selling SANDMAN series.\n\nJLA #23\nSuperman, Green Lantern and Wonder Woman are trapped--stripped of their powers--in a dream world ruled by an alien menace! Their only hope lies in one boy's blind faith in the World's Greatest Heroes! But is that enough against a being the size of a continent? Guest-starring the Sandman, Daniel.\n\nThanks goes to DreamGirl for this release.\n\nDon't know how to view this comic book?  Use CDisplayEx or another comic book reader application. &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/9226334&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/9226334&lt;/a&gt;","torrent":{"xt":"urn:btih:aa4717a9a437a112c61c7af705c371fcb0fa9e7c","amp;dn":"JLA+16-23+%281998%29+%28digital%29+%28DreamGirl-Novus-HD%29+%5BNVS-D%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa4717a9a437a112c61c7af705c371fcb0fa9e7c","infoHashBuffer":{"type":"Buffer","data":[170,71,23,169,164,55,161,18,198,28,122,247,5,195,113,252,176,250,158,124]},"announce":[],"urlList":[]}}