{"title":"X-Men v2 157-207 + Ex (2004-2008, Dgtl+S, Emp+DCP)","uid":9538180,"size":1122043526,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:aabb49de253f7c7ad6f1b75d613657afb62c19f6&amp;dn=X-Men+v2+157-207+%2B+Ex+%282004-2008%2C+Dgtl%2BS%2C+Emp%2BDCP%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"VikTSlick","files":-1,"time":1390972894,"description":"For more information about the (often confusing) publication history of this title, please check the wikilink here: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/X-Men:_Legacy&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/X-Men:_Legacy&lt;/a&gt;\n\nAfter Grant Morrison left New X-Men with issue 154 - and created havoc with his controversial final story arc - the X-Men were faced with some tough issues to untangle, both on the page and editorially. Chuck Austen took over as head writer with New X-Men 155, and then the title was relaunched as simply &quot;X-Men&quot; once again two issues later. That name lasted till issue 207, after which the name changed to &quot;X-Men: Legacy&quot; from issues 208-275. This is probably the most disliked run in the history of the franchise, but it is not entirely Austen's fault - he had to figure out a way to bring back Magneto from the dead due to editorial mandate, and his solution was problematic at best and plain idiotic at worst, depending on your point of view. Also, unlike Morrison, Austen did not seem to have a fixed sense of direction as to where his plots were going and wrote more episodic stories - which most fans did not want, as they had been before in the long past. The saving grace of this run was Sal Larocca's breathtaking art, and he really made his name with some of the action work done here.\n\nThis torrent contains all issues of the run, from 157-207, as well as the two New X-Men issues that are often left off of the Morrison collections - 155-156. The other extra is the 2007 Annual which was the only one released during this particular X-Men series. All issues are digital except for 205-207 and the Annual, which are by Lucky-DCP and do not have digital editions. These last three issues, however, are part of the Messiah CompleX storyline, so better copies are available elsewhere as part of those packages on in digital TPB. The digital copies are Empire releases, with the two leftovers from New X-Men courtesy of Zone. Thanks to all the scanners, please seed and enjoy! :-)","torrent":{"xt":"urn:btih:aabb49de253f7c7ad6f1b75d613657afb62c19f6","amp;dn":"X-Men+v2+157-207+%2B+Ex+%282004-2008%2C+Dgtl%2BS%2C+Emp%2BDCP%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aabb49de253f7c7ad6f1b75d613657afb62c19f6","infoHashBuffer":{"type":"Buffer","data":[170,187,73,222,37,63,124,122,214,241,183,93,97,54,87,175,182,44,25,246]},"announce":[],"urlList":[]}}