{"title":"Terranova - Hitchciking With No Particular Destination [Lossy Mp","uid":5469321,"size":94937615,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ab20cb6da052d51ac092f3b2aaac5c6735e15f7c&amp;dn=Terranova+-+Hitchciking+With+No+Particular+Destination+%5BLossy+Mp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":13,"time":1269794784,"description":"Terranova - Hitchciking With No Particular Destination \n\n.: Dati Album :.\nTitolo: Hitchciking With No Particular Destination \nAnno: 2002                                    \nGenere: Elettronica  / Hip Hop\nEtichetta: !K7\n\n.: Tracklist :.\n\n1. Breathe\n2. Sublime\n3. Aht uh mi hed\n4. Mongril \n5. Fun gallery\n6. Equal rights\n7. Heroes\n8. Running away \n9. Hell\n10. Angie (O.S.T.)\n11. Concepts\n12. Goodbye the Ferrari\n\n\n.: Recensione :.\n\nLet's go. We climb down the steps into one of the cellars in central Berlin, where in the last few years the hardest and most addictive parties in Europe have been celebrated, and we hear - Terranova.  &quot;Hitchhiking Nonstop With No Particular Destination&quot; is the long-awaited second album from the trio comprising Mastermind Fetisch, Meister and Shapemod - this time without Terranova-member Kaos, whoÃ‚Â´s currently in the studio completing his solo project entitled Ghost Cauldron. Twelve new tracks, twelve exemplars of electronic dance music to which the standard hyperbole of the music review, such as &quot;thumping bass lines&quot;, &quot;driving beats&quot; and &quot;bitter-sweet vocals&quot;, no longer comes close to what is being heard: Sounds of the present; a new Terranova sound, such as has been found and partied to in the last few summers at the legendary Berlin club &quot;Pogo&quot;.\nAs on their first album (&quot;Close the door&quot;, 1999), Terranova are supported by notable guests: the Stereo MC's singer and Terranova long-time guest vocalist Cath Coffey (electronically disguised on &quot;Breathe&quot; and the Shuggie-Otis cover &quot;Out of my Head&quot;); the New Yorker Poetry legend Mike Ladd (rapping and toasting on &quot;Sublime&quot; and &quot;Heroes&quot;); and - in a rousing performance - Ariane from the punk rock / new wave legend The Slits (vocals on &quot;Mongril&quot; and &quot;Equal Rights&quot;). From the instrumental opener (&quot;Concepts&quot;) through the club hits &quot;Sublime&quot; and &quot;Out of my Head&quot;, the Bob Marley cover &quot;Running Away&quot; and on to the infernal outbreak of punk rock guitars on &quot;Goodbye the Ferrari&quot;, Terranova rocks the house to destruction - we're supposed to dance on the ruins and laugh. Terranova are inspired by hip-hop, Detroit techno and punk rock - of course. But their music is more than the sum of these parts. Sometimes you ask yourself where the current of this sound originates, its darkness, its depths: The Terranova sound goes down deep - to where people find themselves eerie. Where the soul resides. Where it gets deep down and dirty. Terranova can be heard in the streets, clubs and underground; but their sound doesn't have any kind of place in the taste ghetto: Terranova feels just as much at home on the streets of Berlin as in the clubs of London and on the beach in Jamaica. Musical citizens of the world.\n&quot;Hitchhiking ...&quot; seems rougher, less produced and more hastily put together than its predecessor does. You want to say: The new Terranova album has become more boys-oriented. Jeans, leather, metal - and electronics! The flesh thinks. You see girls, headbanging and breakdancing on the dancefloor, while the boys at the bar gawk open-mouthed. And that's how it will be. Like its predecessor, this longplayer will also be played in bedrooms and on the four or five progressive dancefloors in Europe. \nThe club space as a microcosm of our everyday reality. On the perfect club night, there is fighting and laughing, weeping and kissing, blame is taken, transgressions are forgiven, you lose and find yourself - the new Terranova album is about all of that and nothing less. Or, as the lyric in &quot;Sublime&quot; puts it: &quot;Fact is/ Beauty is sublime/ Sublime is in the beauty/ And the beauty is in the mind.&quot; Good sex happens in the mind; the best ideas come from the stomach. There has been no hitchhiking on freeways for a long time. Terranova: a new country. Stick that thumb out.\n(Fonte !K7)\n\n.: Dati Tecnici :.\n\nTipo di file: MPEG-1 Layer III\nInitial skip: 127,894 bytes\nMPEG frames: 7612\nDurata: 00:03:19 (198.844081 s)\nBitrate: 256 kbps CBR\nFrequenza: 44100 Hz\nEmphasis: none\nMode: stereo\nPadding: SÃƒÂ¬\n\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:ab20cb6da052d51ac092f3b2aaac5c6735e15f7c","amp;dn":"Terranova+-+Hitchciking+With+No+Particular+Destination+%5BLossy+Mp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab20cb6da052d51ac092f3b2aaac5c6735e15f7c","infoHashBuffer":{"type":"Buffer","data":[171,32,203,109,160,82,213,26,192,146,243,178,170,172,92,103,53,225,95,124]},"announce":[],"urlList":[]}}