{"title":"Frankie Hi-nrg Mc - La Morte Dei Miracoli (1997) [lossy Mp3 320 ","uid":6681478,"size":138265155,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ababae1fa698c729addff7318634351d415ca9c8&amp;dn=Frankie+Hi-nrg+Mc+-+La+Morte+Dei+Miracoli+%281997%29+%5Blossy+Mp3+320+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"proximun","files":31,"time":1316210939,"description":"Frankie HI-NRG MC\nLa Morte Dei Miracoli (1997)\n\nDATA\n\nTitolo: La Morte Dei Miracoli\nArtista: Frankie HI-NRG MC\nEtichetta: BMG\nGenere: Hip Hop\nAnno: 1997\nPaese: Italia\nDimensione: 100 MB + 31,7 MB (art cover)\nFormato: MP3 320 Kbps\nDurata: 44 min. circa\nCover: Presente\n\nTRACKLIST\n\n01 Incipit\n02 Quelli Che Benpensano\n03 Cubetti Tricolori\n04 Accendimi..\n05 GiÃƒÂ¹ Le Mani Da Caino\n06 Manovra A Tenaglia\n07 Il Beat Come Anestetico\n08 La Cattura\n09 Area 51\n10 AutodafÃƒÂ¨\n11 Cali Di Tensione\n12 Note Psichedeliche D'Ambiente\n13 Fili\n14 Outcipit\n15 La Cattura (Traccia bonus)\n\nBIOGRAFIA\n\nFrankie HI-NRG MC, nome d'arte di Francesco Di GesÃƒÂ¹ (Torino, 18 luglio 1969), ÃƒÂ¨ un rapper italiano. Di origini siciliane, nato a Torino e cresciuto tra Caserta e CittÃƒÂ  di Castello, ÃƒÂ¨ attivo fin dagli albori del movimento hip hop in Italia (primi anni novanta), affrontando prevalentemente tematiche riguardanti la politica e la societÃƒÂ .\n\nI primi concerti di rilievo per Frankie furono quelli che introducevano i Run DMC e i Beastie Boys durante il tour italiano del 1992, un buon mezzo per rendersi noto prima di pubblicare l'album d'esordio, Verba Manent, che uscÃƒÂ¬ nel 1993; il singolo di maggior successo fu &quot;Fight Da Faida&quot;, pezzo contro la mafia, la camorra e la corruzione, che arrivÃƒÂ² persino ad essere diffuso in discoteca; ciÃƒÂ² portÃƒÂ² Frankie ad essere accusato da parte del mondo dei centri sociali, dei quali l'artista non si ÃƒÂ¨ mai sentito parte, di essere un &quot;venduto&quot;. Il musicista si ÃƒÂ¨ sempre difeso dicendo che il compito del rapper ÃƒÂ¨ di insegnare a tutti e in tutti i luoghi.\nFrankie raggiunse l'apice della sua carriera con l'uscita nel 1997 del suo secondo album, La morte dei miracoli, trascinato dal singolo &quot;Quelli che benpensano&quot; (Premio Italiano della Musica come canzone dell'anno). Il disco contiene inoltre altri successi dell'artista come &quot;AutodafÃƒÂ©&quot; e &quot;GiÃƒÂ¹ le mani da Caino&quot;, nella quale Frankie si schierÃƒÂ² contro la pena di morte.\nNel luglio del 2005 fu pubblicata RapÃ‚Â©ital, una raccolta dei suoi migliori pezzi riarrangiati piÃƒÂ¹ un inedito, &quot;Dimmi dimmi tu&quot;. In questo album il brano &quot;GiÃƒÂ¹ le mani da Caino&quot; ÃƒÂ¨ cantato sulla colonna sonora di &quot;Le avventure di Pinocchio&quot;.\nL'album DePrimoMaggio, ÃƒÂ¨ uscito nel marzo 2008 in occasione della sua partecipazione al Festival di Sanremo con la canzone Rivoluzione. Il brano ÃƒÂ¨ ispirato ai piÃƒÂ¹ recenti crack finanziari italiani ed alla degenerazione politica e sociale dell'Italia stessa e contiene un campionamento del brano &quot;Introduzione&quot; di Fabrizio De AndrÃƒÂ©, tratto dall'album &quot;Storia di un impiegato&quot;. Nella versione ufficiale, pubblicata nell'album e nel singolo, hanno collaborato al brano Roy Paci e Enrico Ruggeri.\nNel 2008 Frankie ha collaborato all'album &quot;Herculaneum&quot; di Pandaj nella title track, recitando in latino il testo di Plinio il Giovane che racconta della storica eruzione del Vesuvio del 79 d.C.\nNell'aprile 2009 collabora al primo EP di Luca Napolitano intitolato &quot;Vai&quot;, partecipando con un intervento rap al brano &quot;Mi manchi&quot;, scritto dallo stesso Napolitano insieme al fratello.\nNel maggio 2009 prende parte al progetto &quot;Artisti Uniti per l'Abruzzo&quot; partecipando al brano &quot;Domani 21/04.09&quot;.\nNel 2010 ha scritto per Simone Cristicchi la canzone &quot;Meno Male&quot;, insieme a Elia Marcelli e A. Canini. La canzone ÃƒÂ¨ stata presentata al Festival di Sanremo 2010.\nNel 2011 partecipa al brano &quot;Numeri&quot; in collaborazione con Nathalie e Raf.\n\nRECENSIONE\n\nChi non conosce Frankie Hi-NRG? In Italia ÃƒÂ¨ un personaggio rispettato da tutti, anche da chi non segue l'Hip-Hop. Chi almeno una volta non ha visto in TV il video di &quot;Quelli che benpensano&quot;? Chi non si ÃƒÂ¨ messo a canticchiare il bellissimo ritornello di Riccardo Sinigallia o si ÃƒÂ¨ ritrovato con la strumentale appiccicata nella testa 24 ore su 24? E chi non ÃƒÂ¨ rimasto affascinato dal testo stupendo di questa canzone e in breve l'ha imparato a memoria? Se credete che Frankie sia tutto qui, vi sbagliate. &quot;La morte dei miracoli&quot; ÃƒÂ¨ il suo secondo disco, il primo ÃƒÂ¨ uscito nel '93 (ricorda niente questa data?) e si intitola &quot;Verba manent&quot;, ma non se ne parla in questa recensione. Frankie ÃƒÂ¨ stato spesso affiancato agli Articolo 31 per il semplice fatto che un suo pezzo abbia riscosso un certo successo in ambienti non esclusivamente Hip-Hop e perchÃƒÂ© il suo primo album ÃƒÂ¨ uscito contemporaneamente al loro, ma con la coppia Ax/Jad non ha assolutamente niente in comune. La sua caratteristica principale ÃƒÂ¨ quella di aver saputo interpretare le proprie idee in modo concreto e, al tempo stesso, innovativo; vediamo perchÃƒÂ©. &quot;La morte dei miracoli&quot; ÃƒÂ¨ un prodotto impeccabile sia dal punto di vista delle produzioni che per le liriche, siamo di fronte ad un album curatissimo, figlio di una mente lucida e di una bocca che (finalmente) riesce davvero a comunicare, a veicolare un messaggio. Le strumentali trasmettono suoni tipicamente nostrani e legano alla perfezione con ogni testo, in modo da sembrare un tutt'uno abilmente architettato. Liricamente Frankie ÃƒÂ¨ potentissimo, la sua metrica ÃƒÂ¨ asciutta e musicale, ogni frase ÃƒÂ¨ elaborata con chirurgica precisione. L'mc lancia accuse dirette ed inequivocabili attraverso un linguaggio ricco di metafore ed espressioni che, fissandosi nella memoria, vanno dritte al punto. Forse il miglior esempio di ciÃƒÂ² ÃƒÂ¨ &quot;GiÃƒÂ¹ le mani da Caino&quot;, il cui tema ÃƒÂ¨ chiaramente quello della pena di morte. E con ciÃƒÂ² arriviamo a sottolineare la piÃƒÂ¹ importante differenza tra il Di GesÃƒÂ¹ e i tanti mc's italiani che si perdono nei propri esercizi di stile per far colpo su un pubblico mediocre che bada piÃƒÂ¹ alla rima che all'espressione di un pensiero: Frankie affronta tematiche serie, attuali ed importanti senza mai cadere nel luogo comune e nella facile banalitÃƒÂ . Ecco perchÃƒÂ©, ancora oggi, &quot;La morte dei miracoli&quot; resta un disco che sa farsi ascoltare: imprescindibile. (rapmaniacz.com)\n\nEnjoy All!","torrent":{"xt":"urn:btih:ababae1fa698c729addff7318634351d415ca9c8","amp;dn":"Frankie+Hi-nrg+Mc+-+La+Morte+Dei+Miracoli+%281997%29+%5Blossy+Mp3+320+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ababae1fa698c729addff7318634351d415ca9c8","infoHashBuffer":{"type":"Buffer","data":[171,171,174,31,166,152,199,41,173,223,247,49,134,52,53,29,65,92,169,200]},"announce":[],"urlList":[]}}