{"title":"Shingeki no Kyojin [Manga Ita Cbr] vol. 01-17 [TNT Village]","uid":13086347,"size":1915635425,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:abbc53f7b34bc6166de70d370a7bd9cbc1994e7d&amp;dn=Shingeki+no+Kyojin+%5BManga+Ita+Cbr%5D+vol.+01-17+%5BTNT+Village%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"turchez90","files":17,"time":1450976521,"description":".:Locandina:.\r\n\r\n[img]http://i.imgur.com/Ffymvyl.jpg[/img]\r\n\r\n.:Scheda:.\r\n\r\nAutore: Hajime Isayama\r\nTitolo: Shingeki no Kyojin - L'attacco dei giganti\r\nTipologia: Manga\r\nPagine: 200 circa a volume\r\nVolumi: 17 - in corso\r\nAnno: 2009 - in corso\r\nNazionalità: Giappone\r\nGenere: Shonen\r\nLingua: Italiano\r\nDimensione del file: 1,92 Gb\r\nFormato del file: CBR (JPG)\r\n\r\n.:Trama:.\r\n\r\nNell'anno 845 compare un gigante alto circa 60 metri, che con un calcio crea una breccia nella cinta esterna del Muro Maria, presso la città di Shiganshina. I giganti sciamano al suo interno divorando quanti più umani possibili, mentre questi cercano inutilmente di difendersi e trasferire più gente possibile all'interno della seconda cerchia di mura; ma prima che gli uomini riescano a chiudere la porta interna delle mura, un gigante corazzato la sfonda con un colpo e gli umani sono costretti a ripiegare sul Muro Rose. In seguito tentano una disperata riconquista del territorio perduto, circa un terzo del totale, che fallisce miseramente. L'enorme perdita di uomini contribuisce per lo meno ad attenuare la carestia di cibo creatasi per la perdita di una porzione territoriale così grande. Il gigante colossale e quello corazzato spariscono misteriosamente dopo aver spianato la strada ai loro simili.\r\n\r\nTra i sopravvissuti alla tragedia vi sono i tre protagonisti della storia: Eren Jaeger, Mikasa Ackermann e Armin Arelet. Nel giorno dell'irruzione dei giganti, Eren perde sua madre, la quale viene divorata davanti ai suoi occhi. L'accaduto genera nel bambino, già impulsivo di natura, un odio verso i giganti superiore alla paura nei loro confronti, ed egli giura di sterminarli tutti. Mikasa è un'orfana che dopo la perdita dei suoi genitori ha vissuto sotto l'ala protettiva della famiglia Jaeger, ma quel giorno — così come Armin, il miglior amico di Eren — anche lei perde tutto. A cinque anni di distanza dall'accaduto, i tre amici sono cresciuti e sono entrati a far parte dell'esercito, quando i giganti si presentano di nuovo. Per Eren, Mikasa, Armin e le altre reclute inizia così un crudele battesimo del fuoco.\r\n\r\n\r\n.:Screenshots:.\r\n\r\n[img]http://i.imgur.com/5FFotM2.png[/img]\r\n\r\n[img]http://i.imgur.com/bBWWFcJ.png[/img]","torrent":{"xt":"urn:btih:abbc53f7b34bc6166de70d370a7bd9cbc1994e7d","amp;dn":"Shingeki+no+Kyojin+%5BManga+Ita+Cbr%5D+vol.+01-17+%5BTNT+Village%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abbc53f7b34bc6166de70d370a7bd9cbc1994e7d","infoHashBuffer":{"type":"Buffer","data":[171,188,83,247,179,75,198,22,109,231,13,55,10,123,217,203,193,153,78,125]},"announce":[],"urlList":[]}}