{"title":"Le Bocal - Oh No! Just Another Frank Zappa Memorial Barbecue (20","uid":7004043,"size":382802282,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ac37262be7a788f35226e83bb342a52d2f7e6f6d&amp;dn=Le+Bocal+-+Oh+No%21+Just+Another+Frank+Zappa+Memorial+Barbecue+%2820&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lfcom","files":-1,"time":1328200264,"description":"\nOh No Just Another Frank Zappa Memorial Barbecue (Audio CD)\nand the 10th year of the passing from terra of FZ went by in the States without much fanfare, sad enough.\n\nBut FZ's clearly conceived musical vision will live on, in this case, the new CD from Le Bocal, a modern French big band , &quot;commissioned&quot; by the distributors of Rykodisc in France to record select compositions of FZ.\n\nBy sheer serendipity, this band was really perfect choice to record &quot;Zappamusics&quot;,as they already exhibit 3 features found in all Zappa aggregations, exceptional musicianship, a fine sense of humor,and they have their feet in the worlds of jazz, rock and classical music forms, same time.\n\nThe real beauty here lies in fact that , this is relative &quot;unique&quot; in the performance, ~ these musicians are not &quot;Zappatistas&quot; in the sense that, say Ed Palermo(1000stars) or Mike Keneally are .\n(MR Keneally in particular has his guitar style completely drenched in Frank Zappa's concepts in the way many Jazz musicians continue follow in the Wes Montgomery mold, for example).\n\nThe approach to these compositions is to attack each one with total individuality,\n&quot;de-composing&quot; the tune first, while returning at some point in the piece to refer directly to the original Zappa conception.\n\nSo you have innovation meeting the Zappa &quot;tradition&quot; 50/50 !\n\n(I was tempted to break down this review &quot;track by track&quot;, but this would ruin what is a galaxy of surprises in this recording. I like all to listen for themselves!)\n\nSuffice to say, elements of jazz, funk/rock, beguine/tango, ...all done in the combination serious/madcap style , an approach that is common among the progressive European big bands (as Pierre DÃƒÂ¸erge New Jungle Orchestra,Carlo Actis Dato Band, pino Minafra, Daniele Sepe,Wilem Breuker Collectif,Edvard Vesala, etc ).\nThe arrangements are always interesting, the dynamic of the grupo is over the moon! A first class band in every way.\n\nMost interesting, the guitar work from both soloistas is NOT derived from FZ clichÃƒÂ© in the least manner, but each plays in his own mad jazz -influenced fusion style , a better comparison would be Philip Catherine!\n(I think this is an excellent way to approach the guitar on this cd, as Zappa was one of the few melodic and consistantly interesting &quot;rock&quot; style soloists on guitar, IMO).\nNo imitation here, just innovation.\n\n2 highlights 'solo-wise', first the Herbie Hancock /Keith Jarret -inspired piano solo from Rita on &quot;Blessed Relief&quot;.\n\nThe second , a real treat.\n\nOn &quot;King Kong&quot; (which is not treated as the airy 6/8 performance from&quot;Uncle Meat&quot;, but as a lumbering funk-infused rendition), the solo begins, you cannot decipher what instrument it is!\nNo , not keyboards, not guitar.\nWhat it is is Laurent's unique &quot;Jimi Hendrix meets Sun Ra at Pete Cosey's place&quot; electric VIOLIN!\n\nSugarcane Harris on LSD, Jean Luc Ponty in the crazyloco institution! It really makes this track &quot;fly&quot;!\n\nAnother revelation, the composition &quot;Take your Clothes Off...&quot;, from the &quot;... In It For the Money&quot; recording , which might appear, first glance, to be a throwaway track.\nTo the opposite, the version begins with a jazz guitar solo , the chords over a &quot;faux-bossa&quot; groove, before moving on to cartoon absurdity of the original composition, then a funk vamp and saxofone solo!\nVocal renditions of idiot B** Son,Mr Green Genes and Oh! No! further the humor in musics cause, without going overboard (as FZ sometimes did himself). A little corny these &quot;Le Bocalistas&quot;,but the compositions warrant this type vocal humor fun.\n\nI could talk hours on this recording, but I spare you all!\n\nthe only composition that will never 100 % resonate in me is their fine version of &quot;Blessed Relief&quot;. The FZ version was perfect, and the trumpet solo from Sal Marquez, George Duke's fender piano solo, and FZ's own Wha-wha acustic guitar solo can never be equalled, IMO! Still, this version of Le Bocal VERY enjoyable!\n\nAnother fine contribution to the keeping the flame of Zappamusics alive, and with a fresh(and French!) conception.\n\nThey play the stars outta these compositions really. One MILLION stars reviewed! Not a bad note in the recording. Enjoy!\n\n\n\n1. Oh No! (Instrumental Version)\n2. Take Your Clothes Off When You Dance\n3. King Kong\n4. The Idiot Bastard Son\n5. Little Umbrellas\n6. The Air\n7. The Grand Wazoo\n8. The Duke Of Prunes\n9. Blessed Relief\n10. Mr. Green Genes\n11. Oh No! (Vocal Version)\n","torrent":{"xt":"urn:btih:ac37262be7a788f35226e83bb342a52d2f7e6f6d","amp;dn":"Le+Bocal+-+Oh+No%21+Just+Another+Frank+Zappa+Memorial+Barbecue+%2820","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac37262be7a788f35226e83bb342a52d2f7e6f6d","infoHashBuffer":{"type":"Buffer","data":[172,55,38,43,231,167,136,243,82,38,232,59,179,66,165,45,47,126,111,109]},"announce":[],"urlList":[]}}