{"title":"Richard Marx - Hold On To The Nights (2nafish)","uid":5566089,"size":173647876,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ad9120cb8ce998d1bfcacb4adb6b047beaef81eb&amp;dn=Richard+Marx+-+Hold+On+To+The+Nights+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1273989286,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Hold On to the Nights&quot; is a ballad and the number-one hit for singer Richard Marx. This was the fourth and final single released from his self-titled debut album, and the first to reach the top of the Billboard Hot 100.\n\nRichard Marx is the eponymous debut album by singer/songwriter Richard Marx. Released in 1987, Marx became the first solo artist in recording history to reach the top three of the Billboard Hot 100 with four singles from a debut album, including his first number one Pop single &quot;Hold On to the Nights&quot; in mid-1988. The album's first single &quot;Don't Mean Nothing' charted at number one on Billboard's Hot Mainstream Rock Tracks chart in 1987.\n\nIn his early 20s, Richard Marx had started his music career in Los Angeles as a background singer and songwriter  for other artists. Marx was determined to become a solo artist, stating that &quot;I didn't want to give my best songs away. &quot;Should've Known Better&quot;, for instance, was written three years ago, and whenever I'd play it for an artist I'd get a real good response. It was the song I could've placed the easiest, but I knew that I should be the one to do it. When the deal with Manhattan Records came through early in '86, I put everything else on hold - I saw this album as a challenge to show what I could really do.&quot;\n\nMarx's relationship with the label was positive, with Marx stating that &quot;Manhattan Records was behind my writing and my voice... that's all they needed. I wasn't told to go into the studio and write hits; I was told to make an album I believed in. Through trial and error, I came up with a record that feels right and that's me.&quot;\n\nThe album was co-produced by David Cole, and Marx enjoyed working with. Cole had previously produced singer-songwriter Bob Seger's album Like a Rock which Marx stated that it &quot;...sounded great. David and I worked closely together on the production to insure that the record had that kind of sound.&quot;\n\nAnother coup for Marx was the roster of musicians who played on the album. Marx's manager convinced Eagles' guitarist Joe Walsh to play on the track &quot;Don't Mean Nothing&quot;. Two other members of the Eagles, Randy Meisner and Timothy B. Schmit also sang background vocals on that track.&quot; Marx was subsequently nominated for a Grammy Award for &quot;Best Rock Vocal Performance - Male&quot; for &quot;Don't Mean Nothing&quot; in 1988.\n\nMarx wrote the lyrics for all of the songs on his debut, with the exception of &quot;Lonely Heart&quot; and &quot;Remember Manhattan&quot; which were written by Fee Waybill from The Tubes. Marx co-wrote the music for the album with Bruce Gaitsch, Jim Lang, and Michael Omartian. In the liner notes, Marx dedicated the album to his parents, Ruth and Dick Marx.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:ad9120cb8ce998d1bfcacb4adb6b047beaef81eb","amp;dn":"Richard+Marx+-+Hold+On+To+The+Nights+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad9120cb8ce998d1bfcacb4adb6b047beaef81eb","infoHashBuffer":{"type":"Buffer","data":[173,145,32,203,140,233,152,209,191,202,203,74,219,107,4,123,234,239,129,235]},"announce":[],"urlList":[]}}