{"title":"Sonic CD DVD","uid":4856972,"size":6758342951,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ae51e2340cd711e522a5e41fa071b38bbd2ba195&amp;dn=Sonic+CD+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eliteinfantry","files":3,"time":1240097217,"description":"UPDATED\nDue to a system restore, some codecs/media players were removed from the z_extras directory before I mastered the disc. Get the missing files here: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4869256/Sonic_CD_DVD_additional_codecs&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4869256/Sonic_CD_DVD_additional_codecs&lt;/a&gt;\n\nWhat the heck is it?\nThis is a DVD five years in the making that features the cinematics of Sonic CD and their audio in the highest quality seen yet. It features fully-animated menus, every version of every audio track ever recorded for the videos, a retro interface that emulates the look and feel of the Sega CD game, a number of easter eggs, and a ton of extras, including making-of sections, technical documents, Exact Audio Copy Redbook audio rips, and every single version of the SCD opening and ending videos ever released, all ripped from their respective game discs (NO analog captures!). This is THE definitive presentation of the Sonic CD DVD videos and their music.\n\nWhy the heck is it?\nAs far as I am concerned, Sega has done a lousy job presenting these fine videos in a high-quality format and making each version of the music that goes with them widely available. The highest-quality release of the videos from Sega thus far needs to have their visual artifacts cleaned up and made available for everyone to see. Additionally, viewers should have a choice between the North American and Japanese/European soundtracks when watching the videos.\nEnter Sonic CD DVD. The Sonic Mega Collection videos have been ripped from the Gamecube disc and have had their visual encoding artifacts extensively cleaned up. The seven different versions of Sonic Boom Opening Theme, Sonic Boom Ending Theme, Sonic You Can Do Anything, and Cosmic Eternity are all presented here as pristine, 1536kbps 48KHz LPCM WAVs (and as 44.1KHz Redbook rips in the z_extras folder off the root of the DVD directory!) and are selectable for each video. None of that 192kbps AC3 baloney.\n\nAside from the music of Masafumi Ogata, Naofumi Hataya and Spencer Nilsen and the Toei videos, the entire DVD was made by me in my spare time over the past few years. I poured my heart into it, and I like to think that it shows. I offer it to you as a tribute to the cinematic and musical works of Sonic CD for you to enjoy.\n\nImages here &lt;a href=&quot;\nhttp://smg.photobucket.com/albums/v351/thebuilder/SCD%20DVD%20menus/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://smg.photobucket.com/albums/v351/thebuilder/SCD%20DVD%20menus/&lt;/a&gt;\n\nand here: &lt;a href=&quot;\nhttp://smg.photobucket.com/albums/v351/thebuilder/SCD%20DVD%20video/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://smg.photobucket.com/albums/v351/thebuilder/SCD%20DVD%20video/&lt;/a&gt;","torrent":{"xt":"urn:btih:ae51e2340cd711e522a5e41fa071b38bbd2ba195","amp;dn":"Sonic+CD+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae51e2340cd711e522a5e41fa071b38bbd2ba195","infoHashBuffer":{"type":"Buffer","data":[174,81,226,52,12,215,17,229,34,165,228,31,160,113,179,139,189,43,161,149]},"announce":[],"urlList":[]}}