{"title":"THE ART OF THE NETHERLANDS - DAVID MUNROW[TNTVILLAGE]","uid":5256070,"size":545227792,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:aff365a78fc320c73bc371f06525d834220b9f81&amp;dn=THE+ART+OF+THE+NETHERLANDS+-+DAVID+MUNROW%5BTNTVILLAGE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":24,"time":1262553038,"description":"[b][color=blue][u] DAVID MUNROW (1942-1976)[/u][/color][color=red]\n[/COLOR]\nTHE ART OF THE NETHERLANDS\n[color=blue]\n\nTHE EARLY MUSIC CONSORT OF LONDON\n[/color][/b]\n\n[b][color=green]::-&gt;COVER&lt;-::[/b][/color]\n\n[img]http://img413.imageshack.us/img413/9939/netherlandxf0.jpg[/img]\n\n[b][color=green]::-&gt;TRACKLIST&lt;-::[/color][/b]\n\n[img]http://img164.imageshack.us/img164/1827/trackoh3.jpg[/img]\n\n[b][color=green]::-&gt;INFORMAZIONI PRELIMINARI&lt;-::[/color][/b]\n\nSicuramente David Munrow, piÃƒÂ¹ che ogni altro nella seconda metÃƒÂ  del XX secolo, contribuÃƒÂ¬ a rendere popolare la musica antica in Gran Bretagna, nostante la \n\nsua carriera non sia durata che dieci anni. CiÃƒÂ² ÃƒÂ¨ sottolineato dal fatto che il Comitato incaricato di scegliere le musiche per il Voyager Golden Record, \n\ndisco da inviare nello spazio con la sonda Voyager, scelse una sua registrazione.\n\nDavid Munrow ci ha lasciato non solo le sue registrazioni, ma anche una grande collezione di strumenti musicali. Il suo archivio, trasferito alla Royal \n\nAcademy of Music contiene una collezione di sue lettere, giornali, sceneggiature TV, spartiti musicali e libri. La collezione ÃƒÂ¨ accessibile al pubblico. Il \n\ncatalogo online del National Sound Archives contiene le sue registrazioni e quelle di numerosi altri personaggi.\n\nInformazioni sulla vita e sui lavori di David Munrow possono essere trovati su:\n\n    * Early Music\n    * Dictionary of National Biography di Christopher Hogwood\n    * New Grove Dictionary of Music and Musicians; The Art of David Munrow\n\n[b][color=green]::-&gt;BIOGRAFIA DI DAVID MUNROW&lt;-::[/color][/b]\n\n[img]http://img137.imageshack.us/img137/1390/munrow2uo9.jpg[/img]\n\nMunrow nacque a Birmingham Gran Bretagna, figlio di Albert Munrow, professore di educazione fisica all'UniversitÃƒÂ  di Birmingham che scrisse un trattato \n\nsull'argomento e a cui sono stati intitolati diversi centri sportivi nel Regno Unito. David frequentÃƒÂ² la King Edward's School di Birmingham fino al 1960 con \n\nottimi risultati.\nNel 1960 David andÃƒÂ² in PerÃƒÂ¹ sotto l'egida del British Council per insegnare la lingua inglese come volontario. RitornÃƒÂ² in patria con un flauto boliviano ed \n\naltri strumenti latino-americani. StudiÃƒÂ² lingua e letteratura inglese presso il Pembroke College di Cambridge (UniversitÃƒÂ  di Cambridge), egli notÃƒÂ² un \n\ncromorno sulla parete dello studio di un amico ed iniziÃƒÂ² subito a studiarlo privatamente. Questa improvvisa passione culminÃƒÂ² poi nel libro Instruments of the \n\nMiddle Ages and Renaissance che scrisse nel (1976). Partito come pianista, cantante e fagottista, poco per volta iniziÃƒÂ² a studiare vari strumenti a fiato di \n\nepoca medioevale erinascimentale. EntrÃƒÂ² nella Royal Shakespeare Company come suonatore di fagotto ma presto iniziÃƒÂ² a suonare strumenti a fiato del tempo di \n\nShakespeare. Nonostante fosse un virtuoso di molti strumenti a fiato, decide di dedicarsi particolarmente al flauto dolce. Il suo stile inglese, discreto e \n\ncontrollato era in netta contrapposizione con la grande flessibilitÃƒÂ  tonale espressa dall'olandese Frans BrÃƒÂ¼ggen ed altri.\nNel 1967 divenne lettore all'UniversitÃƒÂ  di Leicester e sposÃƒÂ² Gillian Reid. Si associÃƒÂ² con Christopher Hogwood per fondare l'Early Music Consort of London, \n\nnel quale ognuno dei componenti era un virtuoso del suo strumento. Molto spesso, in funzione del repertorio eseguito, venivano utilizzati altri strumentisti \n\ndi valore come Nigel North e Robert Spencer, entrambi ottimi liutisti. Dal 1968 iniziÃƒÂ² a girare il mondo alla ricerca di strani strumenti di ogni paese. Egli \n\nfece costruire strumenti a fiato del medioevo da Otto Steinkopf. Nel 1970 due fiction televisive furono musicate da lui: The Six Wives of Henry VIII e \n\nElizabeth R.\nFu un uomo di grande energia. Nel corso della sua breve carriera riuscÃƒÂ¬ a realizzare oltre 50 album musicali, alcuni dei quali vennero poi disponibili anche \n\nsu CD. OLtre che con l'Early Music Consort, egli registrÃƒÂ² con l'ensemble Musica Reservata, con il Deller Consort di Alfred Deller e i King's Singers. \n\nRegistrÃƒÂ² opere di Bach e Monteverdi ma la sua attivitÃƒÂ  principale fu indirizzata alle musiche del rinascimento. Il suo cofanetto di album con l'Early Music \n\nConsort The Art of the Netherlands registrato nel 1976 (EMI SLS5049), costituÃƒÂ¬ un enorme veicolo per la diffusione del genere presso il grande pubblico.[1].\nSul canale radio BBC Radio 3 presentÃƒÂ² Pied Piper, un programma di musica che spaziava da Monteverdi alla Electric Light Orchestra. Oltre che in programmi \n\nradio apparve anche in televisione in programmi come Ancestral Voices (BBC2) e Early Musical Instruments (ITV). IniziÃƒÂ² cosÃƒÂ¬ un'opera di divulgazione presso \n\nil grande pubblico di un genere musicale allora noto soltanto agli studiosi. Molte sue trasmissioni sono state poi replicate anche dopo la sua morte.\nI suoi interessi personali erano concentrati nei viaggi, lo sport della vela, il jazz e l'antiquariato. Egli fu anche un valente linguista. Scrisse anche di \n\nmusica ed in particolare suoi sono gli scritti sui booklet che accompagnavano i sui dischi.\nMunrow si impiccÃƒÂ² nel 1976; le morti di suo padre e del suo patrigno, cui dedicÃƒÂ² il suo ultimo libro, sembra abbiano contribuito alle motivazioni del suo \n\nsuicidio.\n\n[b][color=green]::-&gt;DATI TECNICI&lt;-::[/color][/b]\n[color=red][b]\nFLAC + CUE \n2 CD VIRGIN RECORDS\nALLEGATI COVER E BOOKLETS\n[/b][/color]\n\n[color=RED][b]\n\nTNTVILLAGE.SCAMBIOETICO.ORG[/b][/color]","torrent":{"xt":"urn:btih:aff365a78fc320c73bc371f06525d834220b9f81","amp;dn":"THE+ART+OF+THE+NETHERLANDS+-+DAVID+MUNROW%5BTNTVILLAGE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aff365a78fc320c73bc371f06525d834220b9f81","infoHashBuffer":{"type":"Buffer","data":[175,243,101,167,143,195,32,199,59,195,113,240,101,37,216,52,34,11,159,129]},"announce":[],"urlList":[]}}