{"title":"[E-book-Ita-poliziesco]La pazienza del ragno","uid":4716426,"size":443904,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b0b15a6d63a169c45f52ddfa38c5c744457b24c8&amp;dn=%5BE-book-Ita-poliziesco%5DLa+pazienza+del+ragno&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mitimex","files":1,"time":1234296390,"description":"] ÃƒË† un Montalbano convalescente ma ancora ferito  nel corpo e nell'animo quello che Livia, la sua perenne fidanzata, sta assistendo amorosamente.\nEgli vorrebbe che questa sua profonda melanconia sia dovuta alla esperienza del ricovero in ospedale durante il quale, piÃƒÂ¹ che della ferita, ha avuto paura che gli venisse accertato di aver subito, nel corso della sua precedente indagine, un serio infarto, che invece si rivelerÃƒÂ  essere stato inesistente.\nDentro di sÃƒÂ¨ sa che invece tutto va riportato al sentimento di una vecchiaia che avanza.\nSembra essere giunto per lui il momento dei consuntivi di una vita spesa al servizio di una Giustizia in cui comincia a non credere piÃƒÂ¹.\nNella sua infermitÃƒÂ  fisica e morale si rende conto che quei criminali che egli ha cosÃƒÂ¬ ben contribuito a far arrestare, in fondo sono povere vittime anch'esse di una disgraziata umanitÃƒÂ . ÃƒË† questo che gli ha rimproverato Livia, che lo conosce bene, di aver deciso lui se chi aveva trasgredito la legge andasse perseguito o meno, di essersi sostituito al giudice assolvendo chi andava punito secondo la giustizia dello Stato.\nLa sua valvola di salvezza ora per uscire dai pensieri tinti (neri) ÃƒÂ¨ dedicarsi al suo lavoro. L'occasione gli si presenta quando, ancora in convalescenza in casa, gli arriva la solita telefonata di Catarella, il piantone al centralino del commissariato, che lo avverte, nel suo modo strampalato di esprimersi, che ÃƒÂ¨ stato sequestrato un motorino. Montalbano non capisce perchÃƒÂ© lo disturbino per una sciocchezza del genere ma chiamando al cellulare l'ispettore Fazio questi gli chiarisce che non ÃƒÂ¨ il motorino ad essere stato sequestrato ma la ragazza che lo guidava, una bella studentessa universitaria di VigÃƒÂ ta, Susanna Mistretta. Il padre della ragazza ha subito denunciato il rapimento che invece non convince Montalbano.\nArrivano alla casa della famiglia della rapita telefonate anonime e una foto della ragazza sequestrata ma il commissario sente che la realtÃƒÂ  ÃƒÂ¨ diversa. Proprio dall'analisi della foto Montalbano troverÃƒÂ  il filo della tela del ragno che ÃƒÂ¨ stata intessuta con pazienza e crudeltÃƒÂ . \n","torrent":{"xt":"urn:btih:b0b15a6d63a169c45f52ddfa38c5c744457b24c8","amp;dn":"%5BE-book-Ita-poliziesco%5DLa+pazienza+del+ragno","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0b15a6d63a169c45f52ddfa38c5c744457b24c8","infoHashBuffer":{"type":"Buffer","data":[176,177,90,109,99,161,105,196,95,82,221,250,56,197,199,68,69,123,36,200]},"announce":[],"urlList":[]}}