{"title":"RealtimeBondage--The Pear  Hazel Hypnotic Part 1 and 2","uid":10296711,"size":3428668998,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:b1a8eef03d8d2e54f2442cbf8b54763579db53ea&amp;dn=RealtimeBondage--The+Pear++Hazel+Hypnotic+Part+1+and+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"merzedes","files":-1,"time":1401925911,"description":"\nHere is a RealtimeBondage re-up with all formats. Previously only upped in WMV format.\n\nEnjoy :)\n\n\n\nThe Pear | Hazel Hypnotic\n            \nNovember 13, 2012\n\n \nHD WMV, iPod and HD MP4 + Pics\n\n\nHazel Hypnotic and Maggie Mead are going to spend some time getting to know each other intimately on the floor of our barn. They are locked back-to-back and we still want to see them play with each other. \n\nThe iron mask treatment is one of our favorites. It keeps Hazel blacked out in an echo chamber again, there is something beautiful about that. Even better, this time she is wearing an iron yoke that keeps her hands up out of the way and her tits nicely displayed. She prances around blindly while PD whips her ass pink. \n\nThere is a little toy we like to call the &quot;pear&quot;. The key on the end of it twists and opens the otherwise comfortable insertable to a massive size inside of her cunt. Every turn makes it a little bit wider and brings a new level of aching to Hazel's pussy. Long before it reaches its maximum size it has become wedged in there. When we are satisfied that her hole has been worked enough, then maybe we will let her take it out. Until then it will add another layer of sensation to her already overtaxed mind. \n\nScreens  &lt;a href=&quot;\nhttp://www.realtimebondage.com/live/bondage/2012/11_13hazel12/RealtimeBondage-Hazel-Hypnotic-PD-The-Pear.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.realtimebondage.com/live/bondage/2012/11_13hazel12/RealtimeBondage-Hazel-Hypnotic-PD-The-Pear.php&lt;/a&gt;\n\n\nThe Pear Part 2 | Hazel Hypnotic\n\nNovember 17, 2012 \n \n  \nHD WMV, iPod and HD MP4 + Pics   \n  \n \nThings for Hazel Hypnotic are about to get even more interesting. She has been with us for so long she is getting used to our ideas. That means it's time for us to be even more creative. \n\nThere is a special suspension rig that we have been looking to try. It has her soaring in the air with her body perfectly arched to suck or fuck, which ever we decide. This device gives us total access to beat her ass until she is black and blue. We make the best use of it while she is sucking cock. Any time we want our cock to caress the back of her tender throat we deliver a few sharp blows. When she opens wide to scream we fill the void with dick. \n\nMost people that take our electrical torments do it sitting down. Poor Hazel his hung up by her ankles. The means are truly insidious, too. The current runs in through her ass and out through her nipples but she is not grounded. Instead 2 chains hang down from her tits, dangling just above the surface of a copper plate. If she has enough core muscle she can keep them off the ground and save herself from the pain. As soon as she relaxes, though, the juice begins to flow and so do the tears. Maybe some time with the girls will help relax her afterwards. \n \nScreens  &lt;a href=&quot;\nhttp://www.realtimebondage.com/live/bondage/2012/11_17hazel13/RealtimeBondage-Hazel-Hypnotic-PD-The-Pear-Part-Two.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.realtimebondage.com/live/bondage/2012/11_17hazel13/RealtimeBondage-Hazel-Hypnotic-PD-The-Pear-Part-Two.php&lt;/a&gt;\n\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:b1a8eef03d8d2e54f2442cbf8b54763579db53ea","amp;dn":"RealtimeBondage--The+Pear++Hazel+Hypnotic+Part+1+and+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1a8eef03d8d2e54f2442cbf8b54763579db53ea","infoHashBuffer":{"type":"Buffer","data":[177,168,238,240,61,141,46,84,242,68,44,191,139,84,118,53,121,219,83,234]},"announce":[],"urlList":[]}}