{"title":"Lost Bets - Episode 150","uid":7759241,"size":437931668,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:b2bcc7526358438a3be429c4681c907cd6fb2a27&amp;dn=Lost+Bets+-+Episode+150&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zipomatic","files":1,"time":1351182435,"description":"Presenting Best in Show, where doggies and masters compete to find out which pup is more obedient, athletic, and graceful. Of course, these aren't real , they're the losers from last week's game of Pong. As their punishment, they have to wear the leashes for this one.\n\nThe doggies compete in five events:\n\nTreat Catching. The squat on a bench while the owners toss doggie treats at them. Whichever doggie catches the most treats with his or her mouth wins.\nObstacle course. The master must lead the to jump through a hoop, crawl through a tube, then climb a slide and slide down. Whichever completes the course faster is the winner.\nDoggie dance. The master leads the through a free-form routine on the trampoline. They're judged on grace, skill, and creativity.\nFetch. The masters throw a toy, and the must retrieve them with their teeth. Five throws, whichever doggie finishes first wins.\nObedience. The masters must make the execute commands... three &quot;compulsories&quot; and two free-form creative commands of the master's choosing. The are judged based on how well they obey.\nJohnny Niceguy and Naomi return to serve as MC/judges. Oh, and for every event, the losing 's master must take off a piece of clothing. When all is said and done, the ultimate losing pair gets sprayed with four liters of cola then has to shower it off.\n\n\nResolution: 1280x720px\nDuration: 00:24:22\nSize: 417mb\nType: mp4\n\nScreens: http://miragepics.com/images/47413537469114618610.jpg","torrent":{"xt":"urn:btih:b2bcc7526358438a3be429c4681c907cd6fb2a27","amp;dn":"Lost+Bets+-+Episode+150","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2bcc7526358438a3be429c4681c907cd6fb2a27","infoHashBuffer":{"type":"Buffer","data":[178,188,199,82,99,88,67,138,59,228,41,196,104,28,144,124,214,251,42,39]},"announce":[],"urlList":[]}}