{"title":"Handsome Ned -  The Name Is Ned","uid":4718215,"size":259378028,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b2f63c80bec57efc16f1410f60fbdf4d67920d75&amp;dn=Handsome+Ned+-++The+Name+Is+Ned&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GreyEagleHawk","files":33,"time":1234382750,"description":"Rockabilly  Handsome Ned - The Name Is Ned\n\n\nLegendary Toronto Rockabilly and Country artist Handsome Ned who unfortunately died to soon.\n\nHandsome Ned Masyk 1957-87 was the godfather of the rockabilly/honkytonk/cow-punk scene in the early 80's. Starting in 1979 he formed a rockabilly band with his brother Jim called the Velours who played extensively but only recorded a few demos before a lineup and name change to The Sidewinders in 81. The Sidewinders recorded an independent 45 &quot;Put the blame on me&quot; b/w &quot;Cryin' heartache misery&quot; before Jim retired from full time music and Ned went solo in 1983. Ned's solo work took a more honky-tonk country direction as he took up a residency at the Cameron House a roadhouse type bar/hotel on Queen st. west where he also lived in a room upstairs. Due to Ned's outgoing personality and tireless promotion these nights became very popular appealing to a cross section audience of rockabillys, hayseeds, drunks, potheads, bikers, punks, artists and writers as well as musicians who he encouraged to yake to the stage themselves. In 1982 he started doing a radio show on CKLN a local campus/community station, on Tuesday nights called &quot;Honky tonk hardwood floor&quot;. On his show Ned played a combination of country, rockabilly, western swing, and country rock along with the newer cowpunk and alt-county bands such as Blue Rodeo, Rank &amp; File, Blasters, Long Riders, REM, Stray Cats, Razorbacks, Jr Gone Wild,and the Bop Cats, providing some with their first Canadian airplay. He also played live on the air solo and with guests. By 1984 while still doing his solo nights Ned started up two more bands The Hayseed Hellions and the Handsome Neds playing western swing and cowpunk respectively who did some more recordings not released at the time. Inspite of Ned's admitted position as leader of the scene in Toronto the Canadian music industry at the time showed little serious intrest at first and he did reletively few recordings but his band was prepared to go into the studio the week after Ned died of a drug overdose in Jan. 1987. &quot;The Ballad of Handsome Ned&quot; a collection of recordings with the Sidewinders and the Handsome Neds was released by virgin records in 1989 with video for &quot;Rockabilly Girls&quot; to rave reviews and a Juno Award (Canada's Grammys) nomination. In 2000 Linkhorn Music released a double cd &quot;The name is Ned&quot; (distributed by Virgin) consisting of the previous now out of print lp as well as further recordings with the Hayseed Hellions and solo recordings done at CKLN. The album contained guest apperences by Blue Rodeo, Murray McLauchlin, Lydia Lunch, Johnny MacLoed, Keith Whittaker of the Demics, Tonny Kenny of the Razorbacks and Billy Rogers of the Heartbreakers, along with extensive liner notes. This album was voted the 3rd best Toronto release of the year by Now Magazine. Linkhorn Music has also put out a &quot;best of&quot; comp with American singer Dennis Jay and Toronto singer John Borra, who has also done a cover of Ned's &quot;Ain't no room for cheatin'&quot; on an indie comp cd &quot;Live every Saturday...The Graffiti's Matinee&quot; in 2002. This is an official site, Ned's family does have access to it and if there is a LEGITAMATLY IMPORTANT message I can pass it on. \n\n\n","torrent":{"xt":"urn:btih:b2f63c80bec57efc16f1410f60fbdf4d67920d75","amp;dn":"Handsome+Ned+-++The+Name+Is+Ned","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2f63c80bec57efc16f1410f60fbdf4d67920d75","infoHashBuffer":{"type":"Buffer","data":[178,246,60,128,190,197,126,252,22,241,65,15,96,251,223,77,103,146,13,117]},"announce":[],"urlList":[]}}