{"title":"Slayer 24 Bit Vinyl Pack","uid":9624707,"size":5310649676,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b328a14631c499d8b7adc8a4c1349096699d348e&amp;dn=Slayer+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"politux","files":-1,"time":1392570837,"description":"\n  Slayer 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: Heavy Metal, Thrash Metal, Speed Metal\n  Source: vinyl\n  Codec: FLAC\n  Bitrate: ~ 2,900 - 5,600 kbps\n  Bit Depth: 24\n  Sampling Rate: 96 KHz, 192 KHz\n\n  24.96\n\n  1983 Show No Mercy - 45 RPM Metal Blade Records (UK)\n  1986 Reign in Blood - Def Jam (1st US)\n  1986 Reign in Blood - Def Jam Recordings GHS 24131 (1st US)\n  1986 Reign in Blood - Geffen Records 924 131-1 (Germany)\n  1994 Divine Intervention - American Records 9 45522-1 (US)\n  1996 Undisputed Attitude - American Recordings 74321 35759-1 (US)\n\n  24.192\n\n  1984 Haunting the Chapel - Metal Blade Records MBR 1024 (US)\n  \n  Slayer were one of the most distinctive, influential, and extreme thrash metal bands of the 1980s. Their graphic lyrics dealt with everything from death and dismemberment to war and the horrors of hell. Their full-throttle velocity, wildly chaotic guitar solos, and powerful musical chops painted an effectively chilling sonic background for their obsessive chronicling of the dark side; this correspondence helped Slayer's music hold up arguably better than the remaining Big Three '80s thrash outfits (Metallica, Megadeth, Anthrax). Naturally, Slayer stirred up quite a bit of controversy over the years, with rumors flying about Satanism and Nazism that only added to their mystique. Over the years, Slayer put out some high-quality albums, including one undisputed classic (Reign in Blood), and saw the numbers of naysayers and detractors shrinking as their impact on the growing death metal movement was gradually and respectfully acknowledged. Slayer survived with arguably the most vitality and the least compromise of any pre-Nirvana metal band, and their intensity inspired similar responses from their devoted fans.\n\n  Slayer were formed in 1982 in Huntington Park, California, by guitarists Kerry King and Jeff Hanneman; also recruited were bassist/vocalist Tom Araya and drummer Dave Lombardo. They started out playing covers of Judas Priest and Iron Maiden songs, but quickly discovered that they could get attention (and fans) by exploiting threatening, satanic imagery. The band was invited by Metal Blade's Brian Slagel to contribute a track to the Metal Massacre, Vol. 3 compilation (a series that also saw the vinyl debuts of Metallica and Voivod); a contract and debut album, Show No Mercy, followed shortly thereafter. While Slayer's early approach was rather cartoonish, their breakneck speed and instrumental prowess were still highly evident. Two EPs, Haunting the Chapel and Live Undead, were released in 1984, but 1985's Hell Awaits refined their lyrical obsessions into a sort of concept album about damnation and torture and made an immediate sensation in heavy metal circles, winning Slayer a rabid cult following.\n\n  Def Jam co-founder Rick Rubin took a liking to the band, signed them to his label, and contributed the first clear-sounding production heard on any Slayer album for the stripped-down Reign in Blood. Due to the graphic nature of the material, CBS refused to distribute the album, which garnered a great deal of publicity for the band; eventually, Geffen Records stepped in. Combining Slayer's trademark speed metal with the tempos and song lengths (if not structures) of hardcore, along with the band's most disturbing lyrics yet, Reign in Blood was an instant classic, breaking the band through to a wider audience, and was hailed by some as the greatest speed metal album of all time (some give the nod to Metallica's Master of Puppets).\n\n  South of Heaven disappointed some of the band's hardcore followers, as Slayer successfully broke out of the potential stylistic straitjacket of their reputation as the world's fastest, most extreme band. Drummer Lombardo took some time off and was briefly replaced by Whiplash drummer Tony Scaglione, but soon returned to the fold. Released in 1990, Seasons in the Abyss was well received in all respects, incorporating more of the classic Slayer intensity into a more commercial -- but no less uncompromising -- sound. &quot;War Ensemble&quot; and the title track became favorites on MTV's Headbanger's Ball, and Slayer consolidated their position at the forefront of thrash, along with Metallica. Following the release of the double live album Decade of Aggression, Lombardo left the band again and formed Grip Inc.\n\n  Slayer remained quiet for a few years; the only new material released after 1990 was a duet with Ice-T recorded for the Judgment Night soundtrack on a medley of songs by the Exploited. After leaving the Forbidden, Paul Bostaph signed on as the new drummer for 1994's Divine Intervention, which was released to glowing reviews; thanks to the new death metal movement, which drew upon Slayer and particularly Reign in Blood for its inspiration, Slayer were hailed as metal innovators. The album was a massive success, debuting at number eight on the Billboard album charts.\n\n  Bostaph left the band to concentrate on a side project, the Truth About Seafood, and was replaced by ex-Testament drummer Jon Dette for Undisputed Attitude, an album consisting mostly of punk and hardcore covers. Bostaph rejoined Slayer in time to record 1998's Diabolus in Musica. The band reunited with Def Jam for 2001's God Hates Us All and in 2002 Lombardo rejoined the band once more. In 2004, they unleashed the four-disc anthology Soundtrack to the Apocalypse, followed by an album of all-new material, Christ Illusion, in 2006. After a relentless tour and festival schedule in 2007 and 2008, Slayer emerged from the studio with World Painted Blood in 2009. In 2010 Slayer appeared with Metallica, Megadeth and Anthrax, on Big 4: Live from Sofia, Bulgaria. On May 2, 2013, Slayer guitarist and co-founder Jeff Hanneman died of liver failure at a Los Angeles hospital; he was 49 years old.","torrent":{"xt":"urn:btih:b328a14631c499d8b7adc8a4c1349096699d348e","amp;dn":"Slayer+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b328a14631c499d8b7adc8a4c1349096699d348e","infoHashBuffer":{"type":"Buffer","data":[179,40,161,70,49,196,153,216,183,173,200,164,193,52,144,150,105,157,52,142]},"announce":[],"urlList":[]}}