{"title":"Lodger - A Walk in the Park [1998]","uid":9386884,"size":311842380,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b3ac717e781fdf7335bde3e6e8849a8f7d456851&amp;dn=Lodger+-+A+Walk+in+the+Park+%5B1998%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1387818138,"description":"One of Brit-pop's foremost &quot;superbands,&quot; Lodger was created from the ashes of indie also-rans Powder and Delicatessen, both of which disbanded on the back of their genre's diminishing popularity by the late '90s. Not to be carried with the ebbing tide, vocalist Pearl Lowe and husband Danny Goffey of Supergrass, in a rare side project, joined forces with singer Neil Carlill and guitarist Will Foster (both with Delicatessen while the album was being made) to make a record worthy of a lot more than a final flourish to brief respective recording careers. With more than a passing similarity to Suede, there is more to Lodger than the obvious collation with Lush or Sleeper that accompanies any female-fronted British group. In fact, this release would sit alongside anything in a Supergrass fan's collection. The folky direction can be held up to that of Gorky's Zygotic Mynci, while the frequent brass and string arrangements and rousing choruses of &quot;Bones&quot; and &quot;Love Is the Game&quot; allude to Blur. Distinctive though is the diversity channelled via difficult tempo and key changes, guitar twists, and haunting piano parts. From this period in British songwriting comes instantly identifiable four-minute pop songs on the downbeat subjects of heartache and headaches, drug use, and the complexities of society. Interspersed with dark folk-ballads, A Walk in the Park is high in content of vocal duets between Lowe and Carlill, which provide quirky diversions from the slow momentum of the album as a whole and its subject matter. Opening track &quot;I'm Leaving&quot; is the highlight, equally as a bright singalong and also as a creepy piano-laden ballad, as Carlill's distinctive straining vocal style is unlike anything you've ever heard of someone attempting emotional melodies. Its theme of a seething argument between lovers made it a British single-chart hit as audiences could relate to its updated trashy lyrics albeit in the traditional mould of Lee Hazlewood and Nancy Sinatra. From an important decade in British music in terms of originality and inventive prose, this is an important release, although not commercially successful. Dedicated historians and fans of the bands involved need to seek this out and be pleasantly surprised by its unexpected original content. (3/5)","torrent":{"xt":"urn:btih:b3ac717e781fdf7335bde3e6e8849a8f7d456851","amp;dn":"Lodger+-+A+Walk+in+the+Park+%5B1998%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3ac717e781fdf7335bde3e6e8849a8f7d456851","infoHashBuffer":{"type":"Buffer","data":[179,172,113,126,120,31,223,115,53,189,227,230,232,132,154,143,125,69,104,81]},"announce":[],"urlList":[]}}