{"title":"DOmingo Sangriento [dVDRip][Spanish]","uid":6769546,"size":1463511040,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b485d588e699fa793c8ae46b47a7a2c6fd7461ed&amp;dn=DOmingo+Sangriento+%5BdVDRip%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"virana","files":-1,"time":1319530451,"description":"BLOODY SUNDAY (Domingo Sangriento)\n\n\n\nDirecciÃƒÂ³n y guiÃƒÂ³n: Paul Greengrass.\n\nPaÃƒÂ­ses: Irlanda y Reino Unido.\n\nAÃƒÂ±o: 2002.\n\nDuraciÃƒÂ³n: 107 min.\n\nInterpretaciÃƒÂ³n: James Nesbitt (Ivan Cooper), Tim Pigott-Smith (General Ford), Nicholas Farrell (Brigada Maclellan), Gerard McSorley (Lagan), Kathy Keira Clarke (Frances Cooper), Allan Gildea (Kevin McCorry), Gerard Crossan (Eamonn McCann), Mary Moulds (Bernadette Devlin), Declan Duddy (Gerry Donaghy).\nProducciÃƒÂ³n: Mark Redhead.\nProducciÃƒÂ³n ejecutiva: Jim Sheridan, Pippa Cross, Rod Stoneman, Paul Trijbits y Tristan Whalley.\nMÃƒÂºsica: Dominic Muldoon.\nFotografÃƒÂ­a: Ivan Strasburg.\nMontaje: Clare Douglas.\nDiseÃƒÂ±o de producciÃƒÂ³n: John Paul Kelly.\nDirecciÃƒÂ³n artÃƒÂ­stica: Padraig O'Neill.\nVestuario: Dinah Collin.\nEstreno en USA: 25 Octubre 2002.\nEstreno en EspaÃƒÂ±a: 21 Febrero 2003.\n\nSINOPSIS\n\n\nEn Irlanda del Norte, el 30 de enero de 1972, trece personas murieron en las calles de la ciudad de Derry (Londonderry para los ingleses) y otras catorce fueron heridas por las balas del ejÃƒÂ©rcito britÃƒÂ¡nico. Eran unos civiles desarmados que participaban en una manifestaciÃƒÂ³n contra el decreto del Gobierno britÃƒÂ¡nico autorizando los internamientos preventivos. Este dÃƒÂ­a, que se conoce en la historia por el nombre de Bloody Sunday (Domingo Sangriento), fue crucial en la historia contemporÃƒÂ¡nea del problema irlandÃƒÂ©s porque convirtiÃƒÂ³ el conflicto (que se arrastra desde hace mÃƒÂ¡s de 700 aÃƒÂ±os) en una guerra civil, hizo que muchos jÃƒÂ³venes se integraran en el IRA y alimentÃƒÂ³ un ciclo de 25 aÃƒÂ±os de violencia. La pelÃƒÂ­cula cuenta lo que pasÃƒÂ³ ese dÃƒÂ­a, desde el amanecer hasta el anochecer, desde la llegada de las tropas a las calles de la ciudad sitiada hasta la violenta actuaciÃƒÂ³n de los soldados del formidable Regimiento de Paracaidistas contra los manifestantes civiles, y sigue con algo mÃƒÂ¡s de detalle a cuatro hombres: Ivan Cooper, lÃƒÂ­der de los defensores de los derechos civiles, lleno de idealismo y que comparte el sueÃƒÂ±o de Martin Luther King de lograr un cambio pacÃƒÂ­fico; Gerry Donaghy, un rebelde catÃƒÂ³lico de 17 aÃƒÂ±os, que desea establecerse y casarse con su chica (protestante) pero que se ve arrastrado por el enfrentamiento con los soldados; el general de brigada Patrick MacLellan, comandante del ejÃƒÂ©rcito britÃƒÂ¡nico en Londonderry, que se ve presionado para que detenga con firmeza la manifestaciÃƒÂ³n, y un joven soldado, un operador de radio de los paracaidistas, que, junto a su unidad de aguerridos veteranos, recibe la orden de entrar en el Bogside.\n","torrent":{"xt":"urn:btih:b485d588e699fa793c8ae46b47a7a2c6fd7461ed","amp;dn":"DOmingo+Sangriento+%5BdVDRip%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b485d588e699fa793c8ae46b47a7a2c6fd7461ed","infoHashBuffer":{"type":"Buffer","data":[180,133,213,136,230,153,250,121,60,138,228,107,71,167,162,198,253,116,97,237]},"announce":[],"urlList":[]}}