{"title":"Left 4 Dead v1.0.2.8","uid":8296074,"size":3547215119,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b5b9b4a24095534e99d1c6d24e1cad647639dc20&amp;dn=Left+4+Dead+v1.0.2.8&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xlevelx","files":1,"time":1364147165,"description":"This is the non-steam ((32-bit, English only)) version of Left 4 Dead.\nIt is the full PC game, and is updated to version 1.0.2.8.\n\n\nIt's compiled using WinRAR 4.20 SFX for ease of installation.\n\n\nMicrosoft Visual C++ 2010 and DirectX 9.0c files are required. These files will install automatically during your installation. \n\n\nTo uninstall the game, just delete the folder. You can also manually delete the &quot;Valve&quot; registry entry, or use CCleaner. It works nicely, and will not interfere with any programs if left in your registry.\n\n\nOpen the &quot;rev.ini&quot; file in your Left 4 Dead folder and change to your &quot;In Game Name&quot; where is says, &quot;Your-IGN-Here&quot; in both;\n \n\nSteamUser = &quot;Your-IGN-Here&quot;  \n\nPlayerName = &quot;Your-IGN-Here&quot;\n\n\nSave and close the &quot;rev.ini&quot; file before playing Left 4 Dead. This will automatically enter your registry keys.\n\n\nYou'll need to play on &quot;Custom&quot; servers, which you can find on the &quot;Server Browser&quot;. The Custom Servers will also appear on the bottom, right hand side of your Main Menu.\nIf can click onto &quot;Servers Garnera &amp; Lan&quot;, you'll see all Left 4 Dead servers, but you can only play on Non-Steam servers. \n\n\nI've noticed the &quot;Custom&quot; and &quot;Garena&quot; servers folders are not always showing as they did while compiling this version for play.\nI am therefore including an updated servers list. It'll be a time saver as compared to manually adding them manually.\n\n\nI'm also incorperating an updated server list that will save you time in adding all the hosts available. \nPlease remember, if a server is non-responsive, they may be offline. It's all dependant on the hosts.\nYou'll find the servers under your &quot;Favorites&quot; and &quot;History&quot; servers.\n\n\nJust pick the style of game play you want to join and enjoy... \n\nLeft 4 Dead v1.0.2.8!","torrent":{"xt":"urn:btih:b5b9b4a24095534e99d1c6d24e1cad647639dc20","amp;dn":"Left+4+Dead+v1.0.2.8","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5b9b4a24095534e99d1c6d24e1cad647639dc20","infoHashBuffer":{"type":"Buffer","data":[181,185,180,162,64,149,83,78,153,209,198,210,78,28,173,100,118,57,220,32]},"announce":[],"urlList":[]}}