{"title":"Shabab (1954) MHCe DVD5 - Eng Subs - Bharat Bhooshan, Nutan [DDR","uid":10766470,"size":4786577499,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b5d7d23fa458e67ab4db15cd03efaeede1778d2e&amp;dn=Shabab+%281954%29+MHCe+DVD5+-+Eng+Subs+-+Bharat+Bhooshan%2C+Nutan+%5BDDR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1408035249,"description":"Shabab (1954) MHCe DVD5 - Eng Subs - Bharat Bhooshan, Nutan [DDR]\n\nCAST:- Bharat Bhushan, Nutan, Shyam Kumar, Wasti, Badri Prasad, Yashodra Katju\n\nDirector: M Sadiq\nMusic Director: Naushad\t\nLyricists: Shakeel Badayuni\t\nPlayback Singers:- ata Mangeshkar, Mohammed Rafi, Hemant Kumar, Manna Dey, Shamshad Begum, Mubarak Begum, Ustad Amir Ali Khan\n\t\nSongs are included in MP3s\nShabab (1954) 00. Title Music and Screen Credits, Naushad\nShabab (1954) 01. Bhagat Ke Bas Mein Hai Bhagwan, Manna Dey, Shakeel Badayuni, Naushad\nShabab (1954) 02. Sangeet Hai Shakti Ishwar Ki, Hemant Kumar, Shakeel Badayuni, Naushad\nShabab (1954) 03. Verses Various Singers\nShabab (1954) 04. Sangeet Hai Shakti Ishwar Ki, Hemant Kumar, Shakeel Badayuni, Naushad\nShabab (1954) 05. Sitar Music and Raagas\nShabab (1954) 06. Man Ki Been Matwari Baaje, Lata, Rafi, Shakeel Badayuni, Naushad\nShabab (1954) 07. Sitar Music, Naushad\nShabab (1954) 08. Jogan Ban Jaoongi Saiyan Tere Kaaran, Lata, Shakeel Badayuni, Naushad\nShabab (1954) 09. Laagi More Man Ki O Saajna, Shamshad Begum, Shakeel Badayuni, Naushad\nShabab (1954) 10. Jo Main Jaanti Visrat Hai, Lata Mangeshkar, Shakeel Badayuni, Naushad\nShabab (1954) 11. Chandan Ka Palna Resham Ki Dori, Lata, Hemant Kumar, Badayuni, Naushad\nShabab (1954) 12. Mehlon Mein Rahnewale, Rafi, Bande Hasan, Mubarak Begum, Shakeel, Naushad\nShabab (1954) 13. Aaye Na Baalam Vaada Kar Ke, Mohammed Rafi, Shakeel Badayuni, Naushad\nShabab (1954) 14. Marna Teri Gali Mein Jeena Teri Gali Mein, Lata, Shakeel Badayuni, Naushad\nShabab (1954) 15. Mar Gaye Hum Jeete Jee Maalik, Lata, Shakeel Badayuni, Naushad\nShabab (1954) 16. Jhomar Gaae Gori Re Shamshad Begum, Shakeel Badayuni, Naushad\nShabab (1954) 17. Laayi Hai Raat, Rafi, Shakeel Badayuni, Naushad\nShabab (1954) 18. Marna Teri Gali Mein Jeena Teri Gali Mein, Lata, Shakeel Badayuni, Naushad\nShabab (1954) 19. Chandan Ka Palna Resham Ki Dori, Lata, Hemant Kumar, Badayuni, Naushad\n\nSYNOPSIS:- Shabab (1954) \nLong ago and far away, in the land of bright stars and sunny skies, of deserts and the oasis a caravan of a Prince was crossing the sandy wstes. All at once, a horde of briganda swooped down on their peaceful journey. Their was bloodshed and slaughter. Not one survived. But there remained a lonely child son of prince, chinging to the dead body of his mother. From afar off, a poor dhobi was witness to this scene of carnage. He took the boy to his heart as he would a son, and brought him to his home. The boy was truly a gem, and so they named him Rattan and apprenticed him to a great Musician. Rattan grew in to a handsom youth. On the wings of youth he brought love and music which lit up Lakhia dhobi's house and all the villages around it. Now in the land there was a King who had lovely daughter Ragini. The Princess suffered from a curious malady. There was no sleep for her. All cures were in vain, everything was tried and failed. In desperation, the King sent his unfortunate daughter to a holy place. Here, the Princess got enlightenment - she must treat the malady with music. From far and near, from the four corners of the land came the greatest musicians who thought that in their music lay the music that would bring solace and slumber to the eyes of the Princess.But in vain. None of them of them could achieve the magic cure. it was not long before this news reached the ears of the young Rattan, who took his melodies with him and entered the palace. His songs flowed forth to reveal their hidden magic - and behold. a slumberous spell crept over the eyelids of the affilicted princess. The malady of the body had left Princess Ragini at last - only to make way for a hundred maladies of the heart. The flames of love sprang upto consume them both. Gradually they forgot the world and came closer to one another. When the Dewan learned of this, he carried the tale to the King's ears. All was over for the lovers. Freedom was denied the princess and she was given in marriage to a stranger. Nursing a lacerated heart young Rattan returned despondent to his home. seeing him thus, his father was beside himself with grief. Here, He, who had given life was loosing it. There, she, who had brought laughter to his lips, now wept. To give him life again the poor dhobi took Rattan to the place where she was. Once more the moth came close to the lame. what happened then? The mystery of life, love and agony, of sacrifice and suffering, unfold in a tale of joy and tears, culminating in an end that must be seen rather than read.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4514 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 448kb/s CBR 48000 Hz\nAudio Streams: 6\nAudio Languages: Hindi\nRunTime: 2:17:22\nSubtitles: English\nRipped by: Trinidad [DDR]   \nDuration: 2:17:22","torrent":{"xt":"urn:btih:b5d7d23fa458e67ab4db15cd03efaeede1778d2e","amp;dn":"Shabab+%281954%29+MHCe+DVD5+-+Eng+Subs+-+Bharat+Bhooshan%2C+Nutan+%5BDDR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5d7d23fa458e67ab4db15cd03efaeede1778d2e","infoHashBuffer":{"type":"Buffer","data":[181,215,210,63,164,88,230,122,180,219,21,205,3,239,174,237,225,119,141,46]},"announce":[],"urlList":[]}}