{"title":"Control Systems for Power Electronics A Practical Guide [2015]","uid":11983494,"size":2588883,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b66eb381c844e289c68a4d920ce9ae12ecabc811&amp;dn=Control+Systems+for+Power+Electronics+A+Practical+Guide+%5B2015%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoctDeath","files":2,"time":1433290265,"description":"Title: Control Systems for Power Electronics: A Practical Guide\nSeries: SpringerBriefs in Applied Sciences and Technology\nAuthor: Mahesh Patil, Pankaj Rodey \nFormat: PDF\nHardcover: 53 pages\nPublisher: Springer; 2015 edition (April 2, 2015)\nLanguage: English\nISBN: 9788132223276\n\nThe scope of the book covers most of the aspects as a primer on power electronics starting from a simple diode bridge to a DC-DC convertor using PWM control. The thyristor-bridge and the mechanism of designing a closed loop system are discussed in chapter one, two and three. The concepts are applied in the fourth chapter as a case study for buck converter which uses MOSFETs as switching devices and the closed loop system is elaborated in the fifth chapter. Chapter six is focused on the embedded system basics and the implementation of controls in the digital domain. Chapter seven is a case study of application of an embedded control system for a DC motor. With this book, the reader will find it easy to work on the practical control systems with microcontroller implementation. The core intent of this book is to help gain an accelerated learning path to practical control system engineering and transform control theory to an implementable control system through electronics. Illustrations are provided for most of the examples with fundamental mathematics along with simulations of the systems with their respective equations and stability calculations","torrent":{"xt":"urn:btih:b66eb381c844e289c68a4d920ce9ae12ecabc811","amp;dn":"Control+Systems+for+Power+Electronics+A+Practical+Guide+%5B2015%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b66eb381c844e289c68a4d920ce9ae12ecabc811","infoHashBuffer":{"type":"Buffer","data":[182,110,179,129,200,68,226,137,198,138,77,146,12,233,174,18,236,171,200,17]},"announce":[],"urlList":[]}}