{"title":"Calibre 2.50","uid":13350535,"size":284116135,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b674684988444c8432aa0bd61b5287db869d297f&amp;dn=Calibre+2.50&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"V3N0Ms","files":6,"time":1454082108,"description":"Calibre 2.50\r\n\r\n\r\n***\r\n\r\nFile Size: 270 MB\r\n\r\nRequirement: Windows / Mac\r\n\r\n***\r\n\r\n\r\nCalibre is a free and open source e-book library management application developed by users of e-books for users of e-books.\r\n\r\n\r\n\r\ncalibre manages your e-book collection for you. It is designed around the concept of the logical book, i.e., a single entry in your library that may correspond to actual e-book files in several formats.\r\n\r\ncalibre can sort the books in your library by: Title, Author, Date added, Date published, Size, Rating, Series, etc.\r\n\r\nIn addition, it supports extra searchable metadata:\r\n\r\n    Tags: A flexible system for categorizing your collection however you like\r\n    Comments: A long form entry that you can use for book description, notes, reviews, etc.\r\n\r\nYou can easily search your book collection for a particular book. calibre supports searching any and all of the fields mentioned above. You can construct advanced search queries by clicking the helpful &quot;Advanced search&quot; button to the left of the search bar.\r\n\r\nYou can export arbitrary subsets of your collection to your hard disk arranged in a fully customizable folder structure.\r\n\r\nFinally, calibre will even go out onto the internet to find book metadata based on existing title/author or ISBN information. It can download various types of metadata and covers for your books, automatically. The metadata system is written using plugins so that different types of metadata sources can be supported in the future.\r\n\r\n\r\nHow to:\r\n\r\n* Just Run to use/install\r\n\r\n* Enjoy!","torrent":{"xt":"urn:btih:b674684988444c8432aa0bd61b5287db869d297f","amp;dn":"Calibre+2.50","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b674684988444c8432aa0bd61b5287db869d297f","infoHashBuffer":{"type":"Buffer","data":[182,116,104,73,136,68,76,132,50,170,11,214,27,82,135,219,134,157,41,127]},"announce":[],"urlList":[]}}