{"title":"Visual Business Cards + serial","uid":3315595,"size":4761678,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b79fb395ab4d20b20048d3fc06468fa456845392&amp;dn=Visual+Business+Cards+%2B+serial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Louchuck","files":2,"time":1113273582,"description":"Visual Business Cards + serial\n\nhttp://www.rkssoftware.com/visualbusinesscards/overview.html \n\nDesign and Print professional looking business cards right on your own computer... with our award winning business card software. \n\nNew! The New Card Wizard guides you through the entire process of creating a business card - just point and click \n\nNew! Hundreds of ready-made templates to choose from \n\nNew! Over 500 High-quality backgrounds! \n\nNew! We now include custom clipart for a wide variety of industries \n\nNew! Much improved image support and printing! \n\nFeatures \n\nNew Card Wizard. Guides you through the entire process of creating a business card - just point and click \n\nEasy Design. Drag-and-drop design of business cards. See an instant print preview of your business card design at any time. \n\nArtistic backgrounds. Use over 500 supplied business card background art images. \n\nUse your own images, logos and clip-art. Import BMP or JPG graphics files. \n\nReady-to-use templates. Includes hundreds of new preformatted business card templates. \n\nStandard card sizes. Work with all standard business card stock from Avery and other suppliers, available at any office supply store. \n\nUnlimited Printing. Print as many cards as you like, at any time. \n\nText display options. Place text anywhere on the business card in any font or color and rotate the text to any angle. \n\nDrawing tools. Use boxes, ovals, lines, and rounded rectangles with any color, pattern, line thickness, or line color. \n\nPortrait mode. Create standard horizontal business cards, or vertical cards. \n\nFree Updates. Updates and upgrades are normally free. Unlike many software companies, we have never charged for major or minor upgrades.","torrent":{"xt":"urn:btih:b79fb395ab4d20b20048d3fc06468fa456845392","amp;dn":"Visual+Business+Cards+%2B+serial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b79fb395ab4d20b20048d3fc06468fa456845392","infoHashBuffer":{"type":"Buffer","data":[183,159,179,149,171,77,32,178,0,72,211,252,6,70,143,164,86,132,83,146]},"announce":[],"urlList":[]}}