{"title":"Mystery - Project Hollywood","uid":4202119,"size":1489003874,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b7b91a893a8870b30c579185ca19b7cbaee53bb4&amp;dn=Mystery+-+Project+Hollywood&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"primate81","files":15,"time":1211561520,"description":"The Red &quot;Project Hollywood Formula&quot; Disks\n\nLet&amp;#039;s zoom in on what&amp;#039;s inside these disks:\n-This series of hard wired attraction switches trigger interest in women that can turn into near obsession. (Learning these 5 keys, and how to play them like a piano is the key to irresistible attraction...not learning them leaves most guys stumbling blind.) 14:25 Disk 1.\n-This &quot;additional circuit&quot; in both men and women&amp;#039;s brains creates a key shortcut to attraction. (Mystery feels that this creates such an unfair advantage that understanding this alone can vault you ahead massively.) 27:10 Disk 1.\n-The compelling reason why you must be a part of this group. (Mystery harps on this point again and again because it&amp;#039;s so darn important.) 52:54 Disk 1.\n-The biofeedback exercise that will create positive feelings for women as soon as they meet you. (This is an automatic reflex that&amp;#039;s built into everybody&amp;#039;s brain, so it literally can&amp;#039;t fail. 56:09 Disk 1\n-&quot;The whole game is won and lost in compliance.&quot; Find out what Mystery means by this statement - and why it&amp;#039;s a short cut to sustained success with women. (This point made a massive difference in the way I see the game.) 19:24 Disk 2\n-Don&amp;#039;t make this easy to make mistake. (The reason this one can be so tricky is that it will seem like you&amp;#039;re doing great...until you lose the girl because of it!) 24:07 Disk 2\n-You can&amp;#039;t play the game if you can&amp;#039;t open. Mystery makes it easy, both with step by step training and by surrounding you with short-cuts to vault you forward once you&amp;#039;ve opened. Attendees raved about the special emphasis on easy but effective opening (Starts 29:34 Disk 2)\n-This silver bullet is the way to make yourself literally rejection proof. (Mystery walks you though exactly how to use this routine to make it 100% safe to open, even for guys who are nervous about opening.) 32:03 Disk 2\n-The real formula for eye contact. (It&amp;#039;s NOT what most folks expect. Eye contact can be a big advantage - but it can also sink you. Mystery breaks it all down and shows you - eye-to-eye how to do it right.) 40:20 Disk 2\n-Mystery&amp;#039;s stripper routine and the KK story. Mystery delivers these two routines as if he were in-field at the Playboy Mansion. It&amp;#039;s like being in field with him . Stripper routine 47:30 Disk 2,\n-The &quot;KK&quot; story. Warning: do NOT skip these critical routines - they made all of the difference for several attendees. 53:55 Disk 2\n-Mystery&amp;#039;s personal vulnerability routine. 1:03:02 Disk 2.\n-The real formula for building the identity that will both suit you, and work like nuts when it comes to landing the girl. (This is actually common sense when you think about it, but for some reason this information is not being taught.) 14:46 Disk 3.\n-The technique that Mystery learned from Courtney Love. (It works like clockwork every time and makes you indomitable in conversation. It&amp;#039;s especially important when it comes to Amog situations, or battles over social control.) 16:38 Disk 3\n-The fifth attraction switch - this is a recent discovery and can tip attraction in your favor in a big way. (One of the things that makes Mystery great at pick up is constant innovation, and this new concept will help demonstrate why that innovation is so important.) 22:33 Disk 3.\n-How to use stereotypes to create a unique avatar for yourself. (This is a big advantage that a lot of people don&amp;#039;t get despite spending massive time and money on their image.) 23:50 Disk 3.\n-Mystery&amp;#039;s blueprint for turning proximity to your advantage. 33:54 Disk 3.\n-Knowing how to read the signals girls are sending with how near-or-far they are is like being able to read minds. (Because most guys don&amp;#039;t realize this, they are missing out on many of their best opportunities.) 39:50 Disk 3.\n-Mystery demonstrates the non-verbal IOIs and IODs. 40:52 Disk 3.\n-This lock-in-gambit is ready to use. Mystery demonstrates this move step-by-step. (Warning: only do this if you&amp;#039;re ready to go for it with a girl, because she&amp;#039;ll be serious about you right away.) 50:30 Disk 3\n-Mystery &quot;outs&quot; Matador&amp;#039;s &quot;gay kissing routine.&quot; This is just as effective as it is hysterical. (Matador has done this front of a girl&amp;#039;s boyfriend multiple times and gotten away with it every single time.) 55:30 Disk 3\n-The &quot;mind hack&quot; for turning any routine into an automated social tool. Mystery developed and tested and still applies &quot;mind hack&quot; today. (This &quot;mind hack&quot; a big part of the reason Mystery and his students have success with such a broad array of women from all different countries and cultures.) - 17:09 Disk 5.\n-When and how to debrief. (This can actually make the huge difference in getting the next girl, even if your first set was a total blowout.) 5:25 Disk 5.\n-Mystery&amp;#039;s &quot;Nine&amp;#039;s Gambit&quot; demonstrated and explained. (The good thing about learning this gambit is that it&amp;#039;s powerful on it&amp;#039;s own, but it also helps you understand what kinds of gambits work and which one&amp;#039;s will actually hurt you.) -This one is lightning fast so it&amp;#039;s good that you&amp;#039;ll have it on disk to watch again and again. 18:01 Disk 5.\n-Mystery&amp;#039;s &quot;pneumonic routine&quot; detailed and demonstrated - this one is really special, especially once you&amp;#039;ve seen Mystery do it. (The reason it&amp;#039;s so good is that it is an open-to-close &quot;fast track&quot; routine, if you know how to do it right.) 22:20 Disk 5.\n-Mystery&amp;#039;s &quot;first and last letters&quot; gambit explained and demonstrated - this one is especially good if you want a girl who likes smart guys, but you don&amp;#039;t want to memorize a long complicated routine. 24:43 disk 5.\n-The Snapple gambit. (This is a great opener because it always gets big laughs, but it&amp;#039;s also &quot;under the radar&quot; so you don&amp;#039;t get resistance.) 25:10 Disk 5.\n-The photographic memory plotline - you can add this one on to the &quot;pneumonic routine&quot; and take a girl from attracted to ready to go. (This lesson also explains why plotlines are so compelling and work so well, even though they are so simple to remember and execute.) 28:25 Disk 5.\n-And much, much more! (Including Disk 4 - Kino escalation fast forward with Mystery and Lovedrop.)\n\n\n\nThe Black &quot;Playboy Mansion Fast Start&quot; Disks\n\nLet&amp;#039;s zoom in on what&amp;#039;s inside these disks:\n-Flood technique - this is the fast way to acquire in field &quot;spider sense,&quot; plus it&amp;#039;s one of the best proven ways to get over the approach anxiety that so many guys report. 3:07 Black Disk 1.\n-Mystery&amp;#039;s flash game sequence demonstrated and explained. (This works especially well on hired guns, but all women are hard wired to respond strongly to this dumb-simple sequence.) 7:04 Black Disk 1.\n-&quot;The smarter man wins in pick-up.&quot; - How Mystery strips game vision down to black and white. (This simple game vision technique is one of the ways that Mystery keeps things from getting complicated - which is a very relaxing feeling.) 13:59 Black Disk 1.\n-How Style and Mystery operate in field, detailed step-by-step, and why they are using a little known, but highly effective technique to multiply their success in field. 19:17 Black Disk 1.\n-How to use kissing to your advantage. (Almost everybody screws this up - kisses are just as much an opportunity to screw everything up as they are a way to turn the heat up. Mystery explains the difference so you never get it wrong.) 33:16 Black Disk 1.\n-How Mystery&amp;#039;s cheat sheet system works. (This is like invisible training wheels for pick up, it&amp;#039;s a big boost while you are getting started and later on when you don&amp;#039;t need it anymore you get rid of it - or pass on your wisdom to a new beginner.) 44:07 Black Disk 1.\n-The real way to multiple thread - unfortunately there&amp;#039;s a lot of confusion over when, why and how to use this killer technique to insulate yourself from rejection and to push attraction into overdrive. 45:41 Black Disk 1.\n-If a woman doesn&amp;#039;t feel &quot;this&quot; then you&amp;#039;re NOT going to be successful with her. Matador explains why and then shows the &quot;how to&quot; of making this emotion happen on near autopilot. (This is one of the big reasons that top PUAs who have gone out in field call Matador a total MACHINE when it comes to getting girls. I&amp;#039;ve seen it and it&amp;#039;s shocking.) 9:54 Black Disk 2.\n-&quot;The gift&quot; this ultimate reframe is critical for sustained success in pick-up. 12:57 Black Disk 2.\n-Matador&amp;#039;s dinner routine demonstrated and explained. (This works with or without a wing - Matador explains it both ways.) 19:02 Black Disk 2.\n-Matador&amp;#039;s disqualifier opener demonstrated and explained. (This is a great one to teach your wing as well.) 45:50 Black Disk 2.\n-Matador demonstrates his own hard wiring when it comes to pick up. (So you know what it &quot;looks like&quot; when you are doing attraction right.) 52:55 Black Disk 2.\n-Matador unlocks his bulletproof opener for mixed sets. (That&amp;#039;s where you&amp;#039;ve got a group of girls AND guys.) This one works so well that it makes opening mixed sets almost funny. 10:56 Black Disk 4.\n-A real life demonstration of Matador&amp;#039;s caveman tactics and how he uses his bulletproof opener to diffuse a situation that would have gotten many guy&amp;#039;s asses severely kicked by a jujitzu expert. (Vegas story.) 11:41 Black Disk 4.\n-Matador&amp;#039;s fool proof system for permanently blasting past the issue of approach anxiety. (The way he sees it, you ability to open automatically after this lesson will improve your pick-up life by 100% if you learn absolutely nothing else.) 12:30 Black Disk 4.\n-Matador demonstrates his &quot;tractor beam&quot; technique using the &quot;spells opener.&quot; 21:40 Black Disk 4.\n-The quick fire way to convey your positive personality traits while building attraction and having fun. 32:03 Black Disk 4.\n-Matador demonstrates how to open a moving set with your eyes. Then he explains why this counterintuitive, but shockingly effective technique for day game and club game actually works. 41:25 Black Disk 4.\n-And much, much more!\n\n\n\nSecret Weapon Playboy Mansion Debrief Gold Disk\n\nLet&amp;#039;s zoom in on what&amp;#039;s inside this disk:\n-Warning: you NEED a recovery routine, in case you come across as &quot;too smooth&quot; in an important set. Mystery demos his recovery routine and explains when to use it, and why and how it works. 14:47 Secret Weapon Disk.\n-How to use lock in props almost like a gentle forklift when it comes to moving girls to an isolated location with you - demonstrated and explained. 17:03 Secret Weapon Disk\n-Mystery&amp;#039;s backwards merging scripts, demonstrated and explained in detail. 17:25 Secret Weapon Disk.\n-What Mystery looks for BEFORE he even looks at a single other person when he enters a pick-up location (Whether it&amp;#039;s a club, pub or even in a day game situation. It&amp;#039;s THAT important.) 24:13 Secret Weapon Disk.\n-The character that you can play that will make it so you get everybody&amp;#039;s attention (Even if you are whispering in a loud pub or club.) Mystery demonstrates and explains for you: 25:41 Secret Weapon Disk.\n-The question you MUST ask every set that you open. If you don&amp;#039;t do that you&amp;#039;re creating a major obstacle for yourself that&amp;#039;s almost impossible to unravel. (This question was so important Mystery made the entire group shout it at the top of their lungs TWICE!) 43:07 Secret Weapon Disk.\n-Style&amp;#039;s SOI (Statement of Intent) routine - this is truly mind-bending. It&amp;#039;s very rare to get video of Style in field - and Style is at his very best here. 35:11 Secret Weapon Disk.\n-And much much more.","torrent":{"xt":"urn:btih:b7b91a893a8870b30c579185ca19b7cbaee53bb4","amp;dn":"Mystery+-+Project+Hollywood","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7b91a893a8870b30c579185ca19b7cbaee53bb4","infoHashBuffer":{"type":"Buffer","data":[183,185,26,137,58,136,112,179,12,87,145,133,202,25,183,203,174,229,59,180]},"announce":[],"urlList":[]}}