{"title":"SEVEN.KINGDOMS.II.FRYHTAN.WARS-T-PLAGUE","uid":8300426,"size":626963528,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b9420701e312d634792ab702349913ce1c5f623e&amp;dn=SEVEN.KINGDOMS.II.FRYHTAN.WARS-T-PLAGUE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"D-Poisson","files":4,"time":1364254215,"description":"Seven Kingdoms II: The Fryhtan Wars is a history-fantasy real-time strategy computer game developed by Enlight, released in 1999. Seven Kingdoms II is the sequel to the original Seven Kingdoms game and its updated re-release Seven Kingdoms: Ancient Adversaries.\n\n&quot;Seven Kingdoms was a great game, Seven Kingdoms 2 takes what they did in the original and puts it up in the pantheon of godly Real Time Strategy games. Not only has it kept the game play almost exactly the same as the first, it has improved the graphics, added many new features. The first thing i noticed when i started playing this game is the addition of playable Fryhtan species, for those who don't know, Fryhtans were beasts who would raid your kingdom from time to time doing some serious economic damage to your kingdom as well as physical damage to structures and your soldiers. There are seven Fryhtan species and 12 Human civilizations, and each is highly unique and different, you can even have an army of Japanese, Roman, and Greek soldiers fighting against Exovum and Ezpinez Fryhtans. The music i really cant tell because i have not heard any music at all since i have been playing, but the sound effects are good. The Intro movie is superb and gets the epic feeling the game conveys perfectly. The dynamic campaigns are fun and add to the replayablility. Also not that this is nothing like age of empires.\n\nI recommend this game to anyone who is looking for a very deep and detailed strategy game, this is far from a generic rts game.&quot; \n\n(lazychazman - Gamespot)\n\n\nAny questions, comment below\n\n","torrent":{"xt":"urn:btih:b9420701e312d634792ab702349913ce1c5f623e","amp;dn":"SEVEN.KINGDOMS.II.FRYHTAN.WARS-T-PLAGUE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9420701e312d634792ab702349913ce1c5f623e","infoHashBuffer":{"type":"Buffer","data":[185,66,7,1,227,18,214,52,121,42,183,2,52,153,19,206,28,95,98,62]},"announce":[],"urlList":[]}}