{"title":"FF: One Way Street - Fragments For Walter Benjamin (1993)","uid":4452994,"size":523565444,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ba4aa801e0ae9d387aa680745f42635866e6d5ba&amp;dn=FF%3A+One+Way+Street+-+Fragments+For+Walter+Benjamin+%281993%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"radice","files":1,"time":1224351426,"description":"ONE WAY STREET explores the life and work of German Jewish critic and philosopher, Walter Benjamin, who died escaping the Gestapo in 1940. Although Benjamin's work is little known in this country, he is regarded in Europe as one of the most influential figures in 20th Century thought.\n\nONE WAY STREET provides clear and accessible introductions to some of the central ideas in Benjamin's writings. Expert commentary from a range of English scholars situate Benjamin's work in the context of their time and evoke a sense of the excitement that his work has generated. A heightened visual style, montage structure and strong musical treatments correspond in evocative and powerful ways with the concerns and the strategies of Benjamin himself.\n\nYear: 1993\nClassification: G\nRuntime: 58 min\nProduced In: Australia\nDirected By: John Hughes\nLanguage: English\n\n***\nFreakyFlicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe FreakyFlicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde. \n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n   &lt;a href=&quot; http://freakyflicks.proboards54.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://freakyflicks.proboards54.com/&lt;/a&gt;\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'\n***\nthis is a seed of adownload provided by http://einbahnstrasse.blogsport.de","torrent":{"xt":"urn:btih:ba4aa801e0ae9d387aa680745f42635866e6d5ba","amp;dn":"FF%3A+One+Way+Street+-+Fragments+For+Walter+Benjamin+%281993%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba4aa801e0ae9d387aa680745f42635866e6d5ba","infoHashBuffer":{"type":"Buffer","data":[186,74,168,1,224,174,157,56,122,166,128,116,95,66,99,88,102,230,213,186]},"announce":[],"urlList":[]}}