{"title":"Doctor Who - The Devil Goblins From Neptune - Keith Topping &amp;amp","uid":9096075,"size":1248841,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bbe76076d4be450caffeb6c5b3de97e08e420530&amp;dn=Doctor+Who+-+The+Devil+Goblins+From+Neptune+-+Keith+Topping+%26amp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1382679301,"description":"From the outer reaches of the Solar System, alien eyes are surveying the Earth. Eyes as cold and cruel as the methane ice that shrouds their distant world...\n\nThe Doctor is perturbed when a spate of deaths follows the break-up of an alien mass in the atmosphere. But this is merely the latest incident in a sinister conspiracy that threatens the entire planet, and the Doctor himself is embroiled in the plans of all the players.\n\nThe Brigadier's concern is heightened by the possibility of traitors at the very heart of UNIT. Leaving for Geneva to discover the truth, he little realises the deadly motives of an enemy agent on his own doorstep. The Doctor and Liz, meanwhile, discover that Londondoesn't have a monopoly on alien invasions.\n\nWhat are the gargoyle-like creatures that kill without mercy? What do they want from our planet - and how do they figure in top-secret governmental plans ?\n\nAs the lines between allies and enemies begin to blur, the Doctor finds himself fighting to save Earth once again. But who will he be saving it for ?","torrent":{"xt":"urn:btih:bbe76076d4be450caffeb6c5b3de97e08e420530","amp;dn":"Doctor+Who+-+The+Devil+Goblins+From+Neptune+-+Keith+Topping+%26amp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbe76076d4be450caffeb6c5b3de97e08e420530","infoHashBuffer":{"type":"Buffer","data":[187,231,96,118,212,190,69,12,175,254,182,197,179,222,151,224,142,66,5,48]},"announce":[],"urlList":[]}}