{"title":"Poison Ivy Tetralogy","uid":4673931,"size":2932977664,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bd56b1a83f362f88f6479d9943022b5401f73f49&amp;dn=Poison+Ivy+Tetralogy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"kaleidoskoop","files":4,"time":1232829161,"description":"Poison Ivy 1: http://www.imdb.com/title/tt0105156/\n\nA sexy teen (Barrymore) who lives with her aunt moves in with a reclusive teen (Gilbert) and slowly works her way into the lives of her adopted family. The mother (Ladd) is sickly and can't sexually satisfy her husband (Skerritt) any more, and to the daughter's horror, begins seducing her father.\n\nPoison Ivy 2: http://www.imdb.com/title/tt0114151/\n\nLily is a sheltered art student from Michigan going to school in California. She finds an apartment and her roommates aren't quite normal. One day she finds a box of items belonging to a girl she's never met before. But in the box are nude pictures of the girl and her diary. Lily begins reading the diary and realizes that she's going to change her life and become a wild woman! She begins dating a guy and at the same time her art instructor begins to lust after her. The struggle begins when her boyfriend thinks she's unfaithful to him and her art teacher becomes obsessed.\n\n\nPoison Ivy 3: http://www.imdb.com/title/tt0119908/\n\nIvy's sister, Violet, comes to visit the Greer residence in this third installment of the franchise. It does not take long for the family to be turned upside down as Violet uses her body and skills of manipulation to throw the household into a state of panic and deceit. \n\n\nPoison Ivy 4: http://www.imdb.com/title/tt1131749/\n\nDanielle &quot;Daisy&quot; Brookes is an orphan who leaves her ranch and her boyfriend to pursue her school degree. She is &quot;tapped&quot; by the Ivy Society because the leader of the Ivy Society wants an internship that Daisy is in line for. Later she finds out that they have a killing history that was covered up by the dean, who is also an Ivy. The girls attempt to make Daisy one of them fully, but they fail. She then teams up with the dean's son Blake, to take down the Ivies once and for all. She finally takes them down by taping the leader (Azalea) admitting to her murderous behavior and her attempt to set up Daisy. A fight ensues in the pool, where Daisy pretends to drown and then overpowers Azalea once Azalea thinks she has won.","torrent":{"xt":"urn:btih:bd56b1a83f362f88f6479d9943022b5401f73f49","amp;dn":"Poison+Ivy+Tetralogy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd56b1a83f362f88f6479d9943022b5401f73f49","infoHashBuffer":{"type":"Buffer","data":[189,86,177,168,63,54,47,136,246,71,157,153,67,2,43,84,1,247,63,73]},"announce":[],"urlList":[]}}