{"title":"Seduction of the Innocent The Comics that made comics code","uid":8213890,"size":1251714038,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:be4baa5250d488e6b4a8726306dd3d3408ad09b9&amp;dn=Seduction+of+the+Innocent+The+Comics+that+made+comics+code&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mothra67","files":-1,"time":1362300139,"description":"Seduction of the Innocent, written by psychiatrist Fredric Wertham was first published in 1954. It was a pivotal moment in the history of comics. In its pages Wertham pointed his finger at comic books, accusing them of being one of the major causes of juvenile delinquency.\n\nAlthough Wertham blamed &quot;crime comics&quot; his definition was wide, encompassing both horror and superhero genres.\nThe publication of Seduction of the Innocent coincided with the launch of a U.S. Congressional inquiry into the industry. In America, there now emerged a concerted campaign for censorship of comic books.\n\nAs a response publishers created the voluntary Comics Code Authority. They hoped that self-censorship would save their titles and businesses.\n\nApart from the noticeable Comics Code Authority stamp on the covers, the now sanitized content meant many titles folded. The industry had suffered a major body blow and for some publishers it was fatal.\n\nIn this torrent are the very books that Fredric Wertham cited in Seduction of the Innocent. After reading them what is your opinion?!\n\nHave fun reading all these precode comics!\n\nPlease seed and allow others to enjoy, as I have limited bandwidth","torrent":{"xt":"urn:btih:be4baa5250d488e6b4a8726306dd3d3408ad09b9","amp;dn":"Seduction+of+the+Innocent+The+Comics+that+made+comics+code","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be4baa5250d488e6b4a8726306dd3d3408ad09b9","infoHashBuffer":{"type":"Buffer","data":[190,75,170,82,80,212,136,230,180,168,114,99,6,221,61,52,8,173,9,185]},"announce":[],"urlList":[]}}