{"title":"The Last Painting of Sara de Vos by Dominic Smith","uid":15248262,"size":264335234,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bf05df173b14a8216bb298f0a3bef9a0728930d4&amp;dn=The+Last+Painting+of+Sara+de+Vos+by+Dominic+Smith&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nimby13","files":1,"time":1468022404,"description":"Note that this is a single, unabridged, one-channel (mono) recording, mp3, 264.3 mb, 9 hours 47 minutes.\r\n\r\nThe Last Painting of Sara de Vos\r\nby Dominic Smith\r\n\r\nNarrator: Edoardo Ballerini\r\n\r\nA New York Times Bestseller\r\nA New York Times Book Review Editors' Choice\r\n\r\nThis is what we long for: the profound pleasure of being swept into vivid new worlds, worlds peopled by characters so intriguing and real that we can't shake them, even long after the reading's done. In his earlier, award-winning novels, Dominic Smith demonstrated a gift for coaxing the past to life. Now, in The Last Painting of Sara de Vos, he deftly bridges the historical and the contemporary, tracking a collision course between a rare landscape by a female Dutch painter of the golden age, an inheritor of the work in 1950s Manhattan, and a celebrated art historian who painted a forgery of it in her youth.\r\nIn 1631, Sara de Vos is admitted as a master painter to the Guild of St. Luke's in Holland, the first woman to be so recognized. Three hundred years later, only one work attributed to de Vos is known to remain--a haunting winter scene, At the Edge of a Wood, which hangs over the bed of a wealthy descendant of the original owner. An Australian grad student, Ellie Shipley, struggling to stay afloat in New York, agrees to paint a forgery of the landscape, a decision that will haunt her. Because now, half a century later, she's curating an exhibit of female Dutch painters, and both versions threaten to arrive. As the three threads intersect, The Last Painting of Sara de Vos mesmerizes while it grapples with the demands of the artistic life, showing how the deceits of the past can forge the present.\r\nThis program includes a Reading Group Guide read by the author.\r\n------\r\nUploader's note:\r\n\r\nThis is my first torrent, and this is my rationale for sharing it with you:\r\nI paid for this audiobook from Audible, but because of their DRM it will not work on any older device that does not support the latest audible app. After hours of trying work arounds, and an hour with customer support at audible, there was no solution, except that I buy a newer computer and a newer playback device. Well, that pissed me off, so I borrowed a friend's computer, connected the audio out to the audio in, and created my own drm free version. Hope this helps you!","torrent":{"xt":"urn:btih:bf05df173b14a8216bb298f0a3bef9a0728930d4","amp;dn":"The+Last+Painting+of+Sara+de+Vos+by+Dominic+Smith","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf05df173b14a8216bb298f0a3bef9a0728930d4","infoHashBuffer":{"type":"Buffer","data":[191,5,223,23,59,20,168,33,107,178,152,240,163,190,249,160,114,137,48,212]},"announce":[],"urlList":[]}}