{"title":"Origin - Antithesis (2008)/Raiden","uid":4183432,"size":87600126,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bf6a19051622d846e61048858be536918b71649e&amp;dn=Origin+-+Antithesis+%282008%29%2FRaiden&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"raiden395","files":12,"time":1210532352,"description":"&quot;For some people, this is the most extreme band that exists in the Metal scene, for others ORIGIN is only a noise factory and nothing more. I don?t want to spoil the surprise, but I have to reveal to you that I belong to the first category, not 100% though. I believe that I have listened to bands that are more extreme than ORIGIN. Anyway, I am not here to see if these guys are the most extreme act, but if their new album can keep kicking our ass as their previous ones did.\n\nThe Kansas based death metallers may feature members from other well known Death Metal bands, but I don?t think that with such monstrous music they need extra advertisement. Members come and go in the 11 years of existence of this band and musicians who have played with acts like UNMERCIFUL, CEPHALIC CARNAGE and VILE play or have played with this band. Who cares though...? I need no previous experience and such stuff from a band like ORIGIN. I don?t care even if its members were playing Pop before they form this band. They simply kick ass!\n\nFirst of all, I would like to send a message to my beloved Relapse Records. This irritating goddamn thingie you do with the promo CD?s and they can?t be played on a PC is incredibly meaningless. You think that this way nobody will be able to rip the album? If someone wants to do it, he?ll do it one way or another. What you do with this thing is making our lives harder. Anyway...\n\nWhat do we have here? A Death Metal manifesto by one of the best Death Metal bands the new wave of Death Metal (meaning the newer bands, not the incredibly shitty melodic Death Metal/Metalcore scene) has produced. ORIGIN present a triple vocal attack along with their technical and monstrous riffing and we just ask for more (or for mercy). Relentless blasts and fucking awesome bass lines by the one and only Mike Flores (also in GORGASM) are some of the parts that form the ORIGIN puzzle.\n\nThe production is also clean and heavy, exactly as a modern Death Metal production should be. That?s exactly why the band trusted producer Robert Rebeck for one more time, since he is the one who made the band?s previous full-length release &quot;Echoes Of Decimation&quot; sound as a rock that smashes your bones. There is just thing I didn?t agree at all. The promo note on the back of the promo CD I got says that this album is recommended if you like bands like CANNIBAL CORPSE, JOB FOR A COWBOY, THE BLACK DAHLIA MURDER and some other bands. It is ok for me saying that a Death Metal band reminds of CANNIBAL CORPSE or MORBID ANGEL, but how can you compare an incredibly brutal and technical Death Metal band to Deathcore bands like THE BLACK DAHLIA MURDER and JOB FOR A COWBOY? Great bands, but definitely not pure Death Metal ones.&quot; - http://www.metal-temple.com/review.asp?id=2812\n\nOrigin\n\nAntithesis - (2008)\n\n1. The Aftermath\n2. Algorithm\n3. Consuming Misery\n4. Wrath Of Vishnu\n5. Finite\n6. The Appalling\n7. Void\n8. Ubiquitous\n9. The Beyond Within\n10.Antithesis\n\nPersonally, I fucking love these guys.\n","torrent":{"xt":"urn:btih:bf6a19051622d846e61048858be536918b71649e","amp;dn":"Origin+-+Antithesis+%282008%29%2FRaiden","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf6a19051622d846e61048858be536918b71649e","infoHashBuffer":{"type":"Buffer","data":[191,106,25,5,22,34,216,70,230,16,72,133,139,229,54,145,139,113,100,158]},"announce":[],"urlList":[]}}