{"title":"FSX-FS9-Wings Of Power P-51D-Mustang","uid":5424002,"size":35271403,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bf7f23dc856b01790b1eae9bd94f16ceebbd1c89&amp;dn=FSX-FS9-Wings+Of+Power+P-51D-Mustang&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"arfus","files":-1,"time":1268180143,"description":"The Wings of Power P-51D Mustang, like all Wings of Power aircraft, was created with a process called &quot;Absolute Realism&quot;.  The flight model was very carefully researched.  We interviewed many pilots who flew the P-51D, two of them double aces.  We took our own orientation flights in existing P-51D aircraft to get a true feel for how these marvelous aircraft sound and fly in real life.  And we used the actual pilot's training manual and technical orders to ensure our procedures and performance matched the real thing as closely as possible.  This release, with our &quot;World War II Fighters&quot; package, represents the latest in &quot;Absolute Realism&quot; and incorporates advances in the flight modeling.  Subtle changes in stability will be noticed as compared to our original P-51D Mustang.  We have also introduced a new aspect of realism by incorporating the airspeed indicator error factor into the pilot's airspeed indicator.  By consulting the chart below, you can find the actual calibrated airspeed as compared to the speed shown on the pilot's airspeed indicator.  This is yet another aspect of &quot;Absolute Realism&quot;.\n \n\nFeatures:\n\nÃƒÂ¼       Unsurpassed attention to detail\nÃƒÂ¼       Can be flown &quot;by the book&quot;\nÃƒÂ¼       Gorgeously constructed aircraft, down to the last rivet\nÃƒÂ¼       The latest wind-tunnel technology helps to create the most authentic flying qualities\nÃƒÂ¼       Enhanced visual effects and lighting \nÃƒÂ¼       Authentic audio recorded by sound professionals\n","torrent":{"xt":"urn:btih:bf7f23dc856b01790b1eae9bd94f16ceebbd1c89","amp;dn":"FSX-FS9-Wings+Of+Power+P-51D-Mustang","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf7f23dc856b01790b1eae9bd94f16ceebbd1c89","infoHashBuffer":{"type":"Buffer","data":[191,127,35,220,133,107,1,121,11,30,174,155,217,79,22,206,235,189,28,137]},"announce":[],"urlList":[]}}