{"title":"The Simpsons - Season 2 - Audio Commentary - DVDRip - AAC","uid":7402117,"size":284176152,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:bf967e4cf142a890f2c9323326bb05d2ee06132a&amp;dn=The+Simpsons+-+Season+2+-+Audio+Commentary+-+DVDRip+-+AAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"schleicher","files":24,"time":1341143883,"description":"Bart Gets an F (7F03) (Audio Commentary by Matt Groening, James L. Brooks, Al Jean, Mike Reiss and David Silverman)\n\nBart Gets Hit By A Car (7F10) (Audio Commentary by Matt Groening, Mike Reiss and Mark Kirkland)\n\nBart the Daredevil (7F06) (Audio Commentary by Matt Groening, Jay Kogen, Wallace Wolodarsky, Al Jean and Mike Reiss)\n\nBart vs. Thanksgiving (7F07) (Audio Commentary by Matt Groening, James L. Brooks, George Meyer, Al Jean, Mike Reiss and David Silverman)\n\nBart's Dog Gets an F (7F14) (Audio Commentary by Matt Groening, Jon Vitti, Al Jean and Jim Reardon)\n\nBlood Feud (7F22) (Audio Commentary by Matt Groening, Al Jean and David Silverman)\n\nBrush with Greatness (7F18) (Audio Commentary by Matt Groening, Brian K. Roberts, Al Jean and Jim Reardon)\n\nDancin' Homer (7F05) (Audio Commentary by Matt Groening, David Isaacs, Ken Levine, Mike Reiss and Mark Kirkland)\n\nDead Putting Society (7F08) (Audio Commentary by Matt Groening, Jeff Martin, Al Jean, Mike Reiss and Rich Moore)\n\nHomer vs. Lisa and the 8th Commandment (7F13) (Audio Commentary by Matt Groening, Steve Pepoon, Al Jean, Mike Reiss and Rich Moore)\n\nItchy &amp; Scratchy &amp; Marge (7F09) (Audio Commentary by Matt Groening, Al Jean, Mike Reiss and Jim Reardon)\n\nLisa's Substitute (7F19) (Audio Commentary by Matt Groening, Jon Vitti, Al Jean, Mike Reiss and Rich Moore)\n\nOh Brother, Where Art Thou (7F16) (Audio Commentary by Matt Groening, Jeff Martin, Al Jean and Mike Reiss)\n\nOld Money (7F17) (Audio Commentary by Matt Groening, Jay Kogen, Wallace Wolodarsky, Al Jean and David Silverman)\n\nOne Fish, Two Fish, Blowfish, Blue Fish (7F11) (Audio Commentary by Matt Groening, Nell Scovell, Al Jean and Mike Reiss)\n\nPrincipal Charming (7F15) (Audio Commentary by Matt Groening, Mike Reiss and Mark Kirkland)\n\nSimpson and Delilah (7F02) (Audio Commentary by Matt Groening, Jon Vitti and Al Jean)\n\nThe War of the Simpsons (7F20) (Audio Commentary by Matt Groening, Mike Reiss and Mark Kirkland)\n\nThe Way We Was (7F12) (Audio Commentary by Matt Groening, James L. Brooks, Al Jean, Mike Reiss and David Silverman)\n\nThree Men and a Comic Book (7F21) (Audio Commentary by Matt Groening, Jeff Martin, Al Jean and Mike Reiss)\n\nTreehouse of Horror (7F04) (Audio Commentary by Matt Groening, Al Jean and Mike Reiss (act 1); Matt Groening, James L. Brooks, Jay Kogen, Wallace Wolodarsky and Al Jean (act 2); Matt Groening, Al Jean, Mike Reiss and David Silverman (act 3))\n\nTwo Cars in Every Garage and Three Eyes on Every Fish (7F01) (Audio Commentary by Matt Groening, Al Jean and Mike Reiss)","torrent":{"xt":"urn:btih:bf967e4cf142a890f2c9323326bb05d2ee06132a","amp;dn":"The+Simpsons+-+Season+2+-+Audio+Commentary+-+DVDRip+-+AAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf967e4cf142a890f2c9323326bb05d2ee06132a","infoHashBuffer":{"type":"Buffer","data":[191,150,126,76,241,66,168,144,242,201,50,51,38,187,5,210,238,6,19,42]},"announce":[],"urlList":[]}}