{"title":"A-PDF AutoMail 2.3.0 [ak]","uid":6422155,"size":6318515,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c0d5337b4c1dd3e4d55c67dea9af34e63007e91d&amp;dn=A-PDF+AutoMail+2.3.0+%5Bak%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1306335503,"description":"A-PDF AutoMail 2.3.0\n\nA-PDF AutoMail is a PDF Bulk email software for Windows that allows you to automatically batch send your PDF documents that contain recipient email addresses as part of the document text or properties. A-PDF AutoMail can send volumes of personalized PDF documents such as invoices, statements, reports, bills and etc via email.\n\nWhy A-PDF AutoMail\nExtracting E-mail address using PDF Content text\nA-PDF Automail can extract E-mail address from PDF content and use the address to send email automatically. A-PDF Automail also can extract PDF content and use it as a part of subject and body of email.\n\nBlock Specific E-mail Addresses\nA-PDF Automail provides ability to block certain e-mail addresses from being used/recognized. This feature is useful when document's contains certain e-mail addresses as a part of text which should be excluded from a recipient's list.\n\nMap CSV Fileds To Email Addresses\nA-PDF Automail provides an option to determine a recipient for each outgoing file based on a user-defined CSV filename-to-email mapping. Simply type in filenames come from CSV file) and corresponding email addresses and the A-PDF Automail will do the rest.\n\nUse PDF Document Properties to Designate E-mail Recipients\nUse PDF document properties to add e-mail recipients, CC, BCC and message subjects to the PDF documents that do not contain this information as part of the text. Document properties can be as Author, Title, Subject and Keywords etc.\n\nPreview and Confirm Results\nEasily preview, edit, and modify extracted email addresses, message text and subject, preview PDF attachments before sending documents out to the recipients.\n\nE-mail Support\nA-PDF AutoMail uses either your current e-mail client such as Microsoft Outlook or SMTP (Simple Mail Transfer Protocol) Internet E-mail server. SMTP is the De facto standard for email transmissions across the Internet and provides functionality for sending volumes of e-mail messages without user interaction.\n\nSecure Outgoing Documents\nOptionally secure outgoing PDF documents with a &quot;document open&quot; and &quot;user permission&quot; passwords. Restrict editing, printing and content extraction. Recipients will be required to enter a &quot;document open&quot; password in order to view its content.\n\nMultiple Attachments\nDistribute more than a single file to each recipient using a list of default attachments that should be emailed to all recipients indiscriminately.\n\nMessage Log\nA-PDF AutoMail records date, time, file name, and all recipients for each outgoing e-mail.\n\nSave your time\nA-PDF AutoMail can batch email process hundreds documents one time and very fast.\n\nHome Page - http://www.a-pdf.com/\n\n","torrent":{"xt":"urn:btih:c0d5337b4c1dd3e4d55c67dea9af34e63007e91d","amp;dn":"A-PDF+AutoMail+2.3.0+%5Bak%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0d5337b4c1dd3e4d55c67dea9af34e63007e91d","infoHashBuffer":{"type":"Buffer","data":[192,213,51,123,76,29,211,228,213,92,103,222,169,175,52,230,48,7,233,29]},"announce":[],"urlList":[]}}