{"title":"The Janissary Tree - Jason Goodwin  (Unabridged)","uid":6112139,"size":410032486,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c153f32d7dd58a0c5b5e48dbcf1a2328b6eb516e&amp;dn=The+Janissary+Tree+-+Jason+Goodwin++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Lucy1948","files":10,"time":1295394673,"description":"Audio Books : Mystery : MP3/64Kbps : English\n\nInvestigator Yashim, the hero of Jason Goodwin's first novel, &quot;The Janissary Tree&quot; may be a Turkish eunuch but it is not at all likely that anyone reading this book will think of him as a &quot;dry tree&quot;. In fact, if Yashim's steamy encounter with the beautiful but lonely wife of the Russian ambassador to Turkey halfway through the book is any indication, this is one heck of a unique eunuch.\n\nI would love to have been present when Goodwin pitched the idea of a novel (and the first in a proposed series) about a crime-solving eunuch in Istanbul to his agent or publisher. Fortunately, someone had the good sense to green light this project as Goodwin has crafted a highly-entertaining book.\n\nThe Janissary Tree is set in Istanbul in 1836. Ten years earlier the Janissaries, the Sultan's version of the Roman Empire's Praetorian Guards, had been crushed by the &quot;New Guard&quot;, the Sultan's standing army. Like the Praetorian Guards the Janissaries had evolved from a protective legion to one that terrorized the populace and the Sultan. Now, ten years later, the mysterious disappearance of four members of the New Guard and the murder of one of the Sultan's harem heralds the possible return of the Janissaries. The return of the Janissaries threatens to destroy the Sultanate and the relative calm of Istanbul. Enter Investigator Yashim. He is given ten days to get to the bottom of the mystery.\n\nYashim is soon engulfed in murder and intrigue. Bodies begin to appear in bizarre places as Yashim and his friends (including a somewhat decadent Polish Ambassador who has no country to represent and a transvestite dancer) try to get to the bottom of this alleged revolt.\n\nGoodwin is very good at keeping the plot boiling (in more ways than one). Goodwin, who studied Byzantine history at Cambridge and who has written books on the history of the Ottoman Empire, has ample knowledge of the time and the place and has put this knowledge to good use. Goodwin seems to convey a real sense of how the city must have looked, felt, and even smelled more than 180 years or so ago.\n\nRead by Stephen Hoye.","torrent":{"xt":"urn:btih:c153f32d7dd58a0c5b5e48dbcf1a2328b6eb516e","amp;dn":"The+Janissary+Tree+-+Jason+Goodwin++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c153f32d7dd58a0c5b5e48dbcf1a2328b6eb516e","infoHashBuffer":{"type":"Buffer","data":[193,83,243,45,125,213,138,12,91,94,72,219,207,26,35,40,182,235,81,110]},"announce":[],"urlList":[]}}