{"title":"The Fetish Room: The Education of a Naturalist","uid":8845186,"size":1479441,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c271c6ce472d37f0ed3c419a4c0ff1937914f8eb&amp;dn=The+Fetish+Room%3A+The+Education+of+a+Naturalist&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"livhre","files":-1,"time":1377361717,"description":"Redmond O'Hanlon is known as an amiable anti-hero - the debunker of classical exploration literature - and here on this joint road trip with journalist Rudi Rotthier, O'Hanlon visits places from his dark childhood. With a fine sense of the comic and beautifully rendered observations of the people they encounter, Rotthier excels in painting a portrait of this English author as he details the escapades of their journey. O'Hanlon provides a stream of jokey anecdotes which offset the bleakness of almost all his memories as do their conversations on God, Darwin and nature. Plagued by depression and scarred by his childhood and sadistic teachers, O'Hanlon drinks excessively, pops caffeine and nicotine pills. One of his most important possessions is a jar containing some of the charred remains of a close friend who committed suicide. In his house in Oxfordshire piles of books have spilled over tables and shelves and tottering mounds of dirty crockery obscure the sink. Yet, unlikely as it may seem, this is a remarkably light-hearted, sensitive and funny book. ","torrent":{"xt":"urn:btih:c271c6ce472d37f0ed3c419a4c0ff1937914f8eb","amp;dn":"The+Fetish+Room%3A+The+Education+of+a+Naturalist","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c271c6ce472d37f0ed3c419a4c0ff1937914f8eb","infoHashBuffer":{"type":"Buffer","data":[194,113,198,206,71,45,55,240,237,60,65,154,76,15,241,147,121,20,248,235]},"announce":[],"urlList":[]}}