{"title":"Mr. Wilkinson's Vegetables","uid":12455559,"size":23480582,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c3707dff7aa0302b5c6a18acfb673994b6c39a51&amp;dn=+Mr.+Wilkinson%27s+Vegetables&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":1,"time":1442741248,"description":"\nMr. Wilkinson's Vegetables by Matt Wilkinson\n\nOverview: This lush, creative cookbook celebrates the flavor and versatility of vegetables by bringing them to the center of the table in more than 80 delicious, easy-to-prepare recipes.\n\nToo many of us let vegetables play second fiddle in meals that center on protein or carbs. For chef Matt Wilkinson, vegetables come first. He builds his dishes around vegetables that are in season, when they taste the best, are most affordable, and most readily available.\n\nThe recipes in Mr. Wilkinson's Vegetables range from simple salads such as Brussels Sprout Leaves, Mozzarella, and Anchovies, or Roasted Cucumber, Quinoa, Freekah, and Herbs, to hearty dishes such as Soft Parmesan Polenta with Crab and Mussels, or Braised Eggplant, Tomato, and Meatballs. They also include satisfying snacks like Irene's Tzatziki, or Smoked Tomato and Goat's Curd Gougeres, as well as desserts, such as Carrot Cake with Grated Carrot, Preserved Lemon, Raisin, and Ginger Pickle, or Creamed Rice Pudding. While many of the 80 plus dishes will appeal to vegetarians, there are plenty that incorporate meat. In all of them, Mr. Wilkinson's vegetables are the stars","torrent":{"xt":"urn:btih:c3707dff7aa0302b5c6a18acfb673994b6c39a51","amp;dn":"+Mr.+Wilkinson%27s+Vegetables","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3707dff7aa0302b5c6a18acfb673994b6c39a51","infoHashBuffer":{"type":"Buffer","data":[195,112,125,255,122,160,48,43,92,106,24,172,251,103,57,148,182,195,154,81]},"announce":[],"urlList":[]}}