{"title":"Stina Nordenstam - The World Is Saved 2004","uid":6566795,"size":249182164,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c4103dcfaa366e357b9be056da28a9e99f91d299&amp;dn=Stina+Nordenstam+-+The+World+Is+Saved+2004&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1311716194,"description":"For so long Stina Nordenstam appeared to be running away.\nLike escape itself became the destination.\nHer music was homeless because thats what she wanted it to be.\nAlbums were recorded in Los Angeles; musicians were flown in from all over The world, silly amounts were spent on photo sessions in New York.\nUntil the only constant was her voice.\n\nThis time, she decided to come home.\nThis time, she knows things she didnt know before.\nThis time, she has decided where home actually is.\nThis is why The world is saved was conceived and recorded in Stockholm, Sweden, employing Swedish musicians, some of the countrys most intense and innovative musicians, including trumpeter Goran Kajfes and bass player - and visionary behind the acclaimed HÃƒÂ¤pna label Ã‚Â­ Johan Berhling.\n\nAnyone who has followed Stina's music over the 13 years since her debut album, Memories of a color, knows this doesnt mean she has come to a standstill.\nThis is not goodbye.\nThere never was one, hopefully never will be.\nEvery album, every song, she has ever recorded has been written out of necessity, each album born from a reaction against the previous one.\nFew artists, if any, are as brutally honest as Stina. Every wound is in there somewhere, all the scars there for everyone to see. On The world is saved, Stina's first album on her own label, A walk in the park (the name of a song title from her 1991 debut) the healing is in its full bloom.\n\nAs the title suggests, this is some of the most hopeful music Stina Nordenstam has ever recorded.\n\nStill, she has always felt a strong sense of belonging with - what she calls\n- the misfits.\n- The junkies, the homeless, the addicts and the mentally ill. The human beings society never knows how to deal with and therefore treat as aliens. They are the people that I can relate to, whom I feel empathy with. To me, each one of them is worth ten times more than any Vice President. Two songs on the album (Im staring at the world and The morning belongs to the night) started out as part of a Swedish TV documentary by Adam Nilsson called Jean-Claude about a Parisian who once was both a florist and a celebrated model but lived most of his life on the streets. The Jean-Claudes of this world will forever play an important part in the music, art and life of Stina Nordenstam.\n\nListening to her music, reading her lyrics, we should be thankful that someone, in times as empty, shallow and superficial as ours, dares to be this complicated, this human.\nAnd still without forgetting the importance of beauty. Melodies as precious as Stina's are a rare thing. Treasure them, hold them like your childrens' lives depended on it.\nIf you listen to them carefully you dont have to sleep, we can just sit here and together and watch the sun come up.\n\nby Andres Lokko Stockholm, July 2004\n\n\n- - -\n\nStina Nordenstam - The world is saved 2004\n(Stockholm V2)\n\n 1. Get On With Your Life\n 2. Winter Killing\n 3. On Falling\n 4. Parliament Square\n 5. I'm Staring Out The World\n 6. From Cayman Islands With Love\n 7. Morning Belongs To The Night\n 8. 125\n 9. Butterfly\n10. World Is Saved\n11. End Of A Love Affair\n","torrent":{"xt":"urn:btih:c4103dcfaa366e357b9be056da28a9e99f91d299","amp;dn":"Stina+Nordenstam+-+The+World+Is+Saved+2004","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4103dcfaa366e357b9be056da28a9e99f91d299","infoHashBuffer":{"type":"Buffer","data":[196,16,61,207,170,54,110,53,123,155,224,86,218,40,169,233,159,145,210,153]},"announce":[],"urlList":[]}}