{"title":"Kenny Blue Ray Fired Up(blues rock)(flac)[rogercc]","uid":6324617,"size":253755409,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c425b5db254130b637d18bd71efea80a70355238&amp;dn=Kenny+Blue+Ray+Fired+Up%28blues+rock%29%28flac%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rogercc1","files":16,"time":1303066775,"description":"KENNY BLUE RAY FIRED UP\nReleased:1994\nLabel: Blue Ray\nFormat:Flac\n\nOne of the most interesting features on the modern blues scene has been the advent of the non-singing guitarist/bandleader, artists like Ronnie Earl, Anson Funderburgh, and Little Charlie Baty, whose prowess as instrumentalists has led to their names appearing on billboards and CD sleeves with the vocalists appearing as &quot;featured artists.&quot;To the above list of talented instrumentalists, you can now add the name of Kenny Blue Ray. Kenny is a blues veteran of 35 years whose pedigree includes recording and appearing with artists the caliber of William Clarke, Little Charlie and the Nightcats, Charlie Musselwhite, Smokey Wilson, Albert Collins, and Stevie Ray Vaughan.\n\nAlthough this album is very SRV influenced, (The album, in part is dedicated, to the Vaughan brothers), Kenny &quot;Blue&quot; Ray has his own instrumental technique, and he uses it to great effect on some classic numbers by Magic Sam, Little Milton, Freddy and Albert King, Bobby Bland, Howlin' Wolf and A.C. Reed, while also presenting seven original compositions. Rather than play jaw dropping, mind blowing solos, Kenny &quot;Blue&quot; Ray plays with a subtleness, and dexterity, that beautifully ekes the blues out. Little Danny's heartfelt singing complements Kenny &quot;Blue&quot; Ray's beautifully understated guitar work perfectly.\n\nImpressed by credentials? Kenny &quot;Blue&quot; Ray has played with Albert Collins, James Cotton, Ronnie Earl, Lowell Fulson, John Lee Hooker, Charlie Musselwhite, Little Charlie &amp; the Nightcats, Rod Piazza, Hubert Sumlin, Big Mama Thornton, Stevie Ray Vaughan, and more, including such Bay Area luminaries as Tommy Castro and Kevin Russell. &quot;Blue&quot; developed his chops and licks in locales including London, Los Angeles, and Austin. On his own since 1990, Kenny &quot;Blue&quot; Ray's been cranking out CDs since 1994 and has in fact appeared on some 40 albums.\n\nTracklist\n1. Squeezin' 2:47\n2. Everythings Gonna Be Alright 3:58\n3. Fired Up! 3:01\n4. Found Me A New Love 5:32\n5. Just Pickin' 2:38\n6. Ridin' In The Moonlight 2:45\n7. Little Voice 3:17\n8. Tele Talk 2:52\n9. Crib Theme 6:28\n10. Honey Bee 2:10\n11. Where's My Cadillac? 3:00\n12. Blues For Albert King 2:35\n13. The Bushmaster 3:58\n\nRecorded at Dave Wellhausen's Studio, San Francisco, California in September 1993 and Sound Tek Studio B,Campbell, California in August 1994.\n\nPersonnel:\nKenny &quot;Blue&quot; Ray (guitar)\nLittle Danny (vocals, harmonica)\nMike Schermer (guitar)\nRock Hendricks (saxophone)\nDuke Jethro (Hammond B-3 organ)\nBurt Winn (bass)\nJim Overton, June Core (drums)","torrent":{"xt":"urn:btih:c425b5db254130b637d18bd71efea80a70355238","amp;dn":"Kenny+Blue+Ray+Fired+Up%28blues+rock%29%28flac%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c425b5db254130b637d18bd71efea80a70355238","infoHashBuffer":{"type":"Buffer","data":[196,37,181,219,37,65,48,182,55,209,139,215,30,254,168,10,112,53,82,56]},"announce":[],"urlList":[]}}