{"title":"(PSX-PSP) Dead Or Alive [wetwilly =P]","uid":4695946,"size":357237948,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:c552971ea07d4c4f1328aabdd4dbd5309e7b64e7&amp;dn=%28PSX-PSP%29+Dead+Or+Alive+%5Bwetwilly+%3DP%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wetwilly11","files":-1,"time":1233559420,"description":"            (MUST have custom firmware!)\n\n       only test on 5.00 m33-6 and popsloader v3.3!\n\n\n\nDead or Alive was originally released as an arcade game that ran on Sega's Model 2 board (read Virtua Fighter 2) some time ago. A perfect arcade port later appeared on the Saturn in Japan and was considered one of the better fighting games on the system. The title has of course recently resurfaced on the PlayStation with a fresh new look, with new character models that look significantly better than the Saturn and arcade versions.\n\nThe game features nine playable characters from the get-go with two more attainable via total completion of the game. Every time you beat the game you are rewarded with a new outfit for one of the characters. There is a total of 84 costumes in all, which range from your typical karate gi to scuba gear. The design of the characters themselves isn't groundbreaking by any means, in fact some look suspiciously similar to characters from the Street Fighter, Tekken, and Virtua Fighter series.\n\nDead or Alive's fighting engine is obviously influenced by Sega's Virtua Fighter series, with its punch, kick, and hold button setup. The hold button is just that, a button that allows you to get your opponent in grappling holds. This is really kind of cool because you can counter holds and attacks and then reverse counters on top of that, so you sometimes can get an awesome Jackie Chan-style grappling match that goes back and forth three or four times till someone messes up and pays the consequences. It may sound complicated, but since the special moves are all fairly simple to perform, anyone can easily learn how to play.\n\n100% clean and working!\n\nplease help seed for as long as you can!\n\nany and all comments welcome!\n\nENJOY! ","torrent":{"xt":"urn:btih:c552971ea07d4c4f1328aabdd4dbd5309e7b64e7","amp;dn":"%28PSX-PSP%29+Dead+Or+Alive+%5Bwetwilly+%3DP%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c552971ea07d4c4f1328aabdd4dbd5309e7b64e7","infoHashBuffer":{"type":"Buffer","data":[197,82,151,30,160,125,76,79,19,40,170,189,212,219,213,48,158,123,100,231]},"announce":[],"urlList":[]}}