{"title":"Angus Deaton - The Great Escape. Health, Wealth, and the Origins","uid":10241672,"size":11725862,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c588fb72b4874ff1b6491f25895117aaa858c64b&amp;dn=Angus+Deaton+-+The+Great+Escape.+Health%2C+Wealth%2C+and+the+Origins&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1401250113,"description":"Description\nProduct Details\nBook Title: The Great Escape: Health, Wealth, and the Origins of Inequality\t\nBook Author: Angus Deaton\nHardcover: 376 pages\nPublisher: Princeton University Press (September 23, 2013)\nLanguage: English\nISBN-10: 069115354X\nISBN-13: 978-0691153544\n\n===================================================================================\nBook Description\nPublication Date: September 23, 2013\nThe world is a better place than it used to be. People are wealthier and healthier, and live longer lives. Yet the escapes from destitution by so many have left gaping inequalities between people and between nations. In The Great Escape, Angus Deaton--one of the foremost experts on economic development and on poverty--tells the remarkable story of how, starting 250 years ago, some parts of the world began to experience sustained progress, opening up gaps and setting the stage for today's hugely unequal world. Deaton takes an in-depth look at the historical and ongoing patterns behind the health and wealth of nations, and he addresses what needs to be done to help those left behind.\nDeaton describes vast innovations and wrenching setbacks: the successes of antibiotics, pest control, vaccinations, and clean water on the one hand, and disastrous famines and the HIV/AIDS epidemic on the other. He examines the United States, a nation that has prospered but is today experiencing slower growth and increasing inequality. He also considers how economic growth in India and China has improved the lives of more than a billion people. Deaton argues that international aid has been ineffective and even harmful. He suggests alternative efforts--including reforming incentives to drug companies and lifting trade restrictions--that will allow the developing world to bring about its own Great Escape.\nDemonstrating how changes in health and living standards have transformed our lives, The Great Escape is a powerful guide to addressing the well-being of all nations.\n\n===================================================================================\nReviews\nOne of Bloomberg/Businessweek Best Books of 2013, selected by Christopher L. Eisgruber (president of Princeton University)\nOne of Forbes Magazine's Best Books of 2013\nHonorable Mention for the 2013 PROSE Award in Economics, Association of American Publishers\nLonglisted for the 2013 Business Book of the Year Award, Financial Times/Goldman Sachs\nA &quot;Best Business Book of the Year for 2013&quot; selected on LinkedIn by Matthew Bishop, Economics Editor of The Economist\nFeatured in The Sunday Times 2013 Holiday Roundup\n\n&quot;There is nobody better than Angus Deaton to explain why our lives are longer, healthier, and more prosperous than those of our great-grandparents. The story he tells is much more than an inexorable march of progress--it has also been unequal, uneven, and incomplete, and at each step, politics has played a defining role. This is a must-read for anybody interested in the wealth and health of nations.&quot;--Daron Acemoglu, coauthor of Why Nations Fail\n\n&quot;At once engaging and compassionate, this is an uplifting story by a major scholar.&quot;--Paul Collier, author of The Bottom Billion\n\n&quot;Magisterial and superb.&quot;--William Easterly, author of The White Man's Burden\n\n&quot;The Great Escape tells the two biggest stories in history: how humanity got healthy and wealthy, and why some people got so much healthier and wealthier than others. Angus Deaton, one of the world's leading development economists, takes us on an extraordinary journey--from an age when almost everyone was poor and sick to one where most people have escaped these evils--and he tells us how the billion still trapped in extreme poverty can join in this great escape. Everyone who wants to understand the twenty-first century should read this book.&quot;--Ian Morris, author of Why the West Rules--for Now\n\n&quot;Deaton's account of global advances in health is magisterial. It is especially convincing in disentangling economic progress from technological growth as sources of health improvements. A very big story, this book should affect the way we think about human development and the role of science and science-based government programs. The language is modest and graceful, the use of evidence compelling, and the illustrations highly attractive.&quot;--Samuel Preston, University of Pennsylvania\n\n&quot;This factual, sober, and very timely book deals with issues surrounding the higher incomes and longer lives enjoyed by an increasing proportion of the world's population. It assesses improvements in conditions that would have seemed almost a fantasy for people living only a few generations ago. Deaton's arguments, written in an elegant and accessible style, are powerful and challenge conventional opinions.&quot;--Branko Milanovic, author of The Haves and the Have-Nots\n\n&quot;This splendid book discusses how, in the last two hundred fifty years, large numbers of people have achieved levels of well-being that were previously available only to a few individuals, and how this achievement has given rise to equally unprecedented inequalities. Unique in its focus and scope, exceptional knowledge and coherence, and careful argumentation, The Great Escape is highly illuminating and a delight to read.&quot;--Thomas Pogge, Yale University\n\n===================================================================================\nAbout the Author\nAngus Deaton is the Dwight D. Eisenhower Professor of Economics and International Affairs in the Woodrow Wilson School of Public and International Affairs and the Economics Department at Princeton University. His many books include &quot;The Analysis of Household Surveys&quot; and &quot;Economics and Consumer Behavior&quot;. He is a past president of the American Economic Association.\n===================================================================================","torrent":{"xt":"urn:btih:c588fb72b4874ff1b6491f25895117aaa858c64b","amp;dn":"Angus+Deaton+-+The+Great+Escape.+Health%2C+Wealth%2C+and+the+Origins","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c588fb72b4874ff1b6491f25895117aaa858c64b","infoHashBuffer":{"type":"Buffer","data":[197,136,251,114,180,135,79,241,182,73,31,37,137,81,23,170,168,88,198,75]},"announce":[],"urlList":[]}}