{"title":"Natural Antimicrobials for the Minimal Processing of Foods","uid":6502027,"size":1083434,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c5fbcdad47c5c821bdcf1d75b204c2d2d77e4060&amp;dn=Natural+Antimicrobials+for+the+Minimal+Processing+of+Foods&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"lionzbay","files":1,"time":1309281648,"description":"Author(s): Sibel Roller\nPublisher: Woodhead Publishing,\nDate: 2003-01\nFormat: pdf\nLanguage: English\nISBN10: 1855736691\nPages: 306\nISBN13:9781855736696\n\nProduct Description: Consumers demand food products with fewer synthetic additives but increased safety, quality and shelf-life. These demands have led to renewed interest in the use of natural antimicrobials to preserve foods. However, despite the wide range of potential antimicrobials, relatively few are suitable for use in practice in particular food products. Edited by a leading expert in the field, and with a distinguished international team of contributors, Natural antimicrobials for the minimal processing of foods discusses their practical application in food preservation, often in conjunction with other preservation techniques. After an introductory chapter, the book first discusses the use of bacteriocins such as nisin in preserving animal and other food products, often in conjunction with other preservation techniques such as high hydrostatic pressure and pulsed electric fields. Subsequent chapters discuss the current and future uses of natamycin, organic acids, antimicrobials from animals and chitosan as preservatives. Three chapters are devoted to antimicrobials from plants and their use in a wide range of applications, including the preservation of fresh and minimally-processed fruits and vegetables. A final group of chapters discuss the use of natural antimicrobials in edible coatings, applications of natural antifungal agents, the combination of natural antimicrobials with irradiation, and the regulatory context. With its practical emphasis and authoritative coverage, Natural antimicrobials for the minimal processing of foods is a standard work for the food industry in developing new preservation systems that extend the shelf-life of foods without compromising safety or sensory quality.","torrent":{"xt":"urn:btih:c5fbcdad47c5c821bdcf1d75b204c2d2d77e4060","amp;dn":"Natural+Antimicrobials+for+the+Minimal+Processing+of+Foods","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5fbcdad47c5c821bdcf1d75b204c2d2d77e4060","infoHashBuffer":{"type":"Buffer","data":[197,251,205,173,71,197,200,33,189,207,29,117,178,4,194,210,215,126,64,96]},"announce":[],"urlList":[]}}