{"title":"Dentist Office Kids v1.0","uid":8607111,"size":20757046,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:c602988f572440eb1b88996e672eae09810dd682&amp;dn=Dentist+Office+Kids+v1.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1372039266,"description":"\nDentist Office Kids is a fun game where you get to perform a variety of dental procedures on patients!\n\nBecome a real life, virtual dentist, and practice dental procedures in your very own office!\n\nYou select from a variety of patients with various issues, and common dental problems.\n\nRotten teeth, tooth extractions, cleanings, and root canals are just the beginning!\n\nChoose from over 9 different procedures including Dental Cleaning, Root Canal, Tooth Extraction, Crowns placement and more! Challenges are included, and Free Clean Mode as well!\n\nSimple, pain free entertainment is at your fingertips!\n\nInject novacaine like a real dentist to numb the patients mouth - then proceed with using the tools on each tooth, or set of teeth!\n\nDental work has never been this fun, and this creative!\n\nEver wanted to play with the Dentist tools at the office? Here's your chance to do that now!\n\nPlay Doctor, and become a Dentist in a snap with this app! Makeover your patients mouth and make those pearly white teeth shine again like new!\n\nFeatures over 9 procedures including common dental ones like cleanings, extractions, crowns, &amp; root canals!\n\nRealistic cartoony graphics make this game a ton of fun to play!\n\nAll the dental tools at your fingertips, just like being a real dentist!\n\nChoose your patient before beginning the procedure\n\nSaves your progress - come back to a procedure later if you wish!\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.beansprites.dentistoffice&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.beansprites.dentistoffice&lt;/a&gt;\n","torrent":{"xt":"urn:btih:c602988f572440eb1b88996e672eae09810dd682","amp;dn":"Dentist+Office+Kids+v1.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c602988f572440eb1b88996e672eae09810dd682","infoHashBuffer":{"type":"Buffer","data":[198,2,152,143,87,36,64,235,27,136,153,110,103,46,174,9,129,13,214,130]},"announce":[],"urlList":[]}}