{"title":"Buffy Sainte-Marie-12 album","uid":4982923,"size":608093640,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c6f836418134538073151cc45c4fa5630fb95dae&amp;dn=Buffy+Sainte-Marie-12+album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SecondOpinion","files":-1,"time":1246447799,"description":"((((((((((((((((((((((((   D..E..M..U..N..O..I..D   ))))))))))))))))))))))))\n\n\nI get all my releases from the above tracker follow the forwarded url to check out the latest zero day releases!!!!\n\n                          &lt;a href=&quot; http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.btzip.com&lt;/a&gt;\n\n     [[[  another fine release by the D..E..M..U..N..O..I..D   Team   ]]]\n\n\n   .....................................INFO................................\n\n\nBuffy Sainte-Marie (born Beverly Sainte-Marie, February 20, 1941 or this date in 1942) is an Academy Award-winning Canadian First Nations musician, composer, visual artist, pacifist,  educator and social activist.\nSainte-Marie played piano and guitar, self-taught, in her childhood and teen years. In college some of her songs, &quot;Ananias&quot;, the Indian lament, &quot;Now That the Buffalo's Gone&quot; and &quot;Mayoo Sto Hoon&quot; (in Hindi) were already in her repertoire. \nBy 1962, in her early twenties, Sainte-Marie was touring alone, developing her craft and performing in various concert halls, folk festivals and Native reservations across the U.S, Canada and abroad. She spent a considerable amount of time in the coffeehouses of downtown Toronto's old Yorkville district, and New York City's Greenwich Village as part of the early to mid-1960s folk scene, often alongside other emerging Canadian contemporaries, such as Leonard Cohen, Joni Mitchell (including introducing her to manager Eliot Roberts), and Neil Young.\nShe quickly earned a reputation as a gifted songwriter, and many of her earliest songs were covered, and often turned into hits, by other artists, including Chet Atkins, Janis Joplin, Taj Mahal and others. One of her most popular songs, &quot;Until It's Time for You to Go&quot;, has been recorded by artists as diverse as Elvis Presley, Barbra Streisand, Neil Diamond, Arthur Fiedler and the Boston Pops Orchestra, Roberta Flack, FranÃƒÂ§oise Hardy, Cher, and Bobby Darin, while &quot;Piney Wood Hills&quot; was made into a country hit by Bobby Bare.\nIn 1963, recovering from a throat infection Sainte-Marie became addicted to codeine and recovering from the experience became the basis of her song &quot;Cod'ine&quot;, later covered by Donovan, The Charlatans, Quicksilver Messenger Service and the songwriter Charles Brutus McClay. Also in 1963 Sainte-Marie witnessed wounded soldiers returning from Vietnam at a time when the U.S. government was denying involvement - this inspired her protest song &quot;Universal Soldier&quot; which was released on her debut album, It's My Way on Vanguard Records in 1964, and later became a hit for Donovan. She was subsequently named Billboard Magazine's Best New Artist. Some of her songs such as &quot;My Country 'Tis of Thy People You're Dying&quot; (1964, included on her 1966 album) addressing the plight of the Native American people created a lot of controversy at the time. \nIn 1967, Sainte-Marie released the album Fire and Fleet and Candlelight, which contained her interpretation of the traditional song &quot;Lyke Wake Dirge&quot;. Sainte-Marie's other well-known songs include &quot;Mister Can't You See,&quot; (a Top 40 U.S. hit in 1972); &quot;He's an Indian Cowboy in the Rodeo&quot;; and the theme song of the popular movie Soldier Blue. Perhaps her first appearance on TV was as herself on To Tell the Truth in January 1966.. She also appeared on Pete Seeger's Rainbow Quest with Pete Seeger in 1965 and several Canadian Television productions from the 1960s through to the 1990s\n\n","torrent":{"xt":"urn:btih:c6f836418134538073151cc45c4fa5630fb95dae","amp;dn":"Buffy+Sainte-Marie-12+album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6f836418134538073151cc45c4fa5630fb95dae","infoHashBuffer":{"type":"Buffer","data":[198,248,54,65,129,52,83,128,115,21,28,196,92,79,165,99,15,185,93,174]},"announce":[],"urlList":[]}}