{"title":"2015 NC Existing Buildings Code","uid":11672708,"size":10383362,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c831f12fc799ca3016dbaf0d5956535853e89cc6&amp;dn=2015+NC+Existing+Buildings+Code&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Sneakie_Poot","files":1,"time":1422736721,"description":"The International Existing Building Code is a model code in the International Code family of codes intended to provide alternative approaches to remodeling, repair or alteration of existing buildings.  A large number of existing buildings and structures do not comply with the current building code requirements for new construction. Although many of these buildings are potentially salvageable,\nrehabilitation is often cost-prohibitive because compliance with all the requirements for new construction could require extensive changes that go well beyond the value of the building or the original scope of the rehabilitation.  At the same time, it is necessary to regulate construction in existing buildings that undergo additions, alterations, renovations, extensive repairs or change of occupancy.  Such activity represents an opportunity to ensure that new construction complies with the current building codes and that existing conditions\nare maintained, at a minimum, to their current level of compliance or are improved as required to meet basic safety levels.\n\nTo accomplish this objective, and to make the rehabilitation process easier, this code allows for options for controlled departure from full compliance with the International Codes dealing with new construction, while maintaining basic levels\nfor fire prevention, structural and life safety features of the rehabilitated building.\n\nThis code provides three main options for a designer in dealing with rehabilitation of existing\nbuildings. These are laid out in Section 301 of this code: \n\nOPTION 1: Work for alteration, repair, change of occupancy, addition or relocation of all existing buildings shall be done in accordance with the Prescriptive Compliance Method given in Chapter 4.  It should be noted that this same method is provided in Chapter 34 of the International Building Code. \n\nOPTION 2: Work for alteration, repair, change of occupancy, addition or relocation of all existing buildings shall be done in accordance with the Work Area Compliance Method given in Chapters 5 through 13.\n\nOPTION 3: Work for alteration, repair, change of occupancy, addition or relocation of all existing buildings shall be done in accordance with the Performance Compliance Method given in Chapter 14. It should be noted that this option is also provided in Chapter 34 of the International Building Code.\n\nUnder limited circumstances, a building alteration can be made to comply with the laws under which the building was originally built, as long as there has been no substantial structural damage and there will be limited structural alteration","torrent":{"xt":"urn:btih:c831f12fc799ca3016dbaf0d5956535853e89cc6","amp;dn":"2015+NC+Existing+Buildings+Code","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c831f12fc799ca3016dbaf0d5956535853e89cc6","infoHashBuffer":{"type":"Buffer","data":[200,49,241,47,199,153,202,48,22,219,175,13,89,86,83,88,83,232,156,198]},"announce":[],"urlList":[]}}