{"title":"Calculator Plus v4.5.5","uid":9086857,"size":10048632,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:c86800e466a969781815e8c288ea6fa692cbb6e6&amp;dn=Calculator+Plus+v4.5.5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1382507881,"description":"\nI'm Calculator Plus - the perfect calculator for Android. I'm easy to use and beautifully designed to do things better than your phone or handheld calculator ever did.\n\nI'm big, easy to read, and I love saving you time and effort. I remember everything you calculate, and let you review it anytime, making me perfect for shopping, doing homework, balancing checkbooks, or even helping with taxes. \n\nAnd if you need to quit and go do something else, I'll have it all waiting for you when you come back. You'll never need to type the same calculation twice again.\nI'm attractive and effective and I make great use of your big, beautiful display:\n\n- I show your calculations in clear, elegant type that's easy to read, with commas just where they should be\n- You'll never lose track of where you are in a calculation - I show you exactly what's happening at all times\n- I remember everything, so you can take a break, then come back later and pick up where you left off\n- You can use backspace anytime to correct a simple mistake, instead of starting over\n- Use memory to keep a running total you can actually see\n- Swipe memory keys aside if you need more advanced math functions\n- My percentage key shows exactly what it did, so you're not left confused\n- My intuitive, lovable design makes it simple to do everyday calculations on your phone or tablet\n\nLet Calculator Plus on your phone or tablet finally put that handheld calculator to rest.\n\nWhat's New:\n\nNow supports 18 additional languages.\nNow fully supports multi-window for Samsung Note 3.\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.digitalchemy.calculator.decimal&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.digitalchemy.calculator.decimal&lt;/a&gt;\n","torrent":{"xt":"urn:btih:c86800e466a969781815e8c288ea6fa692cbb6e6","amp;dn":"Calculator+Plus+v4.5.5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c86800e466a969781815e8c288ea6fa692cbb6e6","infoHashBuffer":{"type":"Buffer","data":[200,104,0,228,102,169,105,120,24,21,232,194,136,234,111,166,146,203,182,230]},"announce":[],"urlList":[]}}