{"title":"Neil Young and The International Harvesters A Treasure(country r","uid":6614918,"size":347514883,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c8799923668ef440bb62526f55c9dde9745a4aef&amp;dn=Neil+Young+and+The+International+Harvesters+A+Treasure%28country+r&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rogercc1","files":15,"time":1313744184,"description":"Neil Young &amp; The International Harvesters  A Treasure\nLabel:Reprise\nReleased : 14 June 2011\nFormat: Flac\n\n\nThe 12-track live album, A Treasure includes songs - 5 of which are previously unreleased - recorded during Young's 1984 and 1985 U.S. tours without the support of an album, or Young's then record label due to unique and unusual circumstances. Among those, &quot;Grey Riders&quot; will be the first track serviced to radio. A Treasure features Young's onstage work with some of the greatest artists in the history of Country music, including the late, great Ben Keith on steel and slide guitar and Rufus Thibodeaux on fiddle, along with living legends Spooner Oldham and Hargus &quot;Pig&quot; Robbins on piano, Tim Drummond and Joe Allen on bass, Anthony Crawford on mandolin &amp; guitars and Karl Himmel on drums, among many others. A Treasure is Young's first release since last year's Grammy and Juno Award-winning album, Le Noise. The live album captures this iconic artist during a fascinating time in his career, when he was facing criticism and lawsuits from his then current record company for exploring a more traditionally country sound. &quot;You can call me erratic,&quot; Young said when asked at the time about his tendency toward musical shape-shifting, &quot;but I've been consistent about it, consistently erratic.&quot; Always celebrated for his musical versatility, A Treasure, is akin to a sonic time capsule, instantly transporting the listener to the time and place when it was made. &quot;I love this record,&quot; Young says. &quot;I hadn't heard these takes in 25 years, but when we unearthed them co-producer Ben Keith said, 'This is a treasure.'&quot; \nPart of what makes A Treasure so compelling is the musical contributions of The International Harvesters, with whom Young was playing at the time. Many of them were already paragons within the country music world and their notoriety has only grown in the years since. &quot;I just love to hear those guys,&quot; Young says. &quot;They're all country music legends.&quot; Those behind the scenes also made significant contributions to A Treasure's sonic potency. Tim Mulligan mixed and mastered the tracks. At the time these songs were recorded, Bob Sterne was the tour manager, Tim Foster ran the stage, and Larry Cragg was in charge of the band's instruments.\n\nTracklist\n\n01. Amber Jean 03:17\n02. Are You Ready For The Country? 03:39\n03. It Might Have Been 02:43\n04. Bound For Glory 05:59\n05. Let Your Fingers Do The Walking 03:03\n06. Flying On The Ground Is Wrong 04:48\n07. Motor City 03:22\n08. Soul Of A Woman 04:28\n09. Get Back To The Country 02:31\n10. Southern Pacific 07:53\n11. Nothing Is Perfect 05:02\n12. Grey Riders 05:58\n\n","torrent":{"xt":"urn:btih:c8799923668ef440bb62526f55c9dde9745a4aef","amp;dn":"Neil+Young+and+The+International+Harvesters+A+Treasure%28country+r","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8799923668ef440bb62526f55c9dde9745a4aef","infoHashBuffer":{"type":"Buffer","data":[200,121,153,35,102,142,244,64,187,98,82,111,85,201,221,233,116,90,74,239]},"announce":[],"urlList":[]}}