{"title":"At_The_Circus_Marx_Brothers(Eng_Ger_Spa_Multisub)","uid":3968649,"size":4429854720,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c8eacc808af9d64158baf49a9833e712fee0635c&amp;dn=At_The_Circus_Marx_Brothers%28Eng_Ger_Spa_Multisub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"silvia-","files":11,"time":1199887248,"description":"AT THE CIRCUS (MARX BROTHERS)\n\n[img]http://www.mymovies.it/filmclub/2007/21/885/locandina.jpg[/img]\n\nYear: 1939\nDirector Edward Buzzell \nCast Groucho Marx, Chico Marx, Harpo Marx, Kenny Baker, Florence Rice, Eve Arden, Margaret Dumont, Nat Pendleton, Fritz Feld \nLength 83 min \nDistributor Warner Home Video \nDiscs 1 \nRegion 2 \nVideo Pal\nDVD5 No Compression\n1.37:1 , 4:3 \nLanguages Dolby Digital Mono: English, German, Spanish \nSubtitles English, Spanish, French, Italian, German, Portuguese, Danish, Finnish, Hebrew, Swedish, Croatian, Slovakian, Greek, Hungarian, Polish, Turkish, English for deaf people, German for deaf people \n\nSynopsis\n\nA distinct letdown from their previous MGM films, the Marx Bros.\\&amp;#039; At the Circus nonetheless contains intermittent moments of high hilarity. When Jeff Wilson (Kenny Baker) is in danger of losing his circus to crooked creditor Carter (James Burke), Jeff\\&amp;#039;s faithful roustabout Antonio (Chico Marx) enlists the aid of seedy attorney J. Cheever Loophole (Groucho Marx). Despite the best efforts of Loophole, Antonio and general hanger-on Punchy (Harpo Marx), Jeff is robbed of the circus payroll by two flies in the ointment, Goliath the Strong Man (Nat Pendleton) and Little Professor Atom (Jerry Marenghi, later known as Jerry Maren). Also in on the plot to wrest control of the circus is aerialist Peerless Pauline (Eve Arden), with whom Loophole has a cozy tete-a-tete while walking on the ceiling (no kidding!) In a last-ditch effort to raise the necessary funds, Loophole romances Jeff\\&amp;#039;s wealthy aunt Mrs. Dukesbury (Margaret Dumont). The finale takes place at a fancy society party at the Dukesbury mansion, with Punchy and Antonio hijacking the scheduled entertainment and replacing it with a full-fledged circus performance.\n\nOther features\nInteractive Menus, Scene Access, Short film: \\&quot;Dog Daze\\&quot;, Animated film: \\&quot;Jitterbug Follies\\&quot;, Theatrical Trailer, Black And White Film ","torrent":{"xt":"urn:btih:c8eacc808af9d64158baf49a9833e712fee0635c","amp;dn":"At_The_Circus_Marx_Brothers%28Eng_Ger_Spa_Multisub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8eacc808af9d64158baf49a9833e712fee0635c","infoHashBuffer":{"type":"Buffer","data":[200,234,204,128,138,249,214,65,88,186,244,154,152,51,231,18,254,224,99,92]},"announce":[],"urlList":[]}}