{"title":"Kali Linux CTF Blueprints [PDF] [StormRG]","uid":11069832,"size":3917239,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c96e900b9654f64064b8b9f19aeec4bcb5e91014&amp;dn=Kali+Linux+CTF+Blueprints+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"steelballz","files":-1,"time":1411252046,"description":"Description\nKali Linux CTF Blueprints\nAuthor:Buchanan, Cam\nPublisher and Published Date:Packt Publishing (July 26 2014)\nISBN-10:1783985984\nISBN-13:9781783985982\nFormat: Retail PDF\nReader Required: Adobe Acrobat\n\n\nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple\nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\nIt should also be noted that any reference to any dvd, cd, or any other dlc or extra content in this, or any other torrent I upload, is not available in the torrent unless I state otherwise. If you want the extras, buy the product\nThis PDF is encrypted! This encryption will NOT interfere with opening, printing, or copying the PDF. It will only prevent editing of the PDF. I have my reasons for it. If you have questions pm me through my acct on KAT\nIf you do have difficulties opening this file while running a Linux OS, try opening in windows or mac using Adobe Acrobat. If you still can't open, pm me and I'll investigate.\n\n\nimage\nCover from actual book file\n\n\nProduct Description\n\nIn Detail\n\nAs attackers develop more effective and complex ways to compromise computerized systems, penetration testing skills and tools are in high demand. A tester must have varied skills to combat these threats or fall behind. This book provides practical and customizable guides to set up a variety of exciting challenge projects that can then be tested with Kali Linux.\n\nLearn how to create, customize, and exploit penetration testing scenarios and assault courses. Start by building flawed fortresses for Windows and Linux servers, allowing your testers to exploit common and not-so-common vulnerabilities to break down the gates and storm the walls. Mimic the human element with practical examples of social engineering projects. Facilitate vulnerable wireless and mobile installations and cryptographic weaknesses, and replicate the Heartbleed vulnerability. Finally, combine your skills and work to create a full red-team assessment environment that mimics the sort of corporate network encountered in the field.\nApproach\n\nTaking a highly practical approach and a playful tone, Kali Linux CTF Blueprints provides step-by-step guides to setting up vulnerabilities, in-depth guidance to exploiting them, and a variety of advice and ideas to build and customising your own challenges.\nWho this book is for\n\nIf you are a penetration testing team leader or individual who wishes to challenge yourself or your friends in the creation of penetration testing assault courses, this is the book for you. The book assumes a basic level of penetration skills and familiarity with the Kali Linux operating system.\n\n\n\n\nimage\nScientia est potentia","torrent":{"xt":"urn:btih:c96e900b9654f64064b8b9f19aeec4bcb5e91014","amp;dn":"Kali+Linux+CTF+Blueprints+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c96e900b9654f64064b8b9f19aeec4bcb5e91014","infoHashBuffer":{"type":"Buffer","data":[201,110,144,11,150,84,246,64,100,184,185,241,154,238,196,188,181,233,16,20]},"announce":[],"urlList":[]}}