{"title":"POtHS - SNR - UFOs Angels Spirits Witches and Demons Vol 63 - Ch","uid":12068745,"size":6050422834,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c9a29c27ac37b3ea577e717eb1a4b711401e92f8&amp;dn=POtHS+-+SNR+-+UFOs+Angels+Spirits+Witches+and+Demons+Vol+63+-+Ch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"POtHS11","files":91,"time":1435458999,"description":"Humanzee Documentary on Stalin's Experimentation to Create and Army of Ape-Men:\nThis documentary and the rest of the documentaries presented relate to important times and figures in history, historic places and sites, archaeology, science, conspiracy theories, and education.  This documentary reveals the true-life secret governemnt experimentation on creating a chimp-human hybrid.  Although the public views this such of material as mythological, the truth is stranger than fiction with their success at creating a real-life humanzee.  \n\nThe Topics of these video documentaries are varied and cover ancient history, Rome, Greece, Egypt, science, technology, nature, planet earth, the solar system, the universe, World wars, Battles, education, Biographies, television, archaeology, Illuminati, Area 51, serial killers, paranormal, supernatural, cults, government cover-ups, corruption, martial arts, space, aliens, ufos, conspiracy theories, Annunaki, Nibiru, Nephilim, satanic rituals, religion, strange phenomenon, origins of Mankind","torrent":{"xt":"urn:btih:c9a29c27ac37b3ea577e717eb1a4b711401e92f8","amp;dn":"POtHS+-+SNR+-+UFOs+Angels+Spirits+Witches+and+Demons+Vol+63+-+Ch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9a29c27ac37b3ea577e717eb1a4b711401e92f8","infoHashBuffer":{"type":"Buffer","data":[201,162,156,39,172,55,179,234,87,126,113,126,177,164,183,17,64,30,146,248]},"announce":[],"urlList":[]}}