{"title":"Springfield Muzzle Loading Shoulder Arms - Claud E. Fuller - 193","uid":10048391,"size":5877303,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cac09d04c2960ada0736ca8712b8b25d14a521b2&amp;dn=Springfield+Muzzle+Loading+Shoulder+Arms+-+Claud+E.+Fuller+-+193&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"PusInBoots","files":1,"time":1398571520,"description":"PDF. Text replaced, converted to single column, pictures moved to improve text flow. I have kept the original spelling, contents and index page numbers, but these are not applicable as in A4 format the number of pages is reduced from 172 to 145.\nFrom the Preface:\nTHE compiler of this work, with a full knowledge of the difficulties presented by the subject, and of the wide variance of opinion among collectors in reference to the Model dates of our early muskets, has undertaken to establish by Ordnance Office correspondence and records the progressive steps in the development of that most important arm the musket of our infantry.\nIn the many works on American arms already published, this particular subject has been sadly neglected, and the interested collector or antiquarian has had but little data upon which to base his conclusions, but has been compelled to rely upon information made up without the proper reference to the records which the subject deserves.\nIt is recognized that many inaccuracies and discrepancies must exist in a compilation of this kind, both from the fact that the old records and correspondence are not always in agreement, and that the existing arms have in many cases been so interchanged as to make positive identification impossible; but it is hoped that this effort will lead to further research and a more complete knowledge of the subject.\nA sketch of the Springfield Armory, and extracts from various ordinance office reports and correspondence have been included as a means of checking some of the conclusions arrived at in this compilation and as of considerable interest to the general subject. The tables and drawings included are also valuable as a means of identifying specimens. Of particular interest are the correspondence and data on the Carbine of 1809-1810 and the Musket of 1840, about which arms there has existed considerable difference of opinion among collectors.\nThe compiler is glad to take this opportunity to express his thanks and appreciation to the collectors, authors and publishers who have contributed material for this work, and he also takes pleasure in acknowledging the able assistance of his wife and co-worker in making the compilation.\n","torrent":{"xt":"urn:btih:cac09d04c2960ada0736ca8712b8b25d14a521b2","amp;dn":"Springfield+Muzzle+Loading+Shoulder+Arms+-+Claud+E.+Fuller+-+193","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cac09d04c2960ada0736ca8712b8b25d14a521b2","infoHashBuffer":{"type":"Buffer","data":[202,192,157,4,194,150,10,218,7,54,202,135,18,184,178,93,20,165,33,178]},"announce":[],"urlList":[]}}