{"title":"Un Pais Para Comerselo - 22 Barcelona [DVDRip][Spanish]","uid":6884228,"size":524328960,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cb25b765e7121d76149a5d69c4caf837ebf8e463&amp;dn=Un+Pais+Para+Comerselo+-+22+Barcelona+%5BDVDRip%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"virana","files":-1,"time":1323765346,"description":"La provincia de Barcelona es la protagonista de nuestro viaje. Gran olvidada, quizÃƒÂ¡ por su cercanÃƒÂ­a a la gran ciudad. Sin embargo, nuestros protagonistas conocen en su viaje un deseo de los catalanes, el de volver a los orÃƒÂ­genes.\nUna provincia llena de tesoros\n\nEs el caso de Conxita, una urbanita que dejÃƒÂ³ la ciudad para restaurar un molino, propiedad de la familia de su marido, y cocinar con productos totalmente naturales. Joan, y su tarea de recuperar el burro de raza catalana, es otro de los personajes que Juan conoce en este viaje de vuelta a los orÃƒÂ­genes.\n\nEste episodio lleva a Un paÃƒÂ­s para comÃƒÂ©rselo a espacios de especial significado para los barceloneses, como es la BasÃƒÂ­lica de Montserrat, un lugar donde poder degustar el 'matÃƒÂ²', un queso fresco que se elabora en estas mismas escarpadas montaÃƒÂ±as.\n\nLa provincia de Barcelona es conocida tambiÃƒÂ©n por la calidad de sus aguas termales. Ã‚Â¿Pueden utilizarse esas aguas para elaborar alimentos? Imanol conoce la respuesta de manos de la familia Sant MartÃƒÂ­, que elabora pasta artesanal: macarrones, espirales y asÃƒÂ­, hasta 54 tipos diferentes.\n\nEn este viaje por los orÃƒÂ­genes, conocemos la historia de Maria Rosa Cardona, que saliÃƒÂ³ de Barcelona para hacerse cargo de la bodega familiar de cava en Sant MartÃƒÂ­ Saroca; o de Jean Leonun emigrante, santanderino cuyo nombre en realidad era Ceferino CarriÃƒÂ³n y que dio de comer a lo mejor del Hollywood de los aÃƒÂ±os dorados. Su visiÃƒÂ³n de negocios le hizo fijarse en una zona del PenedÃƒÂ©s para producir un vino que a dÃƒÂ­a de hoy, despuÃƒÂ©s de su fallecimiento hace ya 15 aÃƒÂ±os, sigue llevando su nombre.\nLos orÃƒÂ­genes de 'el chiringuito'\n\nHistorias de regreso tambiÃƒÂ©n conocemos en Sitges, historias de indianos que volvieron a su lugar de origen con costumbres que luego darÃƒÂ­an lugar a un nombre tan comÃƒÂºn en nuestra gastronomÃƒÂ­a: el chiringuito. Y es que fue en esta localidad costera donde naciÃƒÂ³ tan singular vocablo.\n\nLa arquitectura modernista de Canet de Mar embelesa a Imanol, quien pasea por las zonas mÃƒÂ¡s emblemÃƒÂ¡ticas de esta localidad y conoce unas galletas cuya forma estÃƒÂ¡ inspirada en las vidrieras modernistas que se pueden ver en Canet de Mar.\n\nLa provincia de Barcelona tiene un pasado industrial, por eso Tonino se acerca hasta Cardona. AllÃƒÂ­ se adentra en el la montaÃƒÂ±a para conocer cÃƒÂ³mo hasta hace muy poco tiempo, se extraÃƒÂ­a un mineral muy preciado: la sal.\nBarcelona y sus guisos marineros\n\nLa Barcelona de los guisos marineros la conoceremos en Vilanova i la GeltrÃƒÂº, donde Juan e Imanol se embarcan en una jornada de pesca para buscar sepia y luego degustarla con los pescadores en una receta muy propia de esta localidad: sepia a la bruta.\n\nLa cercanÃƒÂ­a del MeditÃƒÂ©rraneo se hace notar en algunos de los productos de la huerta en el Maresme barcelonÃƒÂ©s, como sus apreciados 'pesols', unos guisantes diminutos y que servidos con butifarra o sepia y patatas, motivan la peregrinaciÃƒÂ³n de muchos gastrÃƒÂ³nomos a los restaurantes de esta zona.\n\nY resumiendo ese espÃƒÂ­ritu de vuelta a los orÃƒÂ­genes, Juan e Imanol terminan su viaje, en este programa de Un paÃƒÂ­s para comÃƒÂ©rselo, encontrÃƒÂ¡ndose con la familia Rovira, que volvieron de la ciudad a hacerse cargo de una masÃƒÂ­a que fue propiedad de la familia. AllÃƒÂ­, en el interior de la provincia de Barcelona, la familia Rovira &quot;cierra el cÃƒÂ­rculo&quot;, cultivando sus hortalizas y criando sus animales para desplegar su particular manera de cocinar.","torrent":{"xt":"urn:btih:cb25b765e7121d76149a5d69c4caf837ebf8e463","amp;dn":"Un+Pais+Para+Comerselo+-+22+Barcelona+%5BDVDRip%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb25b765e7121d76149a5d69c4caf837ebf8e463","infoHashBuffer":{"type":"Buffer","data":[203,37,183,101,231,18,29,118,20,154,93,105,196,202,248,55,235,248,228,99]},"announce":[],"urlList":[]}}