{"title":"Supernova (2006) Rob Brydon","uid":5365892,"size":1259612970,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cb6fa2a87fb7012e1c889d061e6870659e60ec02&amp;dn=Supernova+%282006%29+Rob+Brydon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"renman","files":-1,"time":1266260054,"description":"SUPERNOVA starring Rob Brydon. All six episodes of season one included in this torrent as individual AVI files. Please help keep this torrent alive by ensuring you seed this please Thank you.\n\nI hope all enjoy this amusing comedy\n\n\nEpisodes\n\n1 - The Black Hole\n2 - God Are You Out There\n3 - When You Wish Upon A Star\n4 - Venus Rising\n5 - Unity\n6 - Where Men Are Men\n\n\nAspect Ratio - 720x576\nAudio Bit rate - 128kbps\nSample Rate - 44100\nVideo Bit rate - 768kbps\nCodec - XVID\nFrame rate - 25\n\n\nThis is season 1 I haven't got season 2 as it has yet to be released on DVD which is a shame as it is a very amusing series. Rob Brydon plays a mostly hapless character whose good intentions are frequently misinterpreted leading to funny consequences.\n\nCLASSIC BRITISH HUMOUR\n\n\n\nsynopsis\n\nA Rob Brydon sitcom centred around an unworldly British astronomer and his experiences when he is sent to work at an Australian observatory. The astronomer, Dr. Paul Hamilton is forced to adapt to the local customs and climate and his new eccentric colleagues.\n\n\nEPISODE GUIDE SEASON 1\n\n1. The Black Hole\n\nFirst Broadcast: Tue 11th October 2005\n\nUnder-achieving, under-confident scientist Paul Hamilton is swept suddenly from his unexciting life and boring girlfriend in London to a thrilling astronomical frontier at the Royal Australian Observatory in the Australian Outback.\nCan he find the Black Hole and impress his fellow scientists? Can he win the affection of beautiful scientist Rachel, even though she is engaged to astronaut Chad? A world of impossible adventure opens up before him.\n\n\n2. God, Are You Out There?\n\nFirst Broadcast: Tue 18th October 2005\n\nThe age-old clash between religion and science. Paul thinks he sees God in the gullet of a wormhole and becomes determined to publish his beliefs.\nBut as Rachel, the cool, cynical and terminally atheist, reminds him, there is no place in science for religion and God did not create the world.\n\nBut then Pip and Rachel also see the face in the wormhole, and reluctantly agree that Paul may be right and should publish his paper.\n\n\n3. When You Wish Upon A Star\n\nFirst Broadcast: Tue 25th October 2005\n\nPaul is overwhelmed by the support and love of his colleagues when they throw a surprise birthday party for him, and for the first time ever feels like a real man.\nAnd then he gets a call from girlfriend Ruth with her exciting surprise - she is in Australia and on her way to the Observatory. How can he get rid of her and live his own life?\n\n\n4. Venus Rising\n\nFirst Broadcast: Tue 1st November 2005\n\nWhen Venus, the planet of love, rises, hormones and temperatures in the Observatory rise with it, and Paul's lack of sex life becomes a real focus.\nHe realizes that the best way to shut up his well-meaning colleagues is to pretend he is having a raging affair with a biker chick he met at the pub. A simple lie that can't hurt anyone.\nTo Paul's surprise, it seems to bring him unexpected bonuses. Pip gives him more \nresponsibility at the Observatory, and Rachel seems genuinely attracted to him for the first time ever. So the lie gets bigger and bigger.\n\n\n5. Unity\n\nFirst Broadcast: Tue 8th November 2005\n\nPaul discovers a new planet which he names Unity as a symbol of the togetherness he feels exists with his weird and gifted fellow scientists.\nA film crew, led by the sleazy Alistair Foster, arrives to interview Paul and capture the discovery of the new planet, but Paul learns that science is no different from real life, and that beauty sells - as Rachel is seduced into the spotlight.\n\n\n6. Where Men Are Men\n\nFirst Broadcast: Tue 15th November 2005\n\nPaul solves the mystery of how the Universe will end, and is depressed. And then he is challenged to a duel by the local thug. It is Paul's high noon.\nPaul looks for answers in the desert, and it is Bill who teaches him what it means to be a real man.\n","torrent":{"xt":"urn:btih:cb6fa2a87fb7012e1c889d061e6870659e60ec02","amp;dn":"Supernova+%282006%29+Rob+Brydon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb6fa2a87fb7012e1c889d061e6870659e60ec02","infoHashBuffer":{"type":"Buffer","data":[203,111,162,168,127,183,1,46,28,136,157,6,30,104,112,101,158,96,236,2]},"announce":[],"urlList":[]}}