{"title":"The Museum Age (Art Ebook).pdf","uid":11264643,"size":58378139,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cc09cc8974ca2e8589d446ec3ecff16f3e2d9e6a&amp;dn=The+Museum+Age+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":-1,"time":1414009638,"description":"pdf / English / 1967 / 302 pages / 55.6 MB\n\n\nTo write a history of the museum is to give account of the evolution of two concepts: that of the Museum and that of Time. Regarding the nature of Time, our age has accumulated all kinds of studies: metaphysical, psychological, sociological, and ethnological and scientific; excepting the two last mentioned, which treat another aspect of the problem, all arrive at more or less the same conclusion, at the  presence in the human consciousness of two notions of time: that of a time which passes and that of a time which endures. Archaic civilizations, with their denial of history, know only the second, which ethnologists have' termed &quot;absolute time&quot; and in which primitive peoples, who by recourse to ritual and myth seek to abolish temporality, believe. Individual human existence becomes, then, so intimately integrated with that of the group that it is seen as part of a natural, universal continuum. One can rediscover this notion of absolute time within oneself bv trying to recapture one's childhood where the role of games is comparable to the role of myth among primitives","torrent":{"xt":"urn:btih:cc09cc8974ca2e8589d446ec3ecff16f3e2d9e6a","amp;dn":"The+Museum+Age+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc09cc8974ca2e8589d446ec3ecff16f3e2d9e6a","infoHashBuffer":{"type":"Buffer","data":[204,9,204,137,116,202,46,133,137,212,70,236,62,207,241,111,62,45,158,106]},"announce":[],"urlList":[]}}