{"title":"A History of the Modern Chinese Army by Xiaobing Li ","uid":9688707,"size":4480691,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cc0b857b5c1283f367f582aea020fe2e472909fc&amp;dn=A+History+of+the+Modern+Chinese+Army+by+Xiaobing+Li+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":2,"time":1393825795,"description":"\nSince the establishment of the Red Army in 1927, China's military has responded to profound changes in Chinese society, particularly its domestic politics, shifting economy, and evolving threat perceptions. Recently tensions between China and Taiwan and other east Asian nations have aroused great interest in the extraordinary transformation and new capabilities of the Chinese army. \n\nIn A History of the Modern Chinese Army, Xiaobing Li, a former member of the People's Liberation Army (PLA), provides a comprehensive examination of the PLA from the Cold War to the beginning of the twenty-first century that highlights the military's central function in modern Chinese society. In the 1940s, the Chinese army was in its infancy, and many soldiers were rural conscripts and volunteers who had received little formal schooling. \n\nThe Chinese military rapidly increased its mobility and weapon strength, and the Korean War and Cold War offered intense combat experience that not only allowed soldiers to hone their fighting techniques but also helped China to develop military tactics tailored to the surrounding countries whose armies posed the most immediate threats. \n\nYet even in the 1970s, the completion of a middle school education (nine years) was considered above-average, and only 4 percent of the 224 top Chinese generals had any college credit hours. However, in 1995 the high command began to institute massive reforms to transform the PLA from a labor-intensive force into a technology-intensive army.\n\nGenre: History / Military","torrent":{"xt":"urn:btih:cc0b857b5c1283f367f582aea020fe2e472909fc","amp;dn":"A+History+of+the+Modern+Chinese+Army+by+Xiaobing+Li+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc0b857b5c1283f367f582aea020fe2e472909fc","infoHashBuffer":{"type":"Buffer","data":[204,11,133,123,92,18,131,243,103,245,130,174,160,32,254,46,71,41,9,252]},"announce":[],"urlList":[]}}