{"title":"The Story of My Assassins - Tarun J. Tejpal.epub","uid":9008006,"size":2599534,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cc562f9f004659097318905b40478034dbbefde8&amp;dn=The+Story+of+My+Assassins+-+Tarun+J.+Tejpal.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1381072431,"description":"I could sense that in that swirling mad room,every eye had slowly come to rest on him.I saw even yoronour in all his pasty majestysneak a look or two.\n\nSethiji said,'They say he is the future king of western UP. His name is Hathoda Tyagi.Before he was nineteen he'd killed his first five men by caving their skulls in with a hammer.Full brain curry. Now, of course, he shoots people through their ears, in their mouths, up their assholes. Today he kills you, tomorrow your enemy. Like Sethiji gets up and comes to Patiala House courts every morning, he goes out every day and dispatches a few sorry souls to Yamraj directly. He works only for the big mafia dons now. When they want a big job done, they send for Hathoda Tyagi. You should be proud. Not just Sethiji, even the mafia thinks you are a big man!'\nSara said, 'They are being framed.'\nI looked at her.\nShe said, 'Can't you see they are being framed!'\nI said, 'How can you tell?'\n\nA muscular, incisive, and deeply sardonic comment on twenty-first century India. The Story of My Assassins is a multilayered novel that skilfully slashes through the subcontinent's dubious spiritual serenity to lay bare every crippling divide of language, wealth and class. Trawling life and death in the dark underside, it inquires into the inexorable codes of power and wealth that propel societies. A triumph of disparate voices, unbearable realities, and impossible conundrums, this is a book that will forever change the way we look at theworld around us.","torrent":{"xt":"urn:btih:cc562f9f004659097318905b40478034dbbefde8","amp;dn":"The+Story+of+My+Assassins+-+Tarun+J.+Tejpal.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc562f9f004659097318905b40478034dbbefde8","infoHashBuffer":{"type":"Buffer","data":[204,86,47,159,0,70,89,9,115,24,144,91,64,71,128,52,219,190,253,232]},"announce":[],"urlList":[]}}