{"title":"Jeff Beck - 2003 - Jeff TQMP","uid":4341388,"size":376293560,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cd47be4defdc802b83ed5467d8e255246fe2fc51&amp;dn=Jeff+Beck+-+2003+-+Jeff+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"downup","files":18,"time":1218621991,"description":"TQMP (The Quality Music Project) - great music, superb sound, exact rip and covers in high resolution.\n\n&quot;If the voice don&amp;#039;t say it, the guitar will play it,&quot; raps Saffron on &quot;Pork-U-Pine,&quot; the third track on Jeff Beck s minimally titled Jeff And he does. Beck teams with producer Andy Wright the man responsible for his more complete immersion into electronic backdrops on his last outing, You Had It Coming This time the transition is complete. Beck used electronica first on Who Else! moved a little more into the fire on You Had It Coming and here merges his full-on Beck-Ola guitar heaviness with the sounds of contemporary spazz-out big beats and noise Beck and Wright employ Apollo 440 on &quot;Grease Monkey&quot; and &quot;Hot Rod Honeymoon,&quot; and use a number of vocalists, including the wondrously gifted Nancy Sorrell on a host of tracks, as well as the London Session Orchestra on others (such as &quot;Seasons,&quot; where hip-hop breakbeats, and old-school Tangerine Dream sequencing meet the guitarist&amp;#039;s deep blues and funk drenched guitar stylings). As for atmospherics, David Torn (aka producer Splattercell offers a shape-shifting mix of glitch tracks on &quot;Plan B&quot; for Beck to wax on both acoustically and electrically, and make them weigh a ton. But it&amp;#039;s on cuts like &quot;Trouble Man,&quot; a purely instrumental big drum and guitar skronk workout, where Beck truly shines here. With a rhythm section of Dean Garcia and Steve Barney -- and Tony Hymas appears as well -- Beck goes completely overboard: the volume screams and the sheer crunch of his riffs and solos split the rhythm tracks in two, then four, and finally eight, as he turns single-string runs into commentaries on everything from heavy metal to East Indian classical music.\n\nThe industrial crank and burn of &quot;Grease Monkey&quot; is an outing fraught with danger for the guitarist, who has to whirl away inside a maelstrom of deeply funky noise -- and Beck rides the top of the wave into dirty drum hell and comes out wailing. For those who feel they need a dose of Beck s rootsier and bluesier playing, there is one, but the context is mentally unglued. &quot;Hot Rod Honeymoon&quot; is a drum and bass sprint with Beck playing both slide and Texas-style blues ÃƒÂ  la Albert Collins letting the strings bite into the beats. The vocals are a bit cheesy, but the entire track is so huge it&amp;#039;s easy to overlook them. &quot;Line Dancing With Monkeys&quot; has a splintered Delta riff at its core, but it mutates, shifts, changes shape, and becomes the kind of spooky blues that cannot be made with conventional instruments. His turnarounds into the myopic rhythms provide a kind of menacing foil to their increasing insistence in the mix. Before gabber-style drum and bass threaten to break out of the box, Beck s elongated bent-note solos tame them. &quot;JB&amp;#039;s Blues&quot; is the oddest thing here because it&amp;#039;s so ordinary; it feels like it belongs on an updated Blow By Blow In all this is some of the most emotionally charged and ferocious playing of Beck s career. Within the context of contemporary beatronica, Beck flourishes. He find a worthy opponent to tame in the machines, and his ever-present funkiness is allowed to express far more excess than restraint. This is as fine a modern guitar record as you are ever going to hear.  Thom Jurek, All Music Guide\n\n\nFiles:\n\n01 So What.flac\n02 Plan B.flac\n03 Pork-U-Pine.flac\n04 Seasons.flac\n05 Trouble Man.flac\n06 Grease Monkey.flac\n07 Hot Rod Honeymoon.flac\n08 Line Dancing With Monkeys.flac\n09 JB&amp;#039;s Blues.flac\n10 Pay Me No Mind.flac\n11 My Thing.flac\n12 Bulgaria.flac\n13 Why Lord Oh Why .flac\nJeff Beck - 2003 - Jeff.cue\nDescription.txt\nFront.jpg\nInlay.jpg\nBack.jpg\n\n\nTo check out all TQMP uploads:  &lt;a href=&quot;\nhttp://thepiratebay.se/user/breezin/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/breezin/&lt;/a&gt;  &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;  &lt;a href=&quot;\nhttp://thepiratebay.se/user/slavetothesound/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/slavetothesound/&lt;/a&gt; &lt;a href=&quot;\nhttp://thepiratebay.se/user/downup/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/downup/&lt;/a&gt;\nOr use the TQMP searchtag.\n\nPlease feel free to join TQMP!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980&amp;#039;s cassettetapes or vinylrips please!) in lossless format (flac is preferable) AND include artwork. Include the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n","torrent":{"xt":"urn:btih:cd47be4defdc802b83ed5467d8e255246fe2fc51","amp;dn":"Jeff+Beck+-+2003+-+Jeff+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd47be4defdc802b83ed5467d8e255246fe2fc51","infoHashBuffer":{"type":"Buffer","data":[205,71,190,77,239,220,128,43,131,237,84,103,216,226,85,36,111,226,252,81]},"announce":[],"urlList":[]}}