{"title":"The Police Tapes.mp4","uid":10391689,"size":255839465,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ce6a15a21945e16ec1041dcbe6e691a6c83382a0&amp;dn=The+Police+Tapes.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"quitucho","files":1,"time":1403200703,"description":"The Police Tapes is a 1977 documentary about a police precinct in the South Bronx. The original ran ninety minutes and was produced for public television; a one-hour version later aired on ABC.\n\n\nIt won two Emmy Awards, a Peabody Award,and a DuPont-Columbia University Award for Broadcast Journalism, and became an influence on later television and film dramas.\n\nFilmmakers Alan Raymond and Susan Raymond spent three months in 1976 riding along with patrol officers in the 44th Precinct of the South Bronx, which had the highest crime rate in New York City. They produced about 40 hours of videotape that they edited into a 90-minute documentary.\n\nThe result was what New York Times TV critic John J. O'Connor called a &quot;startlingly graphic and convincing survey of urban crime, violence, brutality and cynical despair&quot;. Cases followed include the discovery of a dead body on the street, the rescue of a mother trapped in her apartment by a mentally ill son, an attempt to negotiate with a woman armed with an improvised flail who refuses to stop threatening her neighbor, and the arrest of a 70-year-old woman accused of hitting her daughter in the face with an axe.\n\nThere is some introductory narration at the beginning describing the neighborhood and the time the documentary was filmed, but some unifying commentary is provided by an interview with Bronx Borough Commander Anthony Bouza, who ascribes the crime rate in the 44th Precinct to poverty, describes the hardening effects of urban violence on idealistic police officers, and likens himself to the commander of an occupying army, saying &quot;We are manufacturing criminals... we are manufacturing brutality&quot;.\n\nThe production was financed by the New York State Council on the Arts and WNET and cost only $20,000, thanks to the use of Portapak tape equipment; it would have cost an estimated $90,000 if film had been used. Special Newvicon tubes in the video cameras allowed them to tape with only streetlights for illumination, making them less conspicuous to subjects who might otherwise have fled from or approached the cameras.","torrent":{"xt":"urn:btih:ce6a15a21945e16ec1041dcbe6e691a6c83382a0","amp;dn":"The+Police+Tapes.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce6a15a21945e16ec1041dcbe6e691a6c83382a0","infoHashBuffer":{"type":"Buffer","data":[206,106,21,162,25,69,225,110,193,4,29,203,230,230,145,166,200,51,130,160]},"announce":[],"urlList":[]}}