{"title":"RAM Manager Pro v5.3.2 Android - SRZ","uid":9182852,"size":369094,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:ceb291bb3cb87942155bfeaa59b09bf09368287b&amp;dn=RAM+Manager+Pro+v5.3.2+Android+-+SRZ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"IQCool","files":-1,"time":1384252778,"description":" &lt;a href=&quot;http://i.imgur.com/3hEDNWM.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://i.imgur.com/3hEDNWM.png&lt;/a&gt;\n\nRAM Manager Pro v5.3.2 - SRZ\n------------------------------------------\nJuwe11 - November 11, 2013\nTools\n\nDescription !\n-------------------\nROOT IS REQUIRED!!!\nEACH ROOT USER MUST HAVE THIS APPLICATION!\nIF YOU FIND A BUG OR IF YOU HAVE SOME PROBLEM, CONTACT ME BEFORE YOU GIVE LOW RATING, PLEASE.\n\nThis application optimizes the RAM of all android devices and improves the performance in all directions. We tested the best RAM balance which makes your system as fast as possible. Lots of running applications with enough free memory will not be a problem for your device. This is the best solution for all who have problem with the free memory, with the multitasking, with slow swapping between applications or with low performance.\n\nADVANTAGES OF PRO: !\n-----------------------------------\n?No ads\n?All features (widget, etc.)\n?Faster support\n?More frequent updates\n?You can support development\n\nFEATURES: !\n-------------------\n?Balance - Option which makes your RAM to the best optimization, this option is for everyday use. Use this option when you want to have fast phone without lags.\n?More free memory - This option is nearly the same as Balance, but this option should be advantageous for users who have more RAM than 512 MB. This option gives you more free memory but a bit reduces multitasking.\n?More multitasking - This option is nearly the same as Balance, but this option should be advantageous for users who have less RAM than 512 MB. This option gives you more multitasking, but a bit reduces free memory.\n?Hard gaming - Option which stabilizes your RAM for playing hardest games. Use this option for games which lag on your phone. Your games will run smooth without lags.\n?Hard multitasking - Option for users which are really hard working on their phones. You can have a lot of running apps and quickly switch between them without lags.\n?Default - This option reverts your RAM to your default settings, which you had before you installed this app.\n?Custom - This option allows you to set your own settings.\n?Set on boot - Saves all your settings on boot.\n?Lock launcher in memory - Prevents restarting your launcher.\n?Clean memory - Cleans your memory.\n?Clean drop caches - Cleans page cache, dentries and inodes.\n?VM Heap size - It is a maximal size in MB which application can use for its data.\n?Swap file - Improves performance but may degrade your SD card life.\n?Memory info - Shows information of your memory.\n?Memory graph - Shows your free and used memory.\n?Widget (Light or dark theme)\n?You can switch between all options without rebooting\n?Languages - English, Czech, Slovak, Korean, Italian, Croatian, Polish, French, Russian, Greek, Chinese, Turkish, Spanish\n\nWhat's New !\n-------------------\nMinor improvement\n\nAdditional information !\n-------------------------------\nUpdated\nNovember 11, 2013\n \nSize\n360kb\n \nCurrent Version\n5.3.2\n \nRequires Android\n2.1 and up\n &lt;a href=&quot;\nhttp://img43.imageshack.us/img43/2115/kf23.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img43.imageshack.us/img43/2115/kf23.png&lt;/a&gt;","torrent":{"xt":"urn:btih:ceb291bb3cb87942155bfeaa59b09bf09368287b","amp;dn":"RAM+Manager+Pro+v5.3.2+Android+-+SRZ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ceb291bb3cb87942155bfeaa59b09bf09368287b","infoHashBuffer":{"type":"Buffer","data":[206,178,145,187,60,184,121,66,21,91,254,170,89,176,155,240,147,104,40,123]},"announce":[],"urlList":[]}}