{"title":"Svenska Hemligheter Part 11, 2010-2011","uid":6096011,"size":215451188,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cf7878e64d2fbb26bd1f4a804f330e1ce838adde&amp;dn=Svenska+Hemligheter+Part+11%2C+2010-2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bughunter68","files":1,"time":1294778355,"description":"Eleventh episode of the swedish TV show Svenska Hemligheter.\nBroadcasted on the 3/1 2011 in SVT 1.\n\n----------------\nDen ihaliga on. Visby och Gotland har alltid genom historien haft en central roll i Ostersjon. On har varit viktigt for sjofart, handel och krigsforing. Pa 1600-talet under stormaktstiden blir Gotland svenskt och man beslutar sig for att till varje pris skydda on med befastningar. Hamnen i Visby visar sig vara dalig. Den ar grund och trang. Men pa andra sidan on ligger Slite med sin djuphamn. Eftersom Slite ligger pa ostsidan, den sida en fiende troligen skulle komma ifran, borde val hamnen och staden vara viktigare ÃƒÂ¤n Visby? Det ar under dessa ar man bÃƒÂ¶rjar planera for en flytt av ringmuren. Den ska plockas ner bit for bit, fraktas over on och atermonteras runt Slite. Men Drottning Kristina, som ledde landet vid tiden, abdikerar och planerna pa att flytta muren skrinlaggs. Men Slites strategiska lage forandras inte. Dar bygger man istallet en helt ny fastning kallad Karlsvard. Den ar stor, pampig och stracker sig over hela on. Idag finns bara vallarna och nagra husgrunder kvar av den. Men man kan inte ga en meter pÃƒÂ¥ on utan att snubbla pa nÃƒÂ¥gon fortifikatorisk anlaggning. Alldeles nyligen avvecklades den sista militara installationen pÃƒÂ¥ on, ett relativt nybyggt bergrum vars uppgift fortfarande ar sekretesskyddat. En manghundraarig militar narvaro pÃƒÂ¥ on ar over. Men det ar de tva fastningarna fran 1800-talet som ar de mest fascinerande. Som tva medeltida borgar placerade pa motsatta sidor om on skulle de hindra den svenska hamnen att falla i annat lands hander. Har man aldrig sett Enholmens fastningar pa riktigt sa vantar en rejal overraskning. Det ar precis det som moter Melker Becker och Kalle Nordberg i den har episoden av Svenska hemligheter.\n----------------\n","torrent":{"xt":"urn:btih:cf7878e64d2fbb26bd1f4a804f330e1ce838adde","amp;dn":"Svenska+Hemligheter+Part+11%2C+2010-2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf7878e64d2fbb26bd1f4a804f330e1ce838adde","infoHashBuffer":{"type":"Buffer","data":[207,120,120,230,77,47,187,38,189,31,74,128,79,51,14,28,232,56,173,222]},"announce":[],"urlList":[]}}