{"title":"Holosync Awakening Prologue [FLAC]","uid":4498820,"size":772624266,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d0132c53532e078f815a1e8926e35a3dbe1c2338&amp;dn=Holosync+Awakening+Prologue+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mojo_crack","files":4,"time":1226313367,"description":"This is Holosync&amp;#039;s Awakening Prologue. It is designed to be an introduction into the Awakening series, to be listened to before listening to Awakening Level 1.\n\nInstructions:\n\nListen to &quot;The Dive&quot; with stereo headphones, sitting up with eyes closed, for 30 minutes. After the audio has finished playing, sit quietly for at least five additional minutes (or longer, if you desire).\n\nAfter 14 days of listening, begin to listen to &quot;The Dive&quot; for 30 minutes followed by &quot;Immersion&quot; for the second thirty minutes. Do not use &quot;Immersion&quot; unless you have first listened to &quot;The Dive&quot;, as it may not work properly. After four weeks the length of your meditation may be extended to an hour and a half by playing &quot;Immersion&quot; more than once.\n\nThe bonus soundtracks, &quot;Quietude&quot; and &quot;Oasis&quot; are not part of the program per se, and may be listened to anytime. Quietude puts the listener into an alpha brain wave pattern, a state of relaxed yet focused attention associated with &quot;super learning&quot;. This is a state where you are able to take in, store, and remember information at a much higher level than normal. The best use is to listen, with headphones, while reading, studying, or learning.\n\nOasis places you in a theta state, which is a state of enhanced creativity and problem solving. It is the state Thomas Edison used to enter during his famous catnaps where he solved problems relating to his inventions. If you review the elements of a problem and then listen to Oasis, with headphones, remaining receptive to ideas that may come to you, you will be amazed at how creative your mind will become.\n\nYou will be ready for the next level (Awakening - Level 1) when:\n1) You have completed at least four months of use of Awakening Prologue,\n2) Any upheaval that you may have been experiencing due to listening has smoothed out,\n3) You are able to remain fully conscious during your listening sessions and,\n4) You have a feeling that the soundtracks are not as powerful or do not have the same impact as they once had.","torrent":{"xt":"urn:btih:d0132c53532e078f815a1e8926e35a3dbe1c2338","amp;dn":"Holosync+Awakening+Prologue+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0132c53532e078f815a1e8926e35a3dbe1c2338","infoHashBuffer":{"type":"Buffer","data":[208,19,44,83,83,46,7,143,129,90,30,137,38,227,90,61,190,28,35,56]},"announce":[],"urlList":[]}}