{"title":"Assorted Christian Books","uid":4306564,"size":10895868,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d09903bac4d33140bd5837db8642e5d8d22e23c5&amp;dn=Assorted+Christian+Books&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"IndianChristian","files":13,"time":1216582048,"description":"Assorted collection of excellent Christian books by various authors\n===================================================================\n\nThere are 7 booklets.\n\n1. The Sin of Idolatry - Rashid Alamir\n2. The Catholic Deception (Are Catholics Christians) - Rashid Alamir\n\nRashid Alamir was born to Muslim parents in a small village on the outskirts of Srinagar, Kashmir in 1969. He became a Christian during the May of 1995 while doing his MS degree in the States. In 1998, Alamir became an evangelist to the Muslim world. Alamir is the founder of Muslims for Jesus movement in India and is one of the pillars of the Byzantine Orthodox Church of India (BOCI). He is extremely fluent in Arabic and Urdu and has been instrumental in bringing several thousand lost souls to Jesus Christ both in India and the Arabic speaking Asian and African countries.\n\nThe Sin of Idolatry\n===================\n56 pages\n\nA Great book. Gives the brief history of Idolatry in the world. A must read for all Christians.\n\nTopics covered include:\nWhat is Idolatry?\nIdolatry and Perception \nSin and Idolatry \nForms of Idolatry \nWhy does God allow Idol worship?\nThe Origin and spread of Idol Worship\nThe spread of Idolatry in Asia \nIs Man God? \nIdolatry in the Scriptures \nThe road to Insanity : Why people believe in Idols? \nIdolatry in the Western Religions \nA few Biblical Case Studies on Idolatry \n\nThe Catholic Deception\n=================\n70 pages\n\nRashid Alamirs best selling book in pdf format. The book presents the differences between Catholicism and genuine Christianity as derived from the Bible. The most significant of these is Christians worship Jesus Christ while Catholics worship the Virgin Mary. He also deals with topics like Idolatry and the lack of evangelical drive in Catholicism. The book is not meant to cut Catholicism to size. It is meant to show Catholics how much the dogmas of the Catholic Church differs from Biblical Christianity and to reconcile them to the fact that Jesus Christ is their only redeemer, their only mediator before the Father and their only hope in this world. The book is dedicated to all Catholics worldwide.\n\n3. The Jesus I never knew - Philip Yancey\n\nAward-winning author Philip Yancey strips away the stereotypes and cosy images surrounding the person of Jesus to reveal the powerful and enigmatic reality of the man who changed history.\n\nPhilip Yancey was awarded the Gold Medallion Christian Book of the Year award for this book in 1996 by the Evangelical Christian Publishers Association. Its not the first, nor the last, award Yancey has won for his writing. But the writing is not necessarily the great gift of this book. Yancey allows the reader to discover, along with him, The Jesus I Never Knew. \n\nIn The Jesus I Never Knew, Yancey explores the life of Jesus, as he explains, from below, to grasp as best I can what it must have been like to observe in person the extraordinary events unfolding in Galilee and Judea as Jesus traveled and taught. Yancey examines three fundamental questions: who Jesus was, why he came, and what he left behind. Step by step, scene by scene, Yancey probes the culture into which Jesus was born and grew to adulthood; his character and mission; his teachings and miracles; his legacy--not just as history has told it, but as he himself intended it to be. \n\nThis book is available from Amazon.\n\n4. The Torn Veil: The Best-Selling Story of Gulshan Esther - Gulshan Esther \n\nThis is an amazing book and I would recommend it to all Christians, and perhaps more importantly, to anyone else who is open-minded about the claims of the Christian faith. The book describes how a Muslim girl, Gulshan Esther, is miraculously healed of a severe physical disability by Jesus when He appears before her. The book also details Gulshan&amp;#039;s rejection by her own family when she becomes a Christian, and her great courage and determination to serve Jesus and tell His people what He did for her. I cannot recommend this book highly enough.\n\nThis book is available from Amazon.\n\n5. Revolutions in World Missions - K.P. Yohannan\n\nThis book is written by KP Yohannan, founder of Gospel for Asia. \nIn this exciting and fast moving narrative, K.P. Yohannan shares how God brought him from his remote Indian village to start Gospel for Asia. This is a must-read book for Christians. It is a very inspirational book in which you very well could gain vision for where you are to go in your life. Maybe even a life over in Asia with the writer of this book. \n\nNote:\nThis book can be obtained, free of cost, from the author&amp;#039;s organization, Gospel for Asia (GFA) at gfa.org. Requestors are required to fill out some basic personal information for shipping, and they are given the option to receive other GFA literature and updates. If you prefer not to provide your contact information directly to GFA, do purchase the book at amazon. It is well worth it. \n\nThis book is available from Amazon.\n\n6. The Truth About Muhammad: Founder of the World&amp;#039;s Most Intolerant Religion - Robert Spencer\n\nIn this startling new book, New York Times bestselling author Robert Spencer, provides a warts-and-all portrait of the Prophet of Islam and draws out what his life implies for reforming Islam and repulsing Islamic terrorists. Spencer relies solely on primary sources considered reliable by Muslims and evaluates modern biographies to show how Muhammad has been changed for Western audiences, lulling them into consoling but false conclusions. \n\nThis book is a frank look at Muhammads influential (and violent) life and teachings. In The Truth about Muhammad, New York Times bestselling author and Islam expert Robert Spencer offers an honest and telling portrait of the founder of Islam-perhaps the first such portrait in half a century-unbounded by fear and political correctness, unflinching, and willing to face the hard facts about Muhammad&amp;#039;s life that continue to affect our world today. \n\nSpencer details Muhammad&amp;#039;s development from a preacher of hellfire and damnation into a political and military leader who expanded his rule by force of arms, promising his warriors luridly physical delights in Paradise if they were killed in his cause. He explains how the Qur&amp;#039;an&amp;#039;s teaching on warfare against unbelievers developed-with constant war to establish the hegemony of Islamic law as the last stage. \n\nSpencer also gives the truth about Muhammad&amp;#039;s convenient revelations justifying his own licentiousness; his joy in the brutal murders of his enemies; and above all, his clear marching orders to his followers to convert non-Muslims to Islam-or force them to live as inferiors under Islamic rule. \n\nThis book is available from Amazon.\n\n7. Death of a Guru (German) - Rabindranath Maharaj\n\nThis book is in German. I have been unable to get the English version. Once I get I will put it up.\n\nDescended from a long line of Brahman priests, Maharaj with bestselling author Dave Hunt, traces his difficult search for meaning, and his struggle to choose between Hinduism and Christ.\n\nRabi Maharaj&amp;#039;s autobiography is tender and poignant, yet reads like a thriller. Rabi was born into a wealthy brahmin family in Trinidad. His father was a great yogi who never said a word to anyone, not even to his wife, during his penance for 8 years. Upon his untimely death, his young son resolves to become just like him - an Ascended Master. Rabi soon loses his mother to meditation in the temples of India - another traumatic happening.\n\nThe flavour of life as an Indian boy growing up in the Carribean comes across well. The major portion of the book details Rabi&amp;#039;s intensely focused journey as Brahmacharya to attain Mukti (Self-realisation, union with Brahman). Some of the occult details he experienced, are also described by other yogis in hindu books. The more deeply he meditates and travels into Hinduism, the more dissatisfied he becomes. His gods Shiva and Kali seem to be threatening and unloving. After years of struggling with his thoughts, he realises that he is not Brahman - he cannot be the Creator of the Universe. As a brahmin, he despises the lower castes, especially Christians who eat the cow (a hindu god) and do not lead good lives. (The Cow is considered as a God and the holiest of all animals by Hindus. Drinking cow piss and putting cow piss on their heads is considered as one of the holiest of all acts by Hindus).\n\nThen two life-threatening incidents happen; a snake attacks him and in danger of his life, Rabi calls on the name of Jesus; the snake flees. Some time later his appendix ruptures and he collapses; Rabi again calls upon Jesus for help. His life is saved. \n\nAfter a lot of struggle, he goes to a hated christian meeting where he asks Jesus to come into his life and become his God. He meets the real Creator of the Universe who loves him so much, that He sent His Son to die for him on the cross.\n\nIt is only through faith in Jesus and in His name that we are saved from our sins and healed of our diseases. He was crucified for our sins and by the whipping he suffered, we are healed. He is the Only path to moksha. Being born as a christian does not make one into a christian. This book is about becoming a follower of Jesus Christ; not changing one&amp;#039;s name or eating beef (things which have no effect).\nRabi&amp;#039;s family and relatives cannot believe what has happened but after some time a number of them also find Christ. Their lives are transformed. However they are now hated by the rest of their relatives.\n\nContrary to what you might expect, Rabi is very respectful towards Hinduism. However he is also frank and honest. If you are seeking after Truth, then this is a book you must not miss. It will change your life. \n\nThis book is available from Amazon.","torrent":{"xt":"urn:btih:d09903bac4d33140bd5837db8642e5d8d22e23c5","amp;dn":"Assorted+Christian+Books","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d09903bac4d33140bd5837db8642e5d8d22e23c5","infoHashBuffer":{"type":"Buffer","data":[208,153,3,186,196,211,49,64,189,88,55,219,134,66,229,216,210,46,35,197]},"announce":[],"urlList":[]}}