{"title":"Sexually Broken--Veruca James is manhandled  Matt Williams MP4","uid":8792451,"size":1084167653,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:d0f546e000996752508f5927bfe6e15b66ace89b&amp;dn=Sexually+Broken--Veruca+James+is+manhandled++Matt+Williams+MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1375984715,"description":"\nVeruca James is manhandled, bound, brutally throated, brilliantly fucked, and made to cum! | Veruca James | Matt Williams\n\nAugust 7, 2013 \n\n\nMP4 only. \n \n \nWe are excited to introduce Veruca James to the pages of Sexually Broken. Veruca simply blew our socks off as a performer on one of the toughest sexual stages in the world. This is the girl you wish your girlfriend was like, Veruca is in the top 1% of her class. Her class being every girl in porn at this moment in time. Veruca takes anything you throw at her, and does it because she loves it, and yes, she picked her porn name after the spoiled rich bitch in Willy Wonka :)\n\nThis is the &quot;meet and Greet&quot; with Veruca. All the bondage is done on screen and all the action is made up on the spot. It is the most realistic BaRS scene you will ever see, the performers are reacting to each other live and on the spot, with no plan, dialogue or script. No acting, just all reaction, 3 professionals at the top of there game with the outcome undetermined. The only thing we know for sure is that Veruca is going to be helpless, Veruca is going to cum, and Veruca is going to be sexually destroyed afterwards.\n\nWords could never do the action in this scene justice. Veruca is driven through a gauntlet of hard cock. Cock that completely and utterly plunges Veruca into deep sub-space. We can't even describe how well she handles the most intense throat fucking we have ever delivered to a hungry throat. We can't describe how hard she gets fucked, while deep throating and unable to get proper air to her lungs from all the cock down her throat. We can't accurately describe how intense this scene really is, and we are not joking, it's that good.\n\nIf you ever wanted to know what Sexually Broken is all about, if you ever wanted to know why we name the site what we did, then watch this update. After you do you will know why Sexually Broken is the best Bondage and rough sex site in the world. We only work with girls who love this type of sex and excel at it. Do yourself a favor and join today and see what all the fuss is about.. \n \nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/08_07vjames/SexuallyBroken-Veruca-James-Veruca-James-is-manhandled-bound-brutally-throated-brilliantly-fucked-and-made-to-cum.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/08_07vjames/SexuallyBroken-Veruca-James-Veruca-James-is-manhandled-bound-brutally-throated-brilliantly-fucked-and-made-to-cum.php&lt;/a&gt;\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:d0f546e000996752508f5927bfe6e15b66ace89b","amp;dn":"Sexually+Broken--Veruca+James+is+manhandled++Matt+Williams+MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0f546e000996752508f5927bfe6e15b66ace89b","infoHashBuffer":{"type":"Buffer","data":[208,245,70,224,0,153,103,82,80,143,89,39,191,230,225,91,102,172,232,155]},"announce":[],"urlList":[]}}