{"title":"Alien Blitz v1.0","uid":8778627,"size":37063797,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:d1ac1b6c8030c8843eab6f5914c7c6928526382e&amp;dn=Alien+Blitz+v1.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1375624806,"description":"\nYour island has been invaded by aliens during the night, take your shotgun, and kick them out!\n\nAlien Blitz is a top-view arcade-shooter with loads of weapons, maps and monsters.\n\nYou play a soldier resting on his native island, but it is quickly overrun by monsters from outer space and no outside help is available. \n\nYou put on your armor, take your shotgun and go to find out what happened at the peril of your life.\n\nFeatures:\n\n- 4 difficulty settings\n- Hours of shooting\n- 3 episodes, 41 maps\n- 14 Upgradeable weapons\n- Leveling\n- Achievements, best time tracking,...\n\nExplore:\n\nExplore lots of levels, find keys to access new zones, avoid the traps, and try to get out alive from these labyrinths.\n\nFighting and weapons:\n\n&quot;Aliens want you dead, and you don't want to die!&quot;\nYou will face more than twenty different kinds of monsters during your journey; avoid homing fireballs, missiles, and all the other atrocities aliens prepared for you.\n\nFortunately, you will not fight alone; you are accompanied by the best weapons available: starting from a simple shotgun you might end with powerful weapons such as fragmentation missiles, chain lightning or bombardment!\nFind all the 14 weapons and upgrade them to make them even more devastating!\n\nGameplay:\n\nRediscover the pleasure of killing monsters, these monsters might not be very smart, but they are many and strong. Beware; some are particularly tough!\nRemember that these monsters might get new skills later in the adventure!\n\nDifficulty:\n\n4 difficulty settings are available, from casual gamer to hardcore gamer everyone will get appropriate difficulty. Best warriors can also try Nightmare mode (unlockable), but only if they are ready to die!\n\nAchievements:\n\nTry to get all achievements, find all the treasures, finish levels quickly (SpeedRun!) or try to beat the game with a 100% score everywhere. There are great rewards awaiting.\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.microbasic.alienblitzfull&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.microbasic.alienblitzfull&lt;/a&gt;\n","torrent":{"xt":"urn:btih:d1ac1b6c8030c8843eab6f5914c7c6928526382e","amp;dn":"Alien+Blitz+v1.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1ac1b6c8030c8843eab6f5914c7c6928526382e","infoHashBuffer":{"type":"Buffer","data":[209,172,27,108,128,48,200,132,62,171,111,89,20,199,198,146,133,38,56,46]},"announce":[],"urlList":[]}}