{"title":"Ript90 Workout System","uid":12074890,"size":2132794945,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:d1d6c9d9d0e0f942e82cab29fe059db16afae2ab&amp;dn=Ript90+Workout+System&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MrTVGuy","files":17,"time":1435612352,"description":"Get in the best shape of your life with RIPT90!\n\nIf you want to melt away fat, build lean muscle and get serious about your fitness, then join Jody Hendrix in RIPT90.\n\nRIPT90 includes 14 workouts designed to shred fat and build long lean muscle.\nEach workout demonstrates modification levels so regardless if you are a beginner, or ready to take it to the next level athletically, this workout is for you.\n\nNot only do you get the 14 workouts, also included is a complete training guide, planning calendar and nutrition plan. Only dumbbells or resistance bands are needed to get in the best shape of your life. We also recommend a pull-up bar.\n\nRIPT Abs, 14 Mins - Focus on ripped abs and strong core\nBack Breaker, 42 Mins - Pushing and pull your way to a cut back\nMinute by Minute, 39 Mins - Fast paced fat burning and muscle toning workout\nDeadlift Killer, 39 Mins - Targets your hamstrings and glutes\nDirty Dozen, 23 Mins - A head to toe workout\nShoulder Pressure, 21 Mins - The deltoids are our focus here in this workout\nChest Shredder, 39 Mins - The pectorals get the RIPT90 treatment\nDeath by Thruster, 25 Mins - Multiple muscle groups &amp; max calorie burn\nStretch, 17 Mins - A head to tow recovery workout\nUps and Downs, 18 Mins - Jack your heart rate and tone your entire body\nLeg Overhaul, 25 Mins - Hamstrings, glutes and quads get challenged here\nArm Annihilator, 35 Mins - Curls, dips and much more get those guns ready for the show\nTotal Body Tamer, 32 Mins - Cardiovascular and strength building workout\nMetabolic Mania, 25 Mins - Tough fat shedding workout\n\nUse the included training guide to help plan and schedule your workouts.\nWe also provide a complete Nutrition Plan to aid your meal planning, including simple, easy to follow recipes.\nStay motivated by posting your &quot;BEFORE&quot; photo and tracking your progress with the wall calendar!","torrent":{"xt":"urn:btih:d1d6c9d9d0e0f942e82cab29fe059db16afae2ab","amp;dn":"Ript90+Workout+System","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1d6c9d9d0e0f942e82cab29fe059db16afae2ab","infoHashBuffer":{"type":"Buffer","data":[209,214,201,217,208,224,249,66,232,44,171,41,254,5,157,177,106,250,226,171]},"announce":[],"urlList":[]}}