{"title":"Inorganic Membrane Reactors - Fundamentals and Applications","uid":12083074,"size":6343152,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d2025389e2cc17bb0f7dab0a7dab4a5dcffc2680&amp;dn=Inorganic+Membrane+Reactors+-+Fundamentals+and+Applications&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1435833076,"description":"Inorganic Membrane Reactors - Fundamentals and Applications - Xiaoyao Tan, Kang Li (Wiley, 2015).pdf\n\nISBN 978-1-118-67284-6\n\nMembrane reactors combine membrane functions such as separation, reactant distribution, and catalyst support with chemical reactions in a single unit. The benefits of this approach include enhanced conversion, increased yield, and selectivity, as well as a more compact and cost-effect design of reactor system. Hence, membrane reactors are an effective route toward chemical process intensification. This book covers all types of porous membrane reactors, including ceramic, silica, carbon, zeolite, and dense metallic reactors such as Pd or Pd-alloy, oxygen ion-conducting, and proton-conducting ceramics. For each type of membrane reactor, the membrane transport principles, membrane fabrication, configuration and operation of membrane reactors, and their current and potential applications are described comprehensively. A summary of the critical issues and hurdles for each membrane reaction process is also provided, with the aim of encouraging successful commercial applications. The audience for Inorganic Membrane Reactors includes advanced students, industrial and academic researchers, and engineers with an interest in membrane reactors","torrent":{"xt":"urn:btih:d2025389e2cc17bb0f7dab0a7dab4a5dcffc2680","amp;dn":"Inorganic+Membrane+Reactors+-+Fundamentals+and+Applications","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2025389e2cc17bb0f7dab0a7dab4a5dcffc2680","infoHashBuffer":{"type":"Buffer","data":[210,2,83,137,226,204,23,187,15,125,171,10,125,171,74,93,207,252,38,128]},"announce":[],"urlList":[]}}