{"title":"Cartoon - The World of David the Gnome - Disc 3 of 4","uid":4511364,"size":8196130863,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:d35cc8781603022f4d7763e18f8b990227af8234&amp;dn=Cartoon+-+The+World+of+David+the+Gnome+-+Disc+3+of+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cowboy23","files":29,"time":1226788402,"description":"There is already a set of DVD rips on Demonoid but figured I&amp;#039;d upload the actual full disc&amp;#039;s if anyone is interested. This disc contains episodes 13-19\n\n# Format: Region Free thanks to AnyDVD\n# Language English\n# Region: Region 2\n# Aspect Ratio: 1.33:1\n# Number of discs: 4\n\n13 &quot;The Siberian Bear&quot;\nDavid is in his garden picking vegetables when he receives a telepathic message. The message is coming from the king of Siberia. David tells Lisa that they will be gone for a long time, and he builds a sort of bench for them to sit on during the journey. Swift carries them to Siberia, holding the top part of the bench in his mouth. On the first night, they have to take shelter from a storm. In the morning, the storm is over, and the king&amp;#039;s messenger comes to greet them. On the way to the palace, David tries his hand at skiing, and impresses the other gnomes. At the palace, the king tells David that there is a bear stuck in a high tree, who has been there for several days. David gets help from some other gnomes to save the bear. They tie a rope around the bear, and loop it around the branches of the tree. The gnomes shove on a weaker branch until it falls and the bear comes down too. The bear is fine and thanks the gnomes for helping him.\n\n14 &quot;Foxy Dilemma&quot;\n\n15 &quot;Three Wishes&quot;\nA poor woodsman saves Lisa after she is attacked by his cat. To express his generosity, David grants the woodsman three wishes, which do not go as planned. When David grants the woodsman&amp;#039;s wish to become a rich man, the woodsman takes a bar of gold into the city and attempts to sell it to a store owner. The woodsman is accused of thievery and thrown in prison. David helps him to become free and the woodsman learns to use his wishes wisely.\n16 &quot;Ivan the Terrible&quot;\n\n17 &quot;Rabbits, Rabbits Everywhere&quot;\n\n18 &quot;Any Milk Today&quot;\n\n19 &quot;The Shadowless Stone&quot;","torrent":{"xt":"urn:btih:d35cc8781603022f4d7763e18f8b990227af8234","amp;dn":"Cartoon+-+The+World+of+David+the+Gnome+-+Disc+3+of+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d35cc8781603022f4d7763e18f8b990227af8234","infoHashBuffer":{"type":"Buffer","data":[211,92,200,120,22,3,2,47,77,119,99,225,143,139,153,2,39,175,130,52]},"announce":[],"urlList":[]}}