{"title":"Kevin And Perry Go Large [Dvd-Rip][2000][ENG]","uid":4365442,"size":630765411,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d35cfbf38028032dfdc9fcc0900d2fa510da5491&amp;dn=Kevin+And+Perry+Go+Large+%5BDvd-Rip%5D%5B2000%5D%5BENG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"08Peechie08","files":44,"time":1219871504,"description":"Best friends Kevin and Perry decide they need to lose their virginity and to become, &quot;top DJs&quot;, and plan to go to Ibiza to do so. They receive a reward for accidentally foiling a bank raid, and with Kevin&amp;#039;s parents agreeing on the condition that they accompany them, they go to Ibiza.\n\nOnce in Ibiza, they meet the world famous DJ Eyeball Paul, who takes every opportunity to patronise and insult them - of which they seem to be blissfully ignorant, describing him repeatedly as &quot;such a nice bloke&quot;. Kevin and Perry persuade Eyeball Paul to play a song they have created at his next performance, but only after they carry out several chores for him, including cleaning his kitchen floor and unblocking his toilet by hand.\n\nThroughout their stay in Ibiza, Kevin and Perry set their sights on &quot;the girls of their dreams&quot;, Candice and Gemma, whom Kevin and Perry try and chat up with put-on posh accents. The teenagers experience several bizarre mishaps which set back their pursuit of Candice and Gemma, including being vomited on from a height and crashing mopeds, and their friendship is strained when and Perry films Kevin&amp;#039;s parents while they are having sex.\n\nThe film ends with Kevin and Perry losing their virginity to Candice and Gemma respectively. When back at home, the boys are seen signing copies of their record in a music store, whilst Kevin&amp;#039;s parents are seen signing copies of a video they have made about better mid-marriage sex.","torrent":{"xt":"urn:btih:d35cfbf38028032dfdc9fcc0900d2fa510da5491","amp;dn":"Kevin+And+Perry+Go+Large+%5BDvd-Rip%5D%5B2000%5D%5BENG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d35cfbf38028032dfdc9fcc0900d2fa510da5491","infoHashBuffer":{"type":"Buffer","data":[211,92,251,243,128,40,3,45,253,201,252,192,144,13,47,165,16,218,84,145]},"announce":[],"urlList":[]}}