{"title":"World and Time Enough (1995) Gay-Interest","uid":9419909,"size":912226832,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d420612ed837596cf7d4f66761f1a64003ad0942&amp;dn=World+and+Time+Enough+%281995%29+Gay-Interest&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":1,"time":1388558143,"description":"Two men--a gay, HIV-positive artist and an adopted garbage collector--struggle in the face of stigma and loss to find meaning in work, love, and family. \n\nreview:\n\n\n16 September 2002 | by devalier (Memphis, TN) \n\n Tender, slice-of-life drama marks an impressive debut for writer/director Eric Mueller. Unlike most queer cinema of the 90's, World and Time Enough eschews ubiquitous drag queens, trendy settings, and bitchy dialogue. It's sensitive, low-key, and modest. A film that's more interested in &quot;quiet moments&quot; than a complex narrative and lots of action. Those who appreciated Bill Sherwood's Parting Glances will probably love this movie, which is a little less urbane and more blue-collar. Viewers with short-attention spans and an affinity for graphic gay sex should definitely avoid at all costs.\n\nMuch of the film's success is due to the ingratiating performances of Matt Guidry and Gregory Giles as central characters Mark and Joey. Both actors are spot-on in their portrayals of two men who share a deep, mutual love for one another. Their supportive relationship is a refreshing change from the dysfunctional unions typically presented in films of this kind. Although the actors are both straight in real-life, they are completely believable as onscreen lovers. Like other reviewers, I'd love to see the two together again. Guidry continues to appear in Minneapolis theatre, while Giles is concentrating on theatre in LA. Maybe one day Mueller will do a sequel to show us Mark and Joey, still united I'm sure, years later. I know I'd be the first in line to buy a ticket.\n\n","torrent":{"xt":"urn:btih:d420612ed837596cf7d4f66761f1a64003ad0942","amp;dn":"World+and+Time+Enough+%281995%29+Gay-Interest","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d420612ed837596cf7d4f66761f1a64003ad0942","infoHashBuffer":{"type":"Buffer","data":[212,32,97,46,216,55,89,108,247,212,246,103,97,241,166,64,3,173,9,66]},"announce":[],"urlList":[]}}