{"title":"Corbin Fisher - - - Toby Fucks Jesse ((MictrmbL))","uid":5247882,"size":242683808,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:d452ba584183e7a79f91399b520015665a8ee69f&amp;dn=Corbin+Fisher+-+-+-+Toby+Fucks+Jesse+%28%28MictrmbL%29%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mictrmbl","files":77,"time":1262227504,"description":"From the vaults of Corbin Fisher:\n\n\nTwo of CF's newest young college hotties team up together in this video for a hot fuck session pitting the West Coast skater and Southern stud in a steamy fuck session :) We know that Toby's an open-minded young man, who knows what feels good and has no problem pursuing that. And Jesse's proven himself quite the eager bottom in his last action video where he took it like a champ and looked pretty damn hot doing it! I really loved filming that scene and really wanted to see him bottom again, and soon! Plus, I really wanted to have Toby do even more than his already-wild intro video featured! He entered onto CF with quite a splash, getting a bj from Logan. So it was only right that he do even more his second time out :)\n\nThings got goin0g straight away in this video, the cameras bein' turned on with Toby and Jesse making out quite hot and heavily! In fact, from the instant things got started these guys were going at it pretty intense! And you could tell Toby really wanted to get his dick deep into Jesse's ass as he worked it over and warmed it up with his fingers before sliding his cock in to Jesse's hole.\n\nI'm not going to give all the action away in this description, but one thing I think you will most definitely notice throughout is how hard Jesse's cock is during the entire fuck, regardless of position! Whatever Toby was doing, he was doing it just right! Jesse's big dick looks incredible as it flops around and points outward as he's getting drilled!","torrent":{"xt":"urn:btih:d452ba584183e7a79f91399b520015665a8ee69f","amp;dn":"Corbin+Fisher+-+-+-+Toby+Fucks+Jesse+%28%28MictrmbL%29%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d452ba584183e7a79f91399b520015665a8ee69f","infoHashBuffer":{"type":"Buffer","data":[212,82,186,88,65,131,231,167,159,145,57,155,82,0,21,102,90,142,230,159]},"announce":[],"urlList":[]}}