{"title":"Sampler of great obscure and very well recorded music FLAC","uid":12345478,"size":2615278504,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d5ee4190ebcfd6a2a2e01e1d02c2286d7c9fafff&amp;dn=Sampler+of+great+obscure+and+very+well+recorded+music+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rontoolsie","files":98,"time":1441349225,"description":"This is a reseed of my original five CD-length music samplers culled from artists who I guarantee most of you will never have heard of, and yet wonder how you may have missed them for all of these years. This version now has metadata with cover art etc. \n\nSo, you will find the likes of the powerful voiced, gospel-based Ashley Cleveland, Corky Siegal playing blues harp backed by a chamber quartet, the beautiful voice of David Wilcox paying homage to Chet Baker, the rough edge of Greg Brown, the Canadian celtic infused music of Kate Price, the confessional singer/singwriter and occasional Nirvana inspired grunge of Leticia Wolf, Michael Nelsons Celtic hammered dulcimer that is reproduced with such clarity you would think it was in the room, Primal Scream thinking they are the Rolling Stones, the plaintive blues guitar of 16 year old Shuggie Otis, the fragile voice of the Swedish Sophie Zelman, the Miles Davis tone of Tiger Okoshi on trumpet, Tom Rush doing a Joni Mitchell cover even before it was recognized as a Joni song, the perfect voice of Susie Suh.....and that is some of what is on ONE of the samplers. There is much, MUCH more to be found.\n\nThe second sampler includes the mystical voices of Clannad, the balrog bass growling away on a Paula Cole track, the Quaalude baritones of Fred Neil doing a slow (very slow) bluesy track at maybe 15 beats/minute, a homage to about 25 different blues guitarits by 15 year old Monster Mike Welch and then some. Ignore the mediafire links in the .doc file-they were the way I originally shared them years ago. \n\nSampler E has the psychedelic country influenced tones of Jim White (if you don't like country, do NOT ignore this guy), a professor of jazz guitar doing a CSN&amp;Y song, the original acoustic demo of Dirty Vegas 'Days Gone By' which is parsecs removed from the popularized club remix, the scorn of Ani DiFranco and again much more.\n\nI defy anyone not to get a lump in their throat when they listen to Phil Roy's 'Melt' or feel the angst in David Blues 'House of Changing Faces (a story of his days addled out in a drug den), or cringe at the invective of Holly McNarlands (Mr 5 Minutes-a scathing attack on premature ejaculation!) or to share the sorrow of Leticia Wolf singing a song about watching her grandmother slowly die (Deathbed), while at the same time embracing her death. \n\nAnd so it goes. To find out what else is on these you will have to suffer through the 2.4 GB download.\n\nEach sampler has a .txt file giving a thumbnail sketch on the individual track or artist. \n\nI originally compiled these for a group of my audio-fool friends a few years ago, so they sonics are very good to astounding, as they were compiled both to introduce them to new music as well as showing off their $100k+ audio systems. The notes I sent them I have left unchanged, so they may have a few obscure references. \n\nTrust me...if you take the time to download this sampler packet, you will not be disappointed. Bear in mind though the musical styles are very diverse and not all tracks will appeal to everybody. But some of them will stick for a very long time","torrent":{"xt":"urn:btih:d5ee4190ebcfd6a2a2e01e1d02c2286d7c9fafff","amp;dn":"Sampler+of+great+obscure+and+very+well+recorded+music+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5ee4190ebcfd6a2a2e01e1d02c2286d7c9fafff","infoHashBuffer":{"type":"Buffer","data":[213,238,65,144,235,207,214,162,162,224,30,29,2,194,40,109,124,159,175,255]},"announce":[],"urlList":[]}}