{"title":"Disney - Our Mr. Sun - The Strange Case of the Cosmic Rays","uid":4593544,"size":733746195,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d767188222687309b0552fcaaee63c2eb8dd795a&amp;dn=Disney+-+Our+Mr.+Sun+-+The+Strange+Case+of+the+Cosmic+Rays&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":5,"time":1229922122,"description":"AVI File Details\n========================================\nName.........: Disney - Our Mr. Sun.avi\nFilesize.....: 349 MB (or 358,212 KB or 366,809,088 bytes)\nRuntime......: 00:53:49 (77,420 fr)\nVideo Codec..: XviD\nVideo Bitrate: 799 kb/s\nAudio Codec..: 0x0055(MP3) ID'd as MPEG-1 Layer 3\nAudio Bitrate: 101 kb/s (50/ch, stereo) VBR LAME3.97\nFrame Size...: 512x384 (1.33:1) [=4:3]\n\n\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Our_Mr._Sun&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Our_Mr._Sun&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0159620/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0159620/&lt;/a&gt;\n\n\nOur Mr. Sun is a 1956 television film directed by Frank Capra. It starred Eddie Albert, Frank Baxter, Sterling Holloway, and Marvin Miller. It is simply a documentary that explains how the sun works and how it also plays a huge part in human life. It marked the last project of Lionel Barrymore, who worked as a voice to Father Time.\n\nOur Mr. Sun, and a companion film Hemo the Magnificent (about blood circulation), were popular favorites for showing in school science classrooms.\n\n\nIn the mid-1950's, AT&amp;T and Bell Science teamed with famed Hollywood director Frank Capra to produce a series of CBS television science films to educate the public about the Universe around them. A far cry from the dreary black &amp; white fodder so often foisted off on young scholars, the Capra films would both instruct and entertain with lively scripts and eye-catching visuals shown in Technicolor. The four films - OUR MR. SUN (1956), THE STRANGE CASE OF THE COSMIC RAYS (1957), HEMO THE MAGNIFICENT (1957), THE UNCHAINED GODDESS (1958) - quickly became schoolhouse favorites, where they were endlessly shown in 16mm format.\n\nThe star of the series was Dr. Frank C. Baxter (1896-1982), an affable English professor at the University of Southern California. This avuncular pedagogue proved to be the perfect film instructor, genially imparting to his audience the sometimes complex facts in a manner which never made them seem dull or boring. Dr. Baxter, who won a Peabody Award for his achievements, continued making instructional films after the Capra quartet were concluded.\n\nOUR MR. SUN, which won an Emmy for its editing, presents the information known about our solar neighbor at mid-century, using spectacular photography, animation and gentle humor. Film star Eddie Albert appears as the Fiction Writer, looking to get an angle on how to present the sun's story. Marvin Miller provides the voice for the animated Mr. Sun.\n\nStrangely uncredited is Lionel Barrymore, one of America's best loved character actors, who gives the voice for Father Time. Barrymore had died back in 1954, making this his very final performance. Movie mavens will also recognize Sterling Holloway as the voice of Chloro Phyll.\n\nThe devotional sentiments spoken by Barrymore at the end of the film are completely in tune with the tenor &amp; tone of the production. \n\n","torrent":{"xt":"urn:btih:d767188222687309b0552fcaaee63c2eb8dd795a","amp;dn":"Disney+-+Our+Mr.+Sun+-+The+Strange+Case+of+the+Cosmic+Rays","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d767188222687309b0552fcaaee63c2eb8dd795a","infoHashBuffer":{"type":"Buffer","data":[215,103,24,130,34,104,115,9,176,85,47,202,174,230,60,46,184,221,121,90]},"announce":[],"urlList":[]}}