{"title":"National Lampoon's European Vacation 1985 [TVRip] [PL]","uid":4537220,"size":1466198016,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d76cded76cb88a1ce12d4bbd6a76567ce1fd34b2&amp;dn=National+Lampoon%5C%27s+European+Vacation+1985+%5BTVRip%5D+%5BPL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zawodowiec","files":2,"time":1227746772,"description":"In a game show called &quot;Pig In A Poke,&quot; the Griswold family -- Clark, Ellen, Rusty, and Audrey -- accidentally wins a trip to Europe, winning against a family that had previously never been defeated on this game show, which is hosted by Kent Winkdale. Just before the trip, Clark makes an erotic videotape of Ellen, promising to erase the tape later. Clark likes the game show&amp;#039;s itinerary of what they are scheduled to do in Europe, but Ellen and the kids don&amp;#039;t feel the same way. They begin their trip to Europe in London, England, where they stay in a ratty hotel. Clark has problems learning how to drive European cars, which have the steering wheel on the right side instead of the left side. In England, the Griswolds see things like Big Ben, Parliement, and Buckingham Palace. Audrey misses her boyfriend Jack so much that she wants to go back to Chicago. Clark is oblivious to how his family feels as he takes the family to see places such as Stonehenge, which Clark accidentally knocks down by backing a rented car into it. The trip to Europe then moves from London to Paris, France, where Clark has a French man use the camcorder to tape the Griswolds near a water fountain, but the French man steals the camera, with a videotape inside of it. In Paris, the Griswolds visit the Eiffel tower. The hotel room they check into in Paris is better than the one they had in London. The Griswolds visit the Musee De Louvre, then Audrey gets a letter from Jack, saying that Jack has been seeing Audrey&amp;#039;s best friend Debbie while Audrey is in Europe. The next stop for the Griswolds is Germany, to visit their long lost relatives Fritz and Helga, but they end up at the wrong house and mistake this house&amp;#039;s residents as their relatives. Nevertheless, they have a nice visit. Next, the Griswolds visit a festival where Clark joins in on some German dancing that he has no idea how to do. Not surprisingly, the dancing ends with a fistfight. The Griswolds get on a train to Rome, Italy, but on the way there, they get off the train to go to the travelers check place, but they are greeted by a pair of men that they don&amp;#039;t know are robbing the place. After getting $3,000 from the place, the Griswolds get a car from the same two men, who have placed the clerk in the trunk of the car, and the Griswolds make their way into Rome, where they buy new clothes and Ellen sees a picture of herself on a billboard -- the thief who stole their video camera has been selling copies of the erotic tape of Ellen, which Clark forgot to erase, and Ellen is livid. The two thieves, the ones who robbed the place where the Griswolds got the $3000, show up in Rome, and one of them, who has fallen for Ellen, kidnaps Ellen. Audrey sees the guy leaving with Ellen, and Audrey and Clark set off to rescue Ellen. \n\nCast:\n\n\nChevy Chase\t... \tClark Griswold\nBeverly D&amp;#039;Angelo\t... \tEllen Griswold\nDana Hill\t... \tAudrey Griswold\nJason Lively\t... \tRussell &amp;#039;Rusty&amp;#039; Griswold\nJohn Astin\t... \tKent Winkdale\nSheila Kennedy\t... \tGame Show Hostess #1\nPaul Bartel\t... \tMr. Froeger\nCynthia Szigeti\t... \tMrs. Froeger","torrent":{"xt":"urn:btih:d76cded76cb88a1ce12d4bbd6a76567ce1fd34b2","amp;dn":"National+Lampoon%5C%27s+European+Vacation+1985+%5BTVRip%5D+%5BPL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d76cded76cb88a1ce12d4bbd6a76567ce1fd34b2","infoHashBuffer":{"type":"Buffer","data":[215,108,222,215,108,184,138,28,225,45,75,189,106,118,86,124,225,253,52,178]},"announce":[],"urlList":[]}}