{"title":"Grant Green - The Latin Bit (1962)@flac","uid":7104899,"size":446393783,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d7c1501fe56066ab1418986601260cdc83182791&amp;dn=Grant+Green+-+The+Latin+Bit+%281962%29%40flac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alekow","files":-1,"time":1331834928,"description":"\nGrant Green, being known mainly as a soul-jazz guitarist, eventually gravitated into the popular boogaloo sound, a derivation of Latin music. The Latin Bit is the natural bridge to that next phase, though a bit premature for most in 1961-1963, even relative to the subsequent bossa nova craze. \nPianist Johnny Acea, long an underrated jazzman, is the nucleus of this session, grounding it with witty chops, chordal comping, and rhythmic meat. The Latino rhythm section of drummer Willie Bobo and conga player Carlos &quot;Patato&quot; Valdes personify authentic, seasoned spice, while at times the chekere sound of Garvin Masseaux makes the soup too thick. At its collective best, the group presents a steady, serene, and steamy &quot;Besame Mucho&quot; and the patient, slow, slinky, sultry &quot;Tico Tico.&quot; Just a small step below is a classy take on Charlie Parker's &quot;My Little Suede Shoes,&quot; a premier jazz bebop (emphasis) tune with a Latin undertow and Green's tiniest staccato phrases, slightly marred by the overbearing constant chekere, but still classic. &quot;Mambo Inn&quot; is played inaccurately, but forgivable. &quot;Mama Inez&quot; ranks high for its calypso-infused happy feeling and wry stop-start lines. The straight-ahead hard bopper &quot;Brazil&quot; and lone soul-jazz tune, &quot;Blues for Juanita,&quot; display the single-note acumen that made Green's style instantly recognizable. Tacked on the end are two selections with pianist Sonny Clark and tenor saxophonist Ike Quebec. While Clark is not known for Latin or soul-jazz, he's quite good, while Quebec, who emphasized Brazilian rhythms in the last years of his life, plays hip secondary harmonies on the bossa nova-flavored &quot;Granada,&quot; but is in the complete background and a non-factor on the pop tune &quot;Hey There.&quot; \nThis CD always yielded mixed results for staunch fans of Green, but a revisit shows it to be a credible effort, even if slightly flawed in part. (This edition of The Latin Bit was remastered by Rudy Van Gelder in 2007.) (AMG)\n\n\n\n01. Mambo Inn    [5:50]\n02. Besame Mucho    [7:11]\n03. Mama Inez    [6:40]\n04. Brazil    [5:01]\n05. Tico Tico    [7:45]\n06. My Little Suede Shoes    [6:23]\n07. Blues For Juanita    [7:04]\n08. Grenada    [6:26]\n09. Hey There    [7:22]\n\n\n\n\nGuitar - Grant Green\nBass - Wendell Marshall\nPiano - Johnny Acea (tracks: 01 to 07), Sonny Clark (tracks: 08, 09)\nTenor Saxophone - Ike Quebec (tracks: 08, 09)\nDrums - Willie Bobo\nCongas - Carlos &quot;Patato&quot; Valdes\nPercussion [Checkere] - Garvin Masseaux (tracks: 01 to 06)\n\n\nProducer - Alfred Lion\nRecorded By, Remastered By [2007] - Rudy Van Gelder\n    \n    \n\nOriginally recorded on April 26 (#1-7) and September 7 (#8 &amp; 9), 1962 at Van Gelder Studios, Englewood Cliffs, New Jersey.\n\nTracks 01-06 originally issued in 1963 as Blue Note BST 84111.\nTracks 07-09 originally issued in 1996 on the first CD edition of this album. Bonus tracks, not part of original LP\n\n\nLabel: Blue Note\nReleased: 2007\n\n\n\n\n\nCodec: Flac\nCompression Level: 5\nQuality: High\n\n\nCD-rip by alekow (EAC and Flac)\nCovers Included (600dpi)\n\n\n\n\n\n\n\nEnjoy, Seed and Share","torrent":{"xt":"urn:btih:d7c1501fe56066ab1418986601260cdc83182791","amp;dn":"Grant+Green+-+The+Latin+Bit+%281962%29%40flac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7c1501fe56066ab1418986601260cdc83182791","infoHashBuffer":{"type":"Buffer","data":[215,193,80,31,229,96,102,171,20,24,152,102,1,38,12,220,131,24,39,145]},"announce":[],"urlList":[]}}