{"title":"Whitney Houston - Greatest Love Of All","uid":4742283,"size":166010884,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d804dc1325692030158563d3da41d2f1f184af03&amp;dn=Whitney+Houston+-+Greatest+Love+Of+All&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1235617991,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Greatest Love of All&quot; is the fourth and final single released from Whitney Houston's self-titled 13x platinum (U.S.) first studio album, Whitney Houston, released in April 1986. The single reached #1 on the U.S. Hot 100 chart. It was written by Michael Masser and Linda Creed, and originally recorded (as &quot;The Greatest Love of All&quot;) by George Benson for the 1977 Muhammad Ali film The Greatest. The original record was a minor hit for Benson.\n\nLabel head Clive Davis was against Houston recording the song, but eventually gave in after persuasion from Masser. The song was included as a B-side to the single &quot;You Give Good Love&quot;, another Top 5 hit by Houston in the U.S.\n\nThe original album version features a piano intro, while the single version begins with a keyboard intro. After the single became a success, it replaced the album version on subsequent copies of the album.\n\nWhen Linda Creed wrote the lyrics, she was in the midst of her struggle with breast cancer. The words describe her feelings about coping with a terminal illness and being a young mother. She eventually succumbed to the disease and died in April 1986 (at the age of 37), the same month that the single was released.\n\nHouston's single reached number one on the Billboard Hot 100 chart for three weeks. The song was the fourth hit (and third #1) from her album. It was her second longest stay at number-one after I Will Always Love You. The song also reached number one on both component charts, the Hot 100 Singles Sales and the Hot 100 Airplay, her second consecutive release to do so, and stayed for fourteen weeks in the top forty.\n\nOn other Billboard charts, the song also performed well, reaching number three on the Hot R&amp;B/Hip-Hop songs chart. It topped the Adult Contemporary chart for five weeks, Houston's longest stay at the top of the chart at the time.\n\nInternationally, the song fared well, reaching number eight in the United Kingdom and number twenty in Switzerland. It became Houston's first number one single in Australia.\n\nIt won the American Music Award for Favorite Soul/R&amp;B Video, and was nominated for a Grammy Award for Record of the Year and a Soul Train Music Award for Single of the Year.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:d804dc1325692030158563d3da41d2f1f184af03","amp;dn":"Whitney+Houston+-+Greatest+Love+Of+All","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d804dc1325692030158563d3da41d2f1f184af03","infoHashBuffer":{"type":"Buffer","data":[216,4,220,19,37,105,32,48,21,133,99,211,218,65,210,241,241,132,175,3]},"announce":[],"urlList":[]}}