{"title":"Find &amp; Replace It! v. 2.0.1 [K]racked","uid":6974595,"size":27422636,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:d8ada4278d8e368a91fcd64721352e48eb063ee6&amp;dn=Find+%26amp%3B+Replace+It%21+v.+2.0.1+%5BK%5Dracked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"polisdavid","files":-1,"time":1327202852,"description":"Official Web Site: &lt;a href=&quot; http://www.macupdate.com/app/mac/31914/find-&amp;-replace-it!&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.macupdate.com/app/mac/31914/find-&amp;-replace-it!&lt;/a&gt;\n\nFind &amp; Replace It! is a high-end solution to find files and execute search and replace operations across multiple files. It allows performing very complex batch replacements inside text files of any size. It supports regular expression syntax and dozens of encodings. It has scripting capabilities which allow transforming on the fly the replacement text for every found string. It even handles batch processing of the encoding of files, as well as of types of end-of-lines.\n\nFeatures::\n\n* Handles more than 50 different kinds of text encodings. If your are\n  stucked with some UTF-8 encoding, some Chinese contents or any\n  others non ASCII encodings, Find &amp; Replace It! is the solution for you.\n  It also handles the different kinds of end-of-line.\n\n* Handles huge files. If you want to process any kind of dump files\n  containing tons of text, like a log of 10 GB, Find &amp; Replace It! will do it\n  for you.\n\n* Provides a regular expression editor. This editor offers tools to easily\n  build regular expressions even if you are a newby.\n\n* Provides a find &amp; replace preview. The preview window gives you an\n  immediate feed-back that makes easy to check the impact of your\n  replacement within any file without modifying its content. This is \n  especially usefull whenever you are searching for a complex expression\n  and you don't want to replace it blindly in many files.\n\n* Makes it possible to dynamically adjust the replacement text. I\n  provides three ways of dynamically adjust the replacement text\n  according to the text found. For instance, it is possible to reuse a\n  fragment of the found expression into the replacement text, do arithmetic\n  operations on found text, insert the path or filename of replaced files,\n  apply conditional operations on the replacement string (JavaScript\n  interface), manipulate dates, etc.\n\nThe GUI of Find &amp; Replace It! consists of seven panes that you can arrange in any way you want. You can dock panes side by side, arrange them in tabs, or make them float. Adjust the windows layout to the way you like to work. Find &amp; Replace It! comes with four pre-arrange layouts that can be customized the way you want depending on the size of your screen. You can switch from one layout to another in a simple click.\n\nWhat's New:\n\n* Fix potential crash when using scripts for processing the replacement\n  strings (regression since 1.4.5).\n\n* Update the Qt libraries from 4.7.3 to 4.7.4 (fixes several bugs).\n\n* Fix update of the UI when interrupting the encoding detection.\n\nSystem Requirements:\n\nIntel (64-bit) , Mac OS X 10.5.8 or later\n\n--- PLEASE SEED ---\n\n","torrent":{"xt":"urn:btih:d8ada4278d8e368a91fcd64721352e48eb063ee6","amp;dn":"Find+%26amp%3B+Replace+It%21+v.+2.0.1+%5BK%5Dracked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8ada4278d8e368a91fcd64721352e48eb063ee6","infoHashBuffer":{"type":"Buffer","data":[216,173,164,39,141,142,54,138,145,252,214,71,33,53,46,72,235,6,62,230]},"announce":[],"urlList":[]}}