{"title":"StreetMeatAsia - Sipbaat","uid":12091523,"size":884527558,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:d94a21bd2067c8f9d23605bf672ac03cc40d5d33&amp;dn=StreetMeatAsia+-+Sipbaat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ctrlme","files":1,"time":1436065834,"description":"StreetMeatAsia - Sipbaat\n\nScreenshot(s):  &lt;a href=&quot;\nhttp://imgctrl.com/image/Afo&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/Afo&lt;/a&gt; &lt;a href=&quot;\nhttp://imgctrl.com/image/Af4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/Af4&lt;/a&gt;\n\nLost in the mega city with no money, but with a gorgeous little body, well there is only one thing for a cute girl to do. So Sipbaat went to the red light district and got herself a job as a gogo dancer. She resolved that she would merely dance, and not go home with customers, so she would just be able to pay for food and room rent. The first day on the job, she was given her costume, a Brazilian thong, a cute little blouse, pink high heels and frilly socks. Wearing this costume made her feel more accessible than if she was naked, and what was worse, her boss told her not to cover up when she was on break or eating. She was a walking advert for men to come and fuck. One day, while walking to work, a kindly gentleman stopped her and asked for directions to the red light district. He was polite and charming, but quite direct. He asked how much for sex. Sipbaat knew what the other girls charged, some of them made good money, so she told him what the other girls went for. The kindly gentleman put his arm around her, and guided her to a secluded doorway. He reached down and moved her Brazilian thong to the side, unzipped himself and inserted his large penis in her small vagina, while she was still pressed up against the door. There was nothing she could do about her predicament, and nothing she wanted to do. It all seemed quite natural and expected. He pounded away for ten minutes then thrust a little money into her fist. Her told her not to complain. She was not going to anyway. As Sipbaat walked back to the gogo bar, she could feel the sperm seeping from her vagina and rubbing into the skin on the insides of her thighs. Once inside, and before she got on stage to dance, she accepted an offer from a customer to have sex in the toilet. Then she gave another customer oral sex under the table. Sipbaat had comfortably accepted her role in life, a cum dump girl.\n\nâ˜† Ctrlme Exclusive Torrent List â˜† Daily Updates &lt;a href=&quot;\nhttps://pirates-forum.org/Thread-Ctrlme-Exclusive-Torrent-List&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/Thread-Ctrlme-Exclusive-Torrent-List&lt;/a&gt;","torrent":{"xt":"urn:btih:d94a21bd2067c8f9d23605bf672ac03cc40d5d33","amp;dn":"StreetMeatAsia+-+Sipbaat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d94a21bd2067c8f9d23605bf672ac03cc40d5d33","infoHashBuffer":{"type":"Buffer","data":[217,74,33,189,32,103,200,249,210,54,5,191,103,42,192,60,196,13,93,51]},"announce":[],"urlList":[]}}