{"title":"Tia Blake And His Folk Group - Folksongs &amp; Ballads [1971] {2","uid":9516418,"size":188368485,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d99692ceffd53fdf687e1b5b9fb6cfe75a8a4202&amp;dn=Tia+Blake+And+His+Folk+Group+-+Folksongs+%26amp%3B+Ballads+%5B1971%5D+%7B2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1390530551,"description":"Tia Blake And His Folk Group - Folksongs &amp; Ballads [1971] {2012 LP MINI} (FLAC.CUE)\n\neac rip with cue log scans\n\nFolksongs &amp; Ballads is the only document of Tia Blake's short-lived stint as a folk performer. In 1970, Blake was an American teenager living in Paris who stumbled into a recording contract that resulted in a single LP of 11 public domain folk compositions. There was only one live performance in Paris to promote the album's release, and the next summer Blake left France, never to return and never to record or perform publicly again. California reissue label Water extends the original album with some rehearsal tapes, as well as three songs from 1976 recorded by the Canadian Broadcasting Company but never used, representing just about every song the artist ever put to tape in her time. With minimal orchestration of two guitars, Blake's darkly powerful voice, and the occasional flute or dobro flourish, these traditional songs are rendered either gorgeously wistful -- as on the breezy &quot;Wish I Was a Single Girl Again&quot; or the trucker's anthem &quot;Plastic Jesus&quot; -- or crushingly sad. Swinging between these extremes, the album finds a quiet gracefulness that bests some of the most successful folk albums of its time. As Blake winds her smoky voice around delicate standards, one is reminded of folkstress Karen Dalton's second album In My Own Time and its dour take on familiar popular tunes, or even ESP artist Patty Waters' fractured lens on folk dirges. The album exists in the same insular headspace as Dylan's earliest albums, and while far less extroverted and rambling than those albums (or any of the big-name folk artists that would define the genre in popular memory) Blake cultivates a world of fragile intricacy that is by turns weighty and carefree. This collection definitely falls into the &quot;lost classic&quot; category, predicting the less freaky side of freak folk songwriters like Josephine Foster, MV &amp; EE, or Devendra Banhart decades in advance, while existing in a lush stillness all its own. ","torrent":{"xt":"urn:btih:d99692ceffd53fdf687e1b5b9fb6cfe75a8a4202","amp;dn":"Tia+Blake+And+His+Folk+Group+-+Folksongs+%26amp%3B+Ballads+%5B1971%5D+%7B2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d99692ceffd53fdf687e1b5b9fb6cfe75a8a4202","infoHashBuffer":{"type":"Buffer","data":[217,150,146,206,255,213,63,223,104,126,27,91,159,182,207,231,90,138,66,2]},"announce":[],"urlList":[]}}