{"title":"Towncraft notes from a local scene  recode 2015","uid":11866501,"size":359887166,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d9e08a41a3089a956b601bdab77a5c5648c2365e&amp;dn=Towncraft+notes+from+a+local+scene++recode+2015&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"loninappleton","files":2,"time":1430370412,"description":"Towncraft: notes from a local scene (2007) a documentary on the punk scene in Little Rock Arkansas \nNew rip 2015\nMatson Films\n\nRuntime: 1:49:11\nFile size: 343 mp4\n\n[From the dvd site]\n\nMatson Films is releasing Towncraft, a book, CD and film set that documents the amazing underground music scene of Little Rock, AR over the last 2 decades.\n\nIn the late 80s and early 90s a vibrant underground music scene emerged in Little Rock. Unlike other towns, Little Rock's scene was composed almost entirely of kids. 14-18 year-olds were booking their own shows, starting record labels, opening record stores and playing with large national acts. In the process they would build a tight-knit, flourishing underground community that existed completely outside of the High School norm and was all their own. The film focuses on the roots of the Little Rock scene, how it changed the lives of those involved, the enormous DIY ethos that has shaped the scene for the past 20 years and how the scene continues to thrive as its pioneers hit their mid-30s.\n\nTowncraft will be released in theaters, on DVD and online in the May and June of 2007. A 40 band soundtrack will be released to accompany the film along with a 60 page book of stories from scene expatriates.\n\n\n[ends]\n\nMy notes\n\nI found this film in the public library close to a year after it's expected release in theaters.  Interviews include Ian McKay, Henry Rollins and other founders of what is the American punk scene. I encourage people to get this film in its full version from Mattson\nfor their libraries as well.  The package has three cds and booklet.  The second and third cds are of the bands.\n\nWriting this date of June 15th 2009, summer is half over.  The torrent is given to provide new inspiration for DIY music.  Next year I will get it out for the summer vacation and DIY season in May.\n\n---\n\nNew notes for the torrent:\n\nNew torrent made in 2015  mp4 in reduced size for easier download.\n\nEach month of May I have refreshed this torrent since 2009.  It is not active anywhere else, so please seed through the summer as you can.\n\n  Other notes:\n\n   For any that do not know already, the Swedish film &quot;We Are The Best&quot;  (&quot;Vi ar Bast!&quot; was released to theaters May 30th of 2014.  It is available on torrents as well as any translation needed.  The film is set in the 1980's punk movement of Europe.  The principals are three fourteen year old girls.  More info at IMDb and also a review at The New Statesman magazine.  No urls allowed so you'll have to look it up.\n\nNotes updated April 29th 2015","torrent":{"xt":"urn:btih:d9e08a41a3089a956b601bdab77a5c5648c2365e","amp;dn":"Towncraft+notes+from+a+local+scene++recode+2015","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9e08a41a3089a956b601bdab77a5c5648c2365e","infoHashBuffer":{"type":"Buffer","data":[217,224,138,65,163,8,154,149,107,96,27,218,183,122,92,86,72,194,54,94]},"announce":[],"urlList":[]}}