{"title":"F1.2013.Repack-z10yded","uid":9003906,"size":4819176919,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:da685f4534f3be400c0026074f5cbcfc491b53dd&amp;dn=F1.2013.Repack-z10yded&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Taker009","files":29,"time":1380997593,"description":"F1.2013.Repack-z10yded\n\nYear: 2013\nPublication Type: RePack \nTablet: {enclosing} RELOADED\nVersion: 1.0.0.904814\nLanguage:  RUS,  ENG\nSound language:  RUS,  ENG\n\nDescription: \n\nF1 2013 offers fans the attention of a virtual championship series \nof interesting innovations, a lot of improvements and - for the first \ntime in the history of the series - the classic motorsport. The game \nfeatures all the cars, drivers and tracks of the real racing season \nin 2013, in particular the famous British athlete Lewis Hamilton and \nhis &quot;Mercedes&quot; and, for the first time, a young Mexican driver Sergio \nPerez, who plays for Team McLaren Mercedes. To recreate the authentic \natmosphere of the legendary championship competition rules introduced \nappropriate changes, refined management of a virtual race car. A number \nof new features and improvements, competition on split screen multiplayer \nand network, all kinds of game modes - both new and long won \npopularity - all this makes the F1 2013 release of the most meaningful \nvirtual &quot;Formula 1&quot;.\n\nGame Features:\n\nIn F1 2013 has a mode for beginners - Young Driver Test, which is based \non real sporting events. Education is carried out on the track Yas Marina \nin Abu Dhabi. On the first day of novice pilots learn the basics of driving \ncars and viewing specific video, the second - are being tested with \nincreasing difficulty, allowing hone your skills and boost their ratings.\n\nFor the most comfortable game in F1 2013 provides the ability to save \ndirectly during the race meeting. This allows you to take a break in the \ncompetition, which takes 180 minutes and the extra time needed for the \ncompletion of the race weekend.\n\nContinuing to improve his famous EGO engine and at the same time using \nthe experience of the creators of the popular racing series DiRT and GRID, \nCodemasters team raises both technical and graphical quality of the game. \nF1 2013 looks incredibly impressive and realistic, and advanced artificial \nintelligence, provides natural behavior of virtual pilots on different \nroutes in different circumstances.\n\nThe F1 in 2013 returned to the Grand Prix mode (Grand Prix Mode), so that \nplayers can try again in the role of well-known racers and join the fight \nfor the glory of the world's best pilot in a single race, in whole or in \nspecially configured&quot; user &quot;season&quot; Formula 1 &quot;.\n\nAt full strength will earn online service RaceNet (in beta version introduced \nin F1 in 2012, there have been more than 36 million races!) - Thanks to him, \nplayers will be able to organize competitions of different scales to monitor \nthe statistics, receive updates and always be up to date, taking place in \nF1 2013. Access to RaceNet opened as a computer and home consoles, \nand on mobile devices.\n\nFinally, F1 2013 presents the classic mode, all the races which says a prominent \njournalist and host of&quot; Formula-1 &quot;Murray Walker. On two historic routes everyone\ncan compete in the skill of driving with famous drivers and teams of the 1980s. \nClassic mode supports all kinds of competitions, including the user and the \nchampionship race at the time. Can compete with the competitors an AI with \nother split screen, and in a multiplayer network.\n\n\nSystem requirements:\n\nOperating system: Windows XP (SP3), Windows Vista (SP2), Windows 7 (SP1), \n                  Windows  8 \nProcessor: Intel Core  2 Duo 2.2 GHz or AMD  Athlon II X2 2.8 GHz \nMemory: 2 GB \nVideo: Nvidia GeForce 8600 GT or ATI  Radeon  2600 XT with 512 MB \nSound device: compatible with DirectX  9.0c \nHard disk space: 8 GB\nStarting: Install and play.\n\nRepack Features:  \n\nRemoved localization besides Russian and English / no recoded \nIndependent choice of language voice and text \nAdditional content: \n1990s Pack, Classic Tracks Pack \nGame Version 1.0.0.904814 \nInstallation time ~ 7 minutes\nRepack by z10yded","torrent":{"xt":"urn:btih:da685f4534f3be400c0026074f5cbcfc491b53dd","amp;dn":"F1.2013.Repack-z10yded","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da685f4534f3be400c0026074f5cbcfc491b53dd","infoHashBuffer":{"type":"Buffer","data":[218,104,95,69,52,243,190,64,12,0,38,7,79,92,188,252,73,27,83,221]},"announce":[],"urlList":[]}}