{"title":"KISS Ultimate Vinyl Audio Collection Mick E. Gee","uid":9519751,"size":15145854174,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:db8eda30b7ba7b6012e318ffb1ef5016487af43b&amp;dn=KISS+Ultimate+Vinyl+Audio+Collection+Mick+E.+Gee&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jayandsilentbob","files":767,"time":1390604076,"description":"The Goal?\n\nTo fit all KISS audio onto one (or 2) 32gb usb stick(s) in LOSSLESS wave format (16/44100).\n\nTo find the best possible quality sources for material.\n\nTo present the material as close as possible to it's original, natural intent.\n\nTo make sure all songs are uniform in volume, left to right stereo panning perfectly even, and all tracks speed and pitch corrected.\n\nThe Ultimate Goal? THE definitve KISS audio collection.\n\nSpecial Thanks: Friedalive and Vinylhound for their amazing vinyl rips, and what I consider THE BEST and ONLY way to listen to music!\n\nA very special thanks: ALL my friends, traders and collectors and for those who helped me along the way.\n\nI've gone through every track over and over and over again. Adjusting pitch, speed, volume, panning, to\nmake this as close to the perfect and definitve KISS audio collection. For that rare person who thinks, &quot;Big deal! All you did\nwas download vinyl off the net!&quot;. WRONG! I went over every track numerous times, to assure every aspect was as perfect as possible. Most may not realize how much of a variance\nthere is from KISS album to KISS album. Most don't realize, that even on the same album, there are very noticeable fluctuations. This was not a quick, nor easy project. This wasn't about simply using waves and meters and making sure peaks were visually equal. This was about using my ear and trying to match every track sonically and in volume. Please, appreciate the effort.\n\nThe idea for this project came about 3 years ago when I was fed up with brickwalled cd's and scratched, skipping cdr's in my car, and the constant changing of discs. Now that usb ports are possible in almost every thing we use elctronically, including our vehicles, the project was a no brainer for me. With that said, I know it is not perfect. But, please enjoy.\n\nnote: bonus live tracks from YWTBYGTB are also Friedalive vinyl rips.\n\nnote: NONE of the vinyl rips have been compressed or brickwalled. They are as natural as can be All non-vinyl audio was brought down in volume\nto match the vinyls natural sound.\n\nnote: &quot;tweaked&quot; means I did some eq'ing or altering of the track.\n\nnote: You will notice the odd, minor track from the official boxset not included.\n\nnote: I've included all cover scans so generously provided by Vinylhound. Amazing and HUGE scans!\n\n\n** most recent Friedalive vinyl rip.\n\n## most recent Vinylhound rip.\n\n^^ KISS Remastered cd\n\n\n1. Wicked Lester - Every song/version &quot;tweeked&quot; for balance and performance 22 tracks\n\n2. KISS** - some tracks pitch corrected - includes &quot;tweaked&quot; demos/live tracks from boxset 18 tracks\n\n3. Hotter Than Hell** - some tracks pitch corrected - includes &quot;tweaked&quot; demos from boxset 12 tracks\n\n4. Dressed To Kill** - some tracks pitch corrected - includes &quot;tweaked&quot; demos from boxset 11 tracks\n\n5. Alive** - some tracks pitch corrected - Mick E.Gee version including &quot;tweaked&quot; bonus tracks from YWTBYGTB 19 tracks\n5. B) Alive ** some tracks pitch corrected - Includes Let Me Know from a master transfer of The King Biscuit Flower Hour 17 tracks\n\n6. Destroyer** - some tracks pitch corrected - includes &quot;tweaked&quot; demos from boxset. Also includes an instrumental version of GOT and DRC from Rock Band 14 tracks\n\n7. Rock And Roll Over** - some tracks pitch corrected - includes &quot;tweaked&quot; demos/live tracks from boxset &amp; Calling Dr. Love from Rock Band 14 tracks\n\n8. Love Gun** - some tracks pitch corrected - includes &quot;tweaked&quot; demos from boxset 11 tracks\n\n9. Alive 2** - includes Take Me from YWTBYGTB 21 tracks\n\n10.Double Platinum##- Stutter '78\n\n11.Solo Albums##-All 4 including Peter's comedy album\n\n12.Dynasty** - 9 tracks\n\n13.Unmasked** - includes &quot;tweaked&quot; demos/live tracks from boxset &amp; YWTBYGTB 14 tracks\n\n14.The Elder## - Japanese vinyl. I used Escape From The Island from the Killers rip to complete this Lp. Includes &quot;tweaked&quot; Fridays show from KISSology 14 tracks\n\n15.Killers## - 4 tracks\n\n16.Creatures Of The Night** - 9 tracks\n\n17.Lick It Up## 10 tracks\n\n18.Animalize## 9 tracks\n\n19.Asylum## 10 tracks\n\n20.Crazy Nights## - includes &quot;tweaked&quot; demos from boxset 12 tracks\n\n21.Smashes,Thrashes &amp; Hits## - includes Shocker and Shocker reprise 17 tracks\n\n22.HITS## - includes &quot;tweaked&quot; demos from boxset 16 tracks\n\n23.Revenge## - includes &quot;tweaked&quot; demos from boxset &amp; GGRARTY from Bill &amp; Ted soundtrack 14 tracks\n\n24.Alive 3^^ - new boxset version 17 tracks\n\n25.MTV Unplugged - KISSology extended dvd audio rip 19 tracks\n\n26.COS## - includes complete Outromental from Childhood's End (NOT the shitty boxset version, but the more complete version) 13 tracks\n\n27.Psycho Circus## - includes In Your Face, It's My Life, Nothing Can Keep Me From You &amp; Raise Your Glasses (demo) 14 tracks\n\n28.Psycho Circus Live ep## - includes Shout It Out Loud '96 - 7 tracks\n\n29.The Millenium Show - Mick E. Gee speed/pitch adjusted version. Also includes 2000 Man, God Of Thunder, &amp; DRC 18 tracks\n\n30.Symphony## - includes Do You Remember RnR Radio - 22 tracks\n\n31.Klassics - 15 tracks\n\n32.Sonic Boom## - Black vinyl rip 11 tracks\n\n33.Destroyer Resurrection - 24/96 audio rip. Includes matrix of both versions of Sweet Pain &amp; 2 versions of God Of Thunder remastered by ME. 14 tracks\n\n34.Monster## - Includes Right Here Right Now 13 tracks\n","torrent":{"xt":"urn:btih:db8eda30b7ba7b6012e318ffb1ef5016487af43b","amp;dn":"KISS+Ultimate+Vinyl+Audio+Collection+Mick+E.+Gee","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db8eda30b7ba7b6012e318ffb1ef5016487af43b","infoHashBuffer":{"type":"Buffer","data":[219,142,218,48,183,186,123,96,18,227,24,255,177,239,80,22,72,122,244,59]},"announce":[],"urlList":[]}}