{"title":"Idaho...You Were a Dick(2011)[FLAC]","uid":7006858,"size":202758288,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:db961b2a945779bb157002cd9ee16a492d662cb1&amp;dn=Idaho...You+Were+a+Dick%282011%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":19,"time":1328297071,"description":"\n\nYou Were a Dick [2011]Idaho Music / IDA 008-1\n\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n1. You Were a Dick (2:35)\n2. Weigh It Down (3:53)\n3. Reminder (2:56)\n4. Impaler (1:38)\n5. Structure (2:00)\n6. The Serpent &amp; the Shadow (1:07)\n7. The Happiest Girl (2:51)\n8. The Space Between (2:20)\n9. Someone to Relate to (2:41)\n10. Up the Hill (3:03)\n11. A Million Reasons (3:18)\n12. The Setting Sun (2:44)\n13. Flames (3:18)\n14. What Was That? (2:35)\n\n\n&quot;I hope you don't take it personally,&quot; Jeff Martin sings at the beginning of You Were a Dick, &quot;that I disappear like that.&quot; He turns out to be addressing a photo of an old acquaintance on a computer screen, but those words also serve to extend an olive branch to his fans. It's been six years since The Lone Gunman, a somewhat out-of-character record heavy on cinematic instrumentals. A whole decade has passed since Levitate, the last Idaho album to feature the kind of slowcore they helped to define alongside bands like Low and Red House Painters. Between Martin's journeyman status and his quiet recent years, you wouldn't be surprised to find him in an aimless experimental phase by now. But instead, this charming comeback sounds like the work of a guy who knows exactly what he's good at doing.\n\nJeff Martin and John Berry were in high school when they formed Idaho in 1992, and they soon issued their Caroline Records debut, the dark and baleful Year After Year. Over the ensuing decades, Idaho began to release their own records, and the lineup shifted around the stable center of Martin, who now goes it alone. While the laidback cadence and emotively minimalist instrumentation of You Were a Dick are vintage Idaho, Martin's angst has mellowed into a pensive melancholy with a wry twist. His vocals radiate a welcoming warmth, with just enough coarseness not to float away. No longer straining against high notes, he sings right into the grain of his natural voice, which fits the gentle recriminations and consolations of his lyrics perfectly.\n\nThe music comes over as tiny and detailed. Most songs are structured around supple webs of cleanly chiming and pedal-sculpted guitars, or simple piano phrases, lightly dressed in electronic keyboards. But Martin draws many different aspects out of these common elements, from the ramshackle elegance of &quot;Reminder&quot; to the soft pastoral glow of &quot;Structure&quot;. On the title track, what sounds like an EBow misplaced on a fret sends a shimmering buzz coursing through one of the guitar parts, imbuing its clockwork regularity with something a little nervous and wild. Martin is known for using custom tenor guitars, and in this spare context, those four strings resound like a miniature orchestra. He really lets us hear how his fingers move, with impulsive shifts in phrasing and inflection. The unique, unreplicable emotional character of each note and the snowflake-like differences between similar chords shine out in high definition.\n\nThese little loose threads keep the soothing vibe from getting monotonous, as do periodic wake-up calls like the quick-and-dirty instrumental &quot;Impaler&quot; and the booming pop-punk of &quot;The Space Between&quot;. Thanks to the internal consistency of Martin's time-honed tone, the mystical Neil Young-ish folk of &quot;Someone to Relate To&quot; can sit comfortably next to a shaggy anthem like &quot;Up the Hill&quot;. Again, he knows what he's good at. But even more importantly-- judging from this familiar yet fresh return to form-- he still believes in it, too.\n\n- Brian Howe\n \n\ncd ripped inasafeplace by EAC,cheers\n\nplease seed\n\n[url]http://dickthespic.org/about/[/url]","torrent":{"xt":"urn:btih:db961b2a945779bb157002cd9ee16a492d662cb1","amp;dn":"Idaho...You+Were+a+Dick%282011%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db961b2a945779bb157002cd9ee16a492d662cb1","infoHashBuffer":{"type":"Buffer","data":[219,150,27,42,148,87,121,187,21,112,2,205,158,225,106,73,45,102,44,177]},"announce":[],"urlList":[]}}