{"title":"Solar Light Transmissions - Thaddeus Music by Sanaya Roman","uid":4190085,"size":167624090,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dbe2a62798efff81129680c15a4e6aa146d3551e&amp;dn=Solar+Light+Transmissions+-+Thaddeus+Music+by+Sanaya+Roman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"iloveabrahamhicks","files":4,"time":1210897411,"description":"Solar Light Transmissions\nThis music is melodic and uplifting. It uses angelic voices, harp, strings, piano, and other sounds to bring you the transformative Solar light.\n\nThis soothing, relaxing music that will expand your consciousness and relax your body as you listen. Each album has approximately 2 hours of music and is ideal for meditation, healing, relaxation, and for pure listening enjoyment. \n\nThis music has been created by Thaddeus to assist you in receiving energy from the Solar light, the sun of the soul plane that your soul exists on.  Working with Solar light can transform your being, your life, your relationships, and your physical body. \n\nSide 1 The Master of Light\nThis music calls forth the Master of Light. He is a perfected Being who has ascended to higher dimensions. Imagine as you listen that this Master appears in front of you as a radiant light. Experience the incredible love, bliss, peace, and expansion of consciousness that is possible as you sit in the light of this Master. This music is inspirational, calming, and very uplifting.\n\nSide 2 Solar Light Transmissions\nAs you listen, the Master of Light transmits Solar light to you. He builds lines of light around your head, preparing you to link with your soul&amp;#039;s mind to receive soul impressions and guidance. Gold and white angels join Him to bring you Solar light. This music is orchestral with strings.\n\nSide 3 Raising Cellular Light\nThaddeus summons the violet angels to work with you for cellular transformation, and the yellow angels to build a finer nervous system that can handle more light. The rose angels join you to add Solar light to your heart and circulatory system, and the deep blue angels heal whatever needs healing. Sense these angelic beings as they revitalize you by increasing the Solar light in your cells. This music is sparkling, twinkling, happy music.\n\nSide 4 Songs of the One?Suite I\nLet yourself be drawn up into the Solar light, into oneness. Many tones and sounds are transmitted to you by the beings here to awaken your crown center, your center of enlightenment. You join into union with the One, blending your will with the Higher Will, and merging with the Universal Mind. This music is &quot;space music&quot; that will take you traveling into higher dimensions.\n &lt;a href=&quot;\nhttp://www.orindaben.com/music/listenrm.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.orindaben.com/music/listenrm.php&lt;/a&gt;","torrent":{"xt":"urn:btih:dbe2a62798efff81129680c15a4e6aa146d3551e","amp;dn":"Solar+Light+Transmissions+-+Thaddeus+Music+by+Sanaya+Roman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbe2a62798efff81129680c15a4e6aa146d3551e","infoHashBuffer":{"type":"Buffer","data":[219,226,166,39,152,239,255,129,18,150,128,193,90,78,106,161,70,211,85,30]},"announce":[],"urlList":[]}}