{"title":"American Experience - Hijacked","uid":10489736,"size":485801188,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:dbfd8357a4c3dfa3491fccb7b5569acd45094517&amp;dn=American+Experience+-+Hijacked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":-1,"time":1404527339,"description":"American Experience - Hijacked\n\nFormat                                   : Matroska\nFormat version                           : Version 2\nFile size                                : 463 MiB\nDuration                                 : 55mn 30s\nOverall bit rate                         : 1 167 Kbps\nNominal bit rate                         : 1 000 Kbps\nWidth                                    : 718 pixels\nHeight                                   : 480 pixels\nDisplay aspect ratio                     : 16:9\nFrame rate                               : 29.970 fps\nColor space                              : YUV\nChroma subsampling                       : 4:2:0\nBit depth                                : 8 bits\nScan type                                : Progressive\nBits/(Pixel*Frame)                       : 0.097\nWriting library                          : x264 core 120\n &lt;a href=&quot;\nhttp://image.bayimg.com/567f9d99e5e8eda496a47300a22ce0ba6f2a8664.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/567f9d99e5e8eda496a47300a22ce0ba6f2a8664.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0774723/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0774723/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.pbs.org/wgbh/amex/hijacked/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pbs.org/wgbh/amex/hijacked/&lt;/a&gt;\n\nThirty-six years ago a new era in global terrorism was born. Just moments after lift-off on the morning of September 6, 1970, passengers on TWA's flight 74 from Frankfurt to New York were startled to hear an announcement over the plane's PA system: &quot;This is your new captain speaking. This flight has been taken over by the Popular Front for the Liberation of Palestine.&quot; Minutes later, travelers on another New York-bound plane, Swissair Flight 100, faced the same chilling reality.\n\nFeaturing first-hand recollections from former hostages, flight crews, and their captors, Hijacked, an hour-long documentary from award-winning producer Ilan Ziv, tells the story of what would be known for more than three decades as the blackest day in aviation history. &quot;We now understand that the coordinated attacks by the P.F.L.P. marked the birth of a new era,&quot; says Ziv.\n\nThat Sunday morning, a handful of hijackers, armed with deadly weapons, arrived at European airports ready to set in motion a plan to seize three US-bound passenger planes, divert them to a remote landing strip in the Jordanian desert, and use the passengers and crews to bargain for the release of Palestinian militants held in Europe and Israel. The elaborate scheme was the brainchild of a small guerrilla group called the Popular Front for the Liberation of Palestine.\n\nOver the next three days, two additional planes would be commandeered. The hijackers were determined to attract attention to the Palestinian cause and sabotage a US-sponsored peace plan whose goal was to reduce tensions among Egypt, Israel and Jordan. The proposed peace plan did not address the Palestinian plight.\n\nOf the five planes, only three would make it to the isolated landing strip, dubbed &quot;Revolution Airport.&quot; The first of the other two, Pan Am Flight 93, was diverted to Cairo, where it exploded just moments after flight director John Ferruggio evacuated his passengers and crew. The second, El Al Flight 219, landed safely in London, where one hijacker, 30-year-old Leila Khaled, was promptly arrested. Another, San Francisco native Patrick Arguello, had been shot and killed by the airline's security officers.\n\n&quot;Most of the people on the plane[s] were Americans,&quot; recalls CBS News correspondent Marvin Kalb in the film. &quot;This was America's introduction to global terrorism.&quot;\n\nThe hijackers told the hostages that they would be killed unless the governments of Great Britain, Switzerland, West Germany and Israel agreed to release Palestinian prisoners. Over the course of a tense week, the hostages were released in small groups -- women and children were separated from the men, and Jewish passengers were singled out. &quot;I was told that I was no longer a hostage,&quot; recalls Barbara Mensch, who was sixteen at the time of the hijacking. &quot;I was now a political prisoner, and that unless my country did something, I was going to be a political prisoner, I don't know, forever.&quot;\n\nThe White House faced a dual crisis: a hostage situation with hundreds of American lives at stake and a pro-American Jordanian government on the brink of collapse. The nightmare was captured by an attentive world media that had camped out in the desert and voraciously sought any new information on the terrorist stunt. The ordeal lasted for six tension-filled days before the remaining hostages were removed from the planes and the P.F.L.P. spectacularly blew up the three aircraft in the desert.\n\n&quot;This story reminds us that the events that shape American history do not always take place within our borders,&quot; says American Experience executive producer Mark Samels. &quot;The hijacked planes in the Jordanian desert terrorized the world and served as a wake up call that citizens of any nation can be used as pawns in the struggle to advance a political cause.&quot;","torrent":{"xt":"urn:btih:dbfd8357a4c3dfa3491fccb7b5569acd45094517","amp;dn":"American+Experience+-+Hijacked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbfd8357a4c3dfa3491fccb7b5569acd45094517","infoHashBuffer":{"type":"Buffer","data":[219,253,131,87,164,195,223,163,73,31,204,183,181,86,154,205,69,9,69,23]},"announce":[],"urlList":[]}}