{"title":"No Neck Blues Band &amp; Embryo","uid":6371207,"size":69983591,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:de8588866604e9baf962cd5b81b52fae79111a33&amp;dn=No+Neck+Blues+Band+%26+Embryo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nuovonadrachal","files":7,"time":1304642909,"description":"Format: Mp3\n\nAt first glance this improvisational summit meeting between No Neck Blues Band and Embryo seems a curious and unlikely match, but the same could probably be said for any collaboration involving either of these two iconoclastic outfits. NNCK are one of NYC's most shadowy and studiously enigmatic free-sound collectives, while the Munich-based Embryo is a long-running Krautrock group whose music is a stylish blend of jazz, space rock, and pan-ethnic rhythms. Founded by percussionist Christian Burchard after he left Amon DÃƒÂ¼ÃƒÂ¼l II in 1969, Embryo have released more than 20 albums in various incarnations over their 35-year existence.\n\nYet despite their radical differences in strategy and approach, these two ensembles share more in common than it might initially appear. Both groups diligently shun categorization, drawing upon whatever stray traces of free jazz, psychedelia, ethnic folk, or Martian blues that happen to capture their fancy, while maintaining a decidedly liberal attitude towards possible instrumentation. Moreover, both units are clearly guided by the same dogged devotion to spontaneous invention, and it's this sheer undisguised enthusiasm for joint exploration that enables EmbryoNNCK to so accurately capture the dazzling midpoint between their two softly-colliding galaxies.","torrent":{"xt":"urn:btih:de8588866604e9baf962cd5b81b52fae79111a33","amp;dn":"No+Neck+Blues+Band+%26+Embryo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de8588866604e9baf962cd5b81b52fae79111a33","infoHashBuffer":{"type":"Buffer","data":[222,133,136,134,102,4,233,186,249,98,205,91,129,181,47,174,121,17,26,51]},"announce":[],"urlList":[]}}