{"title":"Debian Testing XFCE Edition (amd64) (cd size) 2/22/13","uid":8177544,"size":675282944,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:de8c53b2c8fac0ed16bbacb757d873212671fcf7&amp;dn=Debian+Testing+XFCE+Edition+%28amd64%29+%28cd+size%29+2%2F22%2F13&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ghostsquad57","files":-1,"time":1361560158,"description":"The Debian Project is an association of individuals who have made common cause to create a free operating system. This operating system is called Debian GNU/Linux, or simply Debian for short. Debian systems currently use the Linux kernel. Linux is a completely free piece of software started by Linus Torvalds and supported by thousands of programmers worldwide. Of course, the thing that people want is application software: programs to help them get what they want to do done, from editing documents to running a business to playing games to writing more software. Debian comes with over 20,000 packages (precompiled software that is bundled up in a nice format for easy installation on your machine) - all of it free. It's a bit like a tower. At the base is the kernel. On top of that are all the basic tools. Next is all the software that you run on the computer. At the top of the tower is Debian -- carefully organizing and fitting everything so it all works together.\n\nThis version comes with the XFCE Desktop Environment. ","torrent":{"xt":"urn:btih:de8c53b2c8fac0ed16bbacb757d873212671fcf7","amp;dn":"Debian+Testing+XFCE+Edition+%28amd64%29+%28cd+size%29+2%2F22%2F13","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de8c53b2c8fac0ed16bbacb757d873212671fcf7","infoHashBuffer":{"type":"Buffer","data":[222,140,83,178,200,250,192,237,22,187,172,183,87,216,115,33,38,113,252,247]},"announce":[],"urlList":[]}}