{"title":"Dio - Intermission (resequenced &amp; expanded by }{eywood)","uid":9168003,"size":440040847,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:df02c0266e7e7d4e8641b28707137d83cdc9c66b&amp;dn=Dio+-+Intermission+%28resequenced+%26amp%3B+expanded+by+%7D%7Beywood%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"}{eywood","files":18,"time":1384019906,"description":"Intermission is a live EP that Dio put out that included one new studio track, Time To Burn, which was Craig Goldie's debut as Dio's guitarist.  The song Hide In The Rainbow was also recorded at this time and it is now included here.  Also a live version of Hungry For Heaven that appeared on the Hear 'N' Aid album that was recorded at the same show. As a bonus I've included both the album version and the single edit of Stars from the Hear'N' Aid project.  Along with this album, this song was among the last things done by Vivian Campbell with the Dio band.\n\nAs an added bonus I've put together an additional extended mix of Stars.  This is made from the video &quot;the Making of Hear 'N' Aid&quot; and includes the longer takes of many of the guitar solos and different vocal performances.  The majority of these recordings were done with the camera mics in the control room with the monitor mix coming through the speakers, so they don't have the sound quality of the actual mixed track.  On top of that the sound is off an .avi file of the video because I never came across an actual good copy.  So the sound is pretty lossy, but it wasn't all that great in the first place.  I only did this for kicks, mostly because I wanted Geoff tate, Kevin Dubrow and Rob Halford's performances to be more prominent in the song (Dave Meneketi just gets to be there because he got lucky), not to mention Yngwie's solo.  Because it is lossy and not that good sounding in the first place you really shouldn't consider it an official part of this record, just a throw-in for the hell of it.  I have come across a lossly encoded version of the video, but have yet to get around to remaking the track.\n\n\n01 King Of Rock And Roll\n02 Rainbow In The Dark\n03 Sacred Heart\n04 Hungry For Heaven\n05 Rock 'n' Roll Children\n06 Long Live Rock 'n' Roll\n07 Man On The Silver Mountain\n08 Rock 'n' Roll Children (reprise)\n09 We Rock\n10 Time To Burn\n11 Hide In The Rainbow\n12 Stars (full version)\n13 Stars (single edit)\n\n\n14 Stars (}{eywood's super extended version)\n\n\n","torrent":{"xt":"urn:btih:df02c0266e7e7d4e8641b28707137d83cdc9c66b","amp;dn":"Dio+-+Intermission+%28resequenced+%26amp%3B+expanded+by+%7D%7Beywood%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df02c0266e7e7d4e8641b28707137d83cdc9c66b","infoHashBuffer":{"type":"Buffer","data":[223,2,192,38,110,126,125,78,134,65,178,135,7,19,125,131,205,201,198,107]},"announce":[],"urlList":[]}}