{"title":"The Fatima Mansions - Lost in the Former West [1994]","uid":9652355,"size":383435352,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:df3a9efa584b8911e33b6e1f6a5d268f74d0dddf&amp;dn=The+Fatima+Mansions+-+Lost+in+the+Former+West+%5B1994%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1393098295,"description":"Review by Ned Raggett  [-]\nThe final Mansions album almost snuck out instead of being released, with sessions split between regular producer Ralph Jezzard and ex-Talking Heads studio hound Jerry Harrison. Adding to the band's confused discographical tangle, two Valhalla Avenue cuts were appended to the American issue of the album, which still went next to nowhere in terms of any level of attention. A pity, because while the Mansions essentially hadn't changed much beyond its initial mode of feedback-heavy aggro and perversely calm adult-entertainment numbers, the overall performances on Lost were some of the band's best. Coughlan remains the central figure, writing everything with one notable exception and singing with the expected gusto, while his main collaborator O Gruama adds some scraggly, nervous guitar parts to his usual arsenal of amped-up rage. With most of the regular Mansions crew along for the ride, along with some guest performers here and there, the band set out with murder on its mind and specific targets in its sights. &quot;Popemobile to Paraguay&quot; starts with all the bile that an ex-Catholic Irishman could be expected to bring to bear -- by the time it's all over, American foreign policy idiocies and the leftover impact of the Cold War are but two of the other issues addressed with Coughlan's usual bile. If the album was nothing but lectures there'd be little point, but the music is always the winning edge to the Mansions' brew, whether the spooked-out mood into mayhem of &quot;Walk in the Woods&quot; or the calmer &quot;Walk Yr Way.&quot; The one non-Coughlan number might have been an inevitable thing for the Mansions to do -- a cover of Scott Walker's shimmering paranoid classic &quot;Nite Flights,&quot; here given just enough extra bite while Coughlan delivers a vocal worthy of his hero. (3/5)","torrent":{"xt":"urn:btih:df3a9efa584b8911e33b6e1f6a5d268f74d0dddf","amp;dn":"The+Fatima+Mansions+-+Lost+in+the+Former+West+%5B1994%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df3a9efa584b8911e33b6e1f6a5d268f74d0dddf","infoHashBuffer":{"type":"Buffer","data":[223,58,158,250,88,75,137,17,227,59,110,31,106,93,38,143,116,208,221,223]},"announce":[],"urlList":[]}}