{"title":"March 2013 Best Android APK Games and Apps","uid":8339852,"size":4063336101,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:df9ae890e54d7197216efb8c928e05001960c3bd&amp;dn=March+2013+Best+Android+APK+Games+and+Apps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dSeeder","files":-1,"time":1365071145,"description":"So, here it is.. After the huge success of the February archive (http://thepiratebay.se/torrent/8217804/February_2013_Best_Android_APK_Games_and_Apps) , i finally compiled and release the best apk apps and games pack for March. Hooff.. It's a quite long story.. :)\n\nAs you guys asked me to separate the games from apps, i did that. Though i did my best to sort things up, but for the huge number of contents i had to manage, some games and apps might be mixed up. I'm sorry if that happen.\n\nAs you know i do not just only upload paid games and apps, i also look in the market for the best. So here are a good number of free apps which i found great to play with and some of them are really missed your eyes for sure. FREE apps/games can be in PREMIUM quality and they often really crosses that limit. So check them, if you want any paid application, let me know, i will try my best to buy it for you and if you have some extra money then please go buy one. Developers really need your support to continue the development. Just some words, please don't mind.\n\nAnd at the end, i can guarantee you that all files here are totally safe and 100% virus free as my test. If you are a regular apk downloader from various file sharing sites make it sure they are virus and malware free. A infected app can steal everything from your device including personal information, files, passwords and even credit/debit card numbers. We respect your privacy. Stay safe.\n\nSo it's enough for now. Enjoy and stay tuned for the next release. :)","torrent":{"xt":"urn:btih:df9ae890e54d7197216efb8c928e05001960c3bd","amp;dn":"March+2013+Best+Android+APK+Games+and+Apps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df9ae890e54d7197216efb8c928e05001960c3bd","infoHashBuffer":{"type":"Buffer","data":[223,154,232,144,229,77,113,151,33,110,251,140,146,142,5,0,25,96,195,189]},"announce":[],"urlList":[]}}