{"title":"Kisses - Kids in LA (2013) [FLAC]","uid":8614026,"size":255671867,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dfc62d7327321d5ecae04c5ae5508721e213664f&amp;dn=Kisses+-+Kids+in+LA+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1372208765,"description":"\n  Kisses - Kids in LA (2013) [FLAC]\n\n  * Genre: Pop/Rock\n  * Styles: Indie Rock, Indie Electronic, Alternative Dance\n  * Source: CD (log + cue)\n  * Codec: FLAC\n  * Bit Rate: ~ 900 kbps\n  * Bit Depth: 16\n  * Sampling Rate: 44,100 Hz\n\n  Tracks\n\n  * 01 Up All Night\n  * 02 The Hardest Part\n  * 03 Huddle\n  * 04 At The Pool\n  * 05 Funny Heartbeat\n  * 06 Air Conditioning\n  * 07 Having Friends Over\n  * 08 Bruins\n  * 09 Adjust Glasses\n\n  Album Review\n\n  * Kisses' first album, the lo-fi, home recorded-sounding The Heart of the Nightlife, was inspired by Jesse Kivel's friendship with disco maestro Alec R. Costandinos and the time they spent together listening to old disco records. On Kisses' second album, the much colder and more '80s-inspired Kids in L.A., it would seem that Kivel, his musical partner Zinzi Edmundson, and producers Pete Wiggs (of Saint Etienne) and Tim Laracombe, spent time hanging out with Peter Hook, the guys in OMD, and Afrika Bambaataa. New Order-style basslines are all over the album, the synths are very cold and &quot;synth pop,&quot; and many of the beats are booming in the way that Bambaataa's were, especially on the uptempo tracks. The change gives the album a darker, more introspective feel, with Kivel's songs and much improved voice delivering some pathos that was missing from their debut. He sounds much less like a whimsical Jens Lekman-esque guy reclining poolside and more like someone digging a little deeper into difficult stuff. \n\n  * It's a welcome change all around, as Wiggs and Laracombe add some sonic depth to the sound without paving over the delicate arrangements, Edmundson's keyboards sound more varied, and the songs overall are just as strong, if not maybe a little catchier than those on the debut. The bouncy &quot;Funny Heartbeat&quot; sure sounds like a hit, and the rest aren't far behind. They do a really nice job on the soul deep ballads like &quot;At the Pool&quot; and the aching, John Hughes-y &quot;Bruins&quot; too. It's also nice hearing the duo explore new avenues as on the Edmundson-sung hip-hop ballad &quot;Adjust Glasses.&quot; The overall sound at times can be a little too slick, but not to the point of distraction, and the shiny, neon bright tone fits well with the tales of privileged L.A. nostalgia that Kivel's lyrics detail. Taking a step away from their homespun beginnings into something more real could have gone all wrong, but Kids in L.A. proves that Kisses have what it takes to bring their songs and sound out of the bedroom and into the real world.","torrent":{"xt":"urn:btih:dfc62d7327321d5ecae04c5ae5508721e213664f","amp;dn":"Kisses+-+Kids+in+LA+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfc62d7327321d5ecae04c5ae5508721e213664f","infoHashBuffer":{"type":"Buffer","data":[223,198,45,115,39,50,29,94,202,224,76,90,229,80,135,33,226,19,102,79]},"announce":[],"urlList":[]}}