{"title":"Life of Pi [Illustrated] - Yann Martel.epub","uid":9360005,"size":3629584,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e00493064eee993602124fbd1c86b03b6dfda302&amp;dn=Life+of+Pi+%5BIllustrated%5D+-+Yann+Martel.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1387294272,"description":"Pi Patel is an unusual boy. The son of a zookeeper, he has an encyclopedic knowledge of animal behavior, a fervent love of stories, and practices not only his native Hinduism, but also Christianity and Islam. When Pi is sixteen, his family emigrates from India to North America aboard a Japanese cargo ship, along with their zoo animals bound for new homes.\n\nThe ship sinks. Pi finds himself alone in a lifeboat, his only companions a hyena, an orangutan, a wounded zebra, and Richard Parker, a 450-pound Bengal tiger. Soon the tiger has dispatched all but Pi, whose fear, knowledge, and cunning allow him to coexist with Richard Parker for 227 days lost at sea. When they finally reach the coast of Mexico, Richard Parker flees to the jungle, never to be seen again. The Japanese authorities who interrogate Pi refuse to believe his story and press him to tell them &quot;the truth.&quot; After hours of coercion, Pi tells a second story, a story much less fantastical, much more conventional-but is it more true?\n\nLife of Pi is at once a realistic, rousing adventure and a meta-tale of survival that explores the redemptive power of storytelling and the transformative nature of fiction. It's a story, as one character puts it, to make you believe in God.","torrent":{"xt":"urn:btih:e00493064eee993602124fbd1c86b03b6dfda302","amp;dn":"Life+of+Pi+%5BIllustrated%5D+-+Yann+Martel.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e00493064eee993602124fbd1c86b03b6dfda302","infoHashBuffer":{"type":"Buffer","data":[224,4,147,6,78,238,153,54,2,18,79,189,28,134,176,59,109,253,163,2]},"announce":[],"urlList":[]}}