{"title":"Clint Eastwood Collection The Outlaw Josey Wales (1976)(multi) 2","uid":5631877,"size":8438572958,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e0054c9202eace4d41f67ac4a34a5d5aaa6fe30a&amp;dn=Clint+Eastwood+Collection+The+Outlaw+Josey+Wales+%281976%29%28multi%29+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pioen","files":13,"time":1276716286,"description":"Clint Eastwood Collection - The Outlaw Josey Wales (1976)       \n\n \nVerenigde Staten\nWestern\n136 minuten\n\ngeregisseerd door Clint Eastwood\nmet Clint Eastwood, Chief Dan George en Sondra Locke\n\nTijdens de Amerikaanse Burgeroorlog zaaien bendes dood en verderf in het Wilde Westen. Het rustige leventje van Josey Wales, een landbouwer uit Missouri, wordt plots totaal verwoest, wanneer een bende guerrilla's zijn echtgenote en zoontje vermoorden. Terrill, de leider van de bende, laat Josey voor dood achter maar hij overleeft de slachtpartij. Hij sluit zich aan bij de rebellenleider Fletcher. Voortaan heeft hij maar ÃƒÂ©ÃƒÂ©n levensdoel: wraak nemen. Aan het einde van de burgeroorlog wordt aan de guerrilla's amnestie verleend. Fletcher en zijn mannen geven zich aan. Alleen Josey weigert dit te doen.\n\nEnglish\n\nJosey Wales is a peaceful farmer in the days near the end of the Civil War. After his home is burned and his family murdered, he hardens into a human bullet - dedicated to destroying the renegades who took his &quot;life.&quot; He joins a band of unreconstructed rebel guerilla fighters who continue to fight the Union - even after the official surrender of the Confederacy - an action which makes them, legally, outlaws. Josey is driven by vengeance, but after a while, that's not enough. Back before his own personal Holocaust, he had been a builder - of home, family, farm, and life. And no matter how much ice he's wrapped himself in, down inside there's still the soul of a living man. While Wales exists, he's pulled by this hidden yearning to Live. Each day offers him chances to remember, to assuage his yearning, to begin again. And the movie shows us how Josey Wales - a mere seeker of vengeance - learns to live again, rededicated to the values he chose so long ago. \n\nCategorie : Beeld \nFormaat : DVD9 \nBron : Retail\n \nAudio :  English, French, Italian, \nSubs  : English, French, Italian, Dutch, Arabic, Spanish, Portuguese, German, Roma\n\n \nGenre : Actie\nWestern\n \nWeblink : &lt;a href=&quot; http://www.moviemeter.nl/film/1136&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.moviemeter.nl/film/1136&lt;/a&gt;\nWeblink : &lt;a href=&quot; http://www.imdb.com/title/tt0075029&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0075029&lt;/a&gt;\n\n*****************************************\n\nBrought to you by \nPioen\n\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n\n\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n","torrent":{"xt":"urn:btih:e0054c9202eace4d41f67ac4a34a5d5aaa6fe30a","amp;dn":"Clint+Eastwood+Collection+The+Outlaw+Josey+Wales+%281976%29%28multi%29+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0054c9202eace4d41f67ac4a34a5d5aaa6fe30a","infoHashBuffer":{"type":"Buffer","data":[224,5,76,146,2,234,206,77,65,246,122,196,163,74,93,90,170,111,227,10]},"announce":[],"urlList":[]}}