{"title":"On The Ice OST soundtrack iZler 320kbps mp3","uid":7487371,"size":91567358,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e1ac2fe094e6668e51d6fc6c8ca1b451042b4e83&amp;dn=On+The+Ice+OST+soundtrack+iZler+320kbps+mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"piggsy","files":15,"time":1343636490,"description":"Beautiful OST from iZler. Please support the movie and the artist if you like this. Enjoy.\n____\nimdb review:\nThis film is a triumph of Alaskan narrative filmmaking. Showing Alaskan Natives as they really live, including old traditions, dance, and hunting, next to cell phones, hip hop, and drugs. It doesn't get tied up on trying to show the beauty of Alaska, and neither the exoticness of it's peoples. Instead, it uses them to further it's themes and plot. Incredibly sensitive, honest, and entertaining.\n\nWhile it's easy to say this is a movie about the evils of drugs, or the ability of the arctic landscape to drive one to insanity, the film gracefully dodges such easy targets and focuses on a story about a young man trying to grow up and a community dealing with a tragedy, which are much more open ended, accessible ideas. This allows those without any knowledge of Native Alaskans, or Alaska even, to become entranced by the story.\n\nDon't let the non-pro cast turn you away, either. It is all native persons (no Asians pretending to native American), and the direction makes sure they're up to snuff to all other films by mature filmmakers.","torrent":{"xt":"urn:btih:e1ac2fe094e6668e51d6fc6c8ca1b451042b4e83","amp;dn":"On+The+Ice+OST+soundtrack+iZler+320kbps+mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1ac2fe094e6668e51d6fc6c8ca1b451042b4e83","infoHashBuffer":{"type":"Buffer","data":[225,172,47,224,148,230,102,142,81,214,252,108,140,161,180,81,4,43,78,131]},"announce":[],"urlList":[]}}