{"title":"Die_Antwoord-SOS-2010-DOH","uid":5863819,"size":73262358,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e30c602c1af145a48e795c5466bc06012530235e&amp;dn=Die_Antwoord-SOS-2010-DOH&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MAFIAA.","files":13,"time":1286066855,"description":"Release Date.: 2010-10-02\nStore Date...: 2010-10-11\nSource.......: CD\nStyle........: Hip-Hop\nRecord Label.: Interscope Records\nCat Nr\nEncoder......: Lame 3.97 (-V2 --vbr-new\nQuality......: 174kbps avg / 44.1KHz / Joint Stereo\n\n1. In Your Face                                        4:29\n2. Enter The Ninja                                    5:07\n3. Wat Kyk Jy?                                        4:36\n4. Evil Boy                                            4:30\n5. Rich Bitch                                          3:32\n6. Fish Paste                                          4:17\n7. copie                                              3:12\n8. Beat Boy                                            8:20\n9. She Makes Me a Killer                              7:29\n10.Doos Dronk                                        12:52\n\nRelease notes\n\nNINJA didn't do very good at school because all he did the whole time was write\nraps and smoke zol. After NINJA lied and cheated his way through high school, he\nmoved to Alexandra Township in Johannesburg to smoke zol with the rastas. NINJA\nstayed in Alexandra in 19th Street down by the river for a few years living off\nboiled cabbage and zol. During this time NINJA started a rap group called The\nOriginal Evergreens which had a heavy stoned alien rastas in space vibe. The\nOriginal Evergreen even won a South African Music Award for this one fokken\nstupid stoner song called Puff The Magik\n\nAfter NINJA moved out of Alex he moved around a lot lamming from couch to couch\nand bumming off people while he tried to think of more stoned rap ideas\n\nFrom time to time NINJA moved back home to his mom and dad's house for a nice\nhot shower and some lekker munchies\n\nNINJA has known YO-LANDI VIER for a very long time from when she was a little\nlaaitie. One day when NINJA moved back home with his mom &amp; dad again he saw that\nlittle YO-LANDI from next door had grown some boobs and a nice bum. Then NINJA\nhad a baby with YO-LANDI by accident\nNINJA and YO-LANDI are not married. They are just good friends. YO-LANDI likes\nto do her own thing and doesn't like people telling her what to do\n\nSmoking so much weed all the time made NINJA think of all these stupid ideas for\nrap groups like fokken Max Normal, Constructus, Markus Wormstorm Is Not Gay, MC\nTotally Rad and DJ Fuk are FuknRad, The Way of the Dassie, Total Confusion on\nPlanet Phunk, Total Fuk Up etc etc. NINJA even got so stoned one day that he\nstarted to make cute little soft toys with magic powers. NINJA forced YO-LANDI\nto help him make hundreds of these fokken toys by hand to try get some money to\nbuy diapers. None of NINJA'S stoned ideas ever blew up, so time after time he\nwould throw them in the trash and try again\n\nNINJA'S name used to be Waddy Jones. One day Waddy Jones did something really\nfokken stupid. Like a total fokken doos, Waddy dressed in full military\ncamouflage and took a djembe drum and a big sack of weed with him to a Legalize\nMarajuana protest outside the steps of parliament in Cape Town. Waddy arrived at\nthe Legalize Marajuana protest early to get a good seat. The police had even\nmade a nice little fence around the area where all the irie protestors could\nsit. Waddy was rolling himself a lekker duk zol as the other irie protestors\nslowly started pulling into the little fenced area to make their protest. About\n20 irie protestors pitched up including the organizer of the protest who had\neven brought along a big weed plant to give to Nelson Mandela as a present. Then\nall-of-a-sudden 5 big armour-plated Caspers pulled in filled with about 100\nfokken cops who arrested Waddy Jones and all the other irie protestors sitting\ninside the little fence. When Waddy got out of jail, he changed his name to\nNINJA and suddenly got much better at rapping\n\nSoon after this NINJA went to go visit his homeboy DJ HI-TEK who makes fat\ngangta rap beats on his PC Computer in his bedroom. DJ HI-TEK had also got much\nbetter at making beats while NINJA was in jail. So NINJA and DJ HI-TEK joined\nforces and tried think of a spif name for their new zef gangta rap group they\nwere going to start. DJ HI-TEK got the idea to get a sexy chick to join the\ngroup to make it more commercial. So NINJA started to train little YO-LANDI\nVIER to rap. During her ninja rap training YO-LANDI got the idea to add some\nrave vibes to their tjoons make their zef rap group more even more next level\n\nNINJA, YO-LANDI and DJ HI-TEK discovered DIE ANTWOORD when their 3rd eyes got\nopened at this rave they threw at NINJA'S parent's house this one time when\nNINJA'S parents went on holiday to Sun City. The whole experience was so fokken\nnext level that they are even making a movie about it called THE ANSWER. You are\nsoon going to be able to go watch THE ANSWER on the big screen with popcorn,\nCoke and M&amp;M'S and maybe even a free NINJA, YO-LANDI VIER or DJ HI-TEK toy\n\nDJ HI-TEK is scared of flying, and so he doesn't always perform live with DIE\nANTWOORD. Luckily DJ HI-TEK'S little cousin, VUILGEBOOST aka HI-TEK JUNIOR has\nsome serious DJ skillz and so when DJ HI-TEK is not in the mix, VUILGEBOOST\nfreaks the beats live with DIE ANTWOORD zef rap-rave crew\n\nNINJA'S name is NINJA. If you see NINJA in the streets act like you know. Don't\nact like a poes and call him some other name\n\nDJ HI-TEK has just broken up with his girlfriend again. The man is single and\nready to mingle so if you see HI-TEK in da club come give him a hug\n\nYO-LANDI VIER'S rat recently had 10 babies. They are all growing up so fast\n\nWhether you like it or not DIE ANTWOORD are here to stay. They are about to drop\ntheir 1st album called O on Interscope fokken Records, then their 2nd album\ncalled TENION, then their 3rd album, then their 4th album and then their 5th\nalbum. Full fokken flex Fre Mega-zef\nGo In your fokken face btch\n\nEnjoy\n\nInfo\n\nLike it? Buy it Dont forget to support the artists","torrent":{"xt":"urn:btih:e30c602c1af145a48e795c5466bc06012530235e","amp;dn":"Die_Antwoord-SOS-2010-DOH","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e30c602c1af145a48e795c5466bc06012530235e","infoHashBuffer":{"type":"Buffer","data":[227,12,96,44,26,241,69,164,142,121,92,84,102,188,6,1,37,48,35,94]},"announce":[],"urlList":[]}}