{"title":"Metallica - Frantic [promo].VOB","uid":9932166,"size":176572416,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e3dd940c768ea2868644b91803d903907741a097&amp;dn=Metallica+-+Frantic+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1397117017,"description":"Metallica - Frantic [promo].VOB\n\n\nHQ rare promo music video from a promo DVD. &quot;Frantic&quot; is a song by American heavy metal band Metallica off their 2003 album St. Anger.\n\nThis song, like many others on St. Anger, is about the band's past struggles with addictions, particularly lead singer James Hetfield's alcohol problem, for which he spent many months in rehab. The lyrics also draw on zen axioms, most notably the Buddhist concept of dukkha brought up by Kirk Hammett: &quot;Birth is pain. Life is pain. Death is pain.&quot;\n\nA music video, directed by Wayne Isham, was made to go along with Frantic's release as a single. The video, featuring a shortened version of the song, depicts a man looking back on his life (in which he is constantly drinking, having sex, and smoking) at the instant that he crashes his rotisserie delivery pickup truck into an RV at an intersection. At the end of the video, and although the man's vehicle is upside-down, he finds himself still alive, and laughs loudly until a 4Ã—4 car that goes towards the car crashes it in the window where he is located. The video was shot in Montreal, Canada.\n\nMetallica is an American heavy metal band from Los Angeles, California. The band's fast tempos, instrumentals, and aggressive musicianship placed them as one of the founding &quot;big four&quot; of thrash metal alongside Slayer, Megadeth, and Anthrax. Metallica was formed in 1981 when James Hetfield responded to an advertisement that drummer Lars Ulrich had posted in a local newspaper. The current line-up features founders Hetfield (vocals, rhythm guitar) and Ulrich (drums), longtime lead guitarist Kirk Hammett and bassist Robert Trujillo, who joined the band in 2003. Previous members of the band are lead guitarist Dave Mustaine, who went on to found Megadeth, bassists Ron McGovney (demos only), Cliff Burton (the first three records, died in 1986), and Jason Newsted. The band also had a long collaboration with producer Bob Rock, who produced all of its albums from 1990 to 2003 and served as a temporary bassist between the departure of Newsted and the hiring of Trujillo.\n\nMetallica has released nine studio albums, four live albums, five extended plays, 25 music videos, and 37 singles. The band has won nine Grammy Awards, and has had five consecutive albums debut at number one on the Billboard 200, making Metallica the first band to do so. The band's eponymous 1991 album has sold over 16 million copies in the United States, making it the best-selling album of the SoundScan Era. Metallica ranks as one of the most commercially successful bands of all time, having sold over 110 million records worldwide. Metallica has been listed as one of the greatest artists of all time by many magazines, including Rolling Stone, which ranked them 61st on its list of The 100 Greatest Artists of All Time. As of December 2012, Metallica is the fourth best-selling music artist since Nielsen SoundScan began tracking sales in 1991, selling a total of 53,642,000 albums in the United States alone. In 2009, Metallica was inducted into the Rock and Roll Hall of Fame.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Frantic_(song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Frantic_(song)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/LAnahaaFh&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/LAnahaaFh&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 7700kbps\n   Audio: Dolby Digital AC3 48000Hz 6ch 448kbps\n   Duration: 00:04:58\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.3\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:e3dd940c768ea2868644b91803d903907741a097","amp;dn":"Metallica+-+Frantic+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3dd940c768ea2868644b91803d903907741a097","infoHashBuffer":{"type":"Buffer","data":[227,221,148,12,118,142,162,134,134,68,185,24,3,217,3,144,119,65,160,151]},"announce":[],"urlList":[]}}