{"title":"Internet-Denial-of-Service---Attack-and-Defense-Mechanisms.chm","uid":9478793,"size":2155014,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:e451ebee89e7e45b23479d29b2db89d3d91ce271&amp;dn=Internet-Denial-of-Service---Attack-and-Defense-Mechanisms.chm&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rikviv","files":-1,"time":1389752559,"description":"Internet Denial of Service: Attack and Defense Mechanisms \nBy Jelena Mirkovic, Sven Dietrich, David Dittrich, Peter Reiher \n............................................... \nPublisher: Prentice Hall PTR \nPub Date: December 30, 2004 \nPrint ISBN: 0-13-147573-8 \nPages: 400 \n   \n  \n\nTable of Contents  | Index   \n\n \nSuddenly your Web server becomes unavailable. When you investigate, you realize that a flood of packets is surging into your network. You have just become one of the hundreds of thousands of victims of a denial-of-service attack, a pervasive and growing threat to the Internet. What do you do? Internet Denial of Service sheds light on a complex and fascinating form of computer attack that impacts the confidentiality, integrity, and availability of millions of computers worldwide. It tells the network administrator, corporate CTO, incident responder, and student how DDoS attacks are prepared and executed, how to think about DDoS, and how to arrange computer and network defenses. It also provides a suite of actions that can be taken before, during, and after an attack. Inside, you'll find comprehensive information on the following topics How denial-of-service attacks are waged How to improve your network's resilience to denial-of-service attacks What to do when you are involved in a denial-of-service attack The laws that apply to these attacks and their implications How often denial-of-service attacks occur, how strong they are, and the kinds of damage they can cause Real examples of denial-of-service attacks as experienced by the attacker, victim, and unwitting accomplices The authors' extensive experience in handling denial-of-service attacks and researching defense approaches is laid out clearly in practical, detailed terms. \n","torrent":{"xt":"urn:btih:e451ebee89e7e45b23479d29b2db89d3d91ce271","amp;dn":"Internet-Denial-of-Service---Attack-and-Defense-Mechanisms.chm","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e451ebee89e7e45b23479d29b2db89d3d91ce271","infoHashBuffer":{"type":"Buffer","data":[228,81,235,238,137,231,228,91,35,71,157,41,178,219,137,211,217,28,226,113]},"announce":[],"urlList":[]}}