{"title":"Advanced Reservoir Engineering","uid":12716675,"size":3168666,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e4869c4f6f9a0564c3da466d7124f365cb66f7d0&amp;dn=Advanced+Reservoir+Engineering&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1446943161,"description":"Advanced Reservoir Engineering - Tarek Ahmed and Paul D. McKinney (Elsevier, 2005).pdf\r\n\r\nISBN 0750677333\r\n\r\nAdvanced Reservoir Engineering offers the practicing engineer and engineering student a full description, with worked examples, of all of the kinds of reservoir engineering topics that the engineer will use in day-to-day activities. In an industry where there is often a lack of information, this timely volume gives a comprehensive account of the physics of reservoir engineering, a thorough knowledge of which is essential in the petroleum industry for the efficient recovery of hydrocarbons.\r\n\r\nChapter one deals exclusively with the theory and practice of transient flow analysis and offers a brief but thorough hands-on guide to gas and oil well testing. Chapter two documents water influx models and their practical applications in conducting comprehensive field studies, widely used throughout the industry. Later chapters include unconventional gas reservoirs and the classical adaptations of the material balance equation. \r\n\r\n* An essential tool for the petroleum and reservoir engineer, offering information not available anywhere else\r\n\r\n\r\n* Introduces the reader to cutting-edge new developments in Type-Curve Analysis, unconventional gas reservoirs, and gas hydrates \r\n\r\n* Written by two of the industry's best-known and respected reservoir engineers","torrent":{"xt":"urn:btih:e4869c4f6f9a0564c3da466d7124f365cb66f7d0","amp;dn":"Advanced+Reservoir+Engineering","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4869c4f6f9a0564c3da466d7124f365cb66f7d0","infoHashBuffer":{"type":"Buffer","data":[228,134,156,79,111,154,5,100,195,218,70,109,113,36,243,101,203,102,247,208]},"announce":[],"urlList":[]}}