{"title":"Aretha Franklin - Greatest Hits (1980-1994)","uid":6623112,"size":564922441,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e5414ed0fbd85495a9d18af0700babb57228f3e2&amp;dn=Aretha+Franklin+-+Greatest+Hits+%281980-1994%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cdda-flac","files":-1,"time":1314071363,"description":"\n &lt;a href=&quot;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/4f/95/291ec060ada0b12e5ee0e110.L.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/4f/95/291ec060ada0b12e5ee0e110.L.jpg&lt;/a&gt;\n\n\nTitle: Greatest Hits (1980-1994)\nArtist: Aretha Franklin\nAudio CD (February 22, 1994)\nOriginal Release Date: February 22, 1994\nNumber of Discs: 1\nGenre: R&amp;B\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. Freeway of Love\n02. I Knew You Were Waiting (For Me) [Feat. George Michael]\n03. Jump to It\n04. Willing to Forgive\n05. Doctor's Orders [Feat. Luther Vandross]\n06. United Together\n07. Who's Zoomin' Who\n08. A Deeper Love\n09. Honey\n10. Get It Right\n11. Another Night\n12. Ever Changing Times [Feat. Michael McDonald]\n13. Jimmy Lee\n14. (You Make Me Feel Like) A Natural Woman [Feat. Bonnie Raitt &amp; Gloria Estefan]\n15. I Dreamed a Dream\n16. Jumpin' Jack Flash\n\n\nAmazon Review:\nWhen Aretha Franklin signed with Arista Records, marking the end of the 13-year tenure at Atlantic that saw her transform both her own art and the face of soul music itself, she was at loose ends. Even when she scored hits for the new label, they were often the result of casting about for a commercial foothold in the post-disco marketplace rather than the savvy combination of pure artistry and smart trend-watching of her greatest Atlantic moments. Thus, the tracks collected on Greatest Hits (1980-1994) are hardly her most essential; &quot;Jump to It&quot; and &quot;Freeway of Love&quot; are fun, but &quot;Jimmy Lee&quot; and the George Michael duet &quot;I Knew You Were Waiting (For Me)&quot; reflect fairly dull accommodations with '80s pop conventions.\n\nAllmusic Review:\nThis compilation collects the Queen of Soul's biggest hits from 1980-1994, after she left her legendary tenure with Atlantic and moved on to Arista. The material collected here is not quite as essential as her Atlantic recordings -- instead, the focus seems to weigh heavily toward middle-of-the-road, adult contemporary soul pop, which continued to translate into chart success, albeit a little more sporadic. This album includes her '80s smashes &quot;Freeway of Love,&quot; &quot;Jump to It,&quot; &quot;Who's Zoomin' Who,&quot; &quot;Another Night,&quot; and &quot;Jimmy Lee,&quot; as well as her chart-topping 1987 duet with George Michael, &quot;I Knew You Were Waiting (For Me),&quot; and her adult contemporary hit duet with Michael McDonald, &quot;Everchanging Times.&quot; Also included is the soulful &quot;Doctor's Orders&quot; with ace crooner Luther Vandross, and &quot;United Together,&quot; the greatest song Whitney Houston never recorded. This collection is not free of annoying omissions, among those are her essential duet with Eurythmics, &quot;Sisters Are Doin' It for Themselves&quot;; her hit duet with Elton John, &quot;Through the Storm&quot;; and her hit remake of the Rolling Stones' &quot;Jumpin' Jack Flash.&quot; That song, however, is included as a bonus track on select pressings of the album. A few new tracks are thrown in, including the Babyface-penned, assembly-line ballad &quot;Willing to Forgive,&quot; which became her first American Top 40 hit in five years, and her version of the Clivelles and Cole club anthem &quot;A Deeper Love,&quot; which went on to top the dance charts. The album closes with two live tracks, one being &quot;You Make Me Feel (Like a Natural Woman)&quot; with Bonnie Raitt and Gloria Estefan, and the fantastically soulful &quot;I Dreamed a Dream.&quot; Not a bad collection by any means, but some of the material is a little spotty, and it could have been quite better had they included all the hits.","torrent":{"xt":"urn:btih:e5414ed0fbd85495a9d18af0700babb57228f3e2","amp;dn":"Aretha+Franklin+-+Greatest+Hits+%281980-1994%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5414ed0fbd85495a9d18af0700babb57228f3e2","infoHashBuffer":{"type":"Buffer","data":[229,65,78,208,251,216,84,149,169,209,138,240,112,11,171,181,114,40,243,226]},"announce":[],"urlList":[]}}