{"title":"John Valby - Herniated Jingle Balls (ORIGINAL)","uid":7207045,"size":40312398,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e60d54ff6abbfab325d8cdf602c41983c43fbc14&amp;dn=John+Valby+-+Herniated+Jingle+Balls+%28ORIGINAL%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TaurusKJ","files":17,"time":1335130281,"description":"John Valby &quot;Dr Dirty&quot; Herniated Jingle Balls (ORIGINAL - NOT the Extended Ver)\n \nSearched for and downloaded the Extended Version of this album (which was all I could find on any torrent site), and it SUCKED! Why can't people leave a good thing alone?!? Every time I would play this (original) album at a Christmas party in the late 80's, all I would hear is &quot;Who is this?&quot; &quot;Let me borrow it!!&quot; &quot;I GOTTA have a copy!!&quot; No one had ever heard anything like it, and It's damn FUNNY!! A shocking, well deserved relief from the traditional Christmas songs we grew up with, It was like finding a new &quot;crossing the line&quot; freedom we never knew was possible. Ok, maybe not that deep, but something like that.\n \nThe Extended Version of this album released early 2000's tried to improve on this feel, make it dirtier, funnier, and made the album about 17 minutes longer. The Extended Version failed terribly to meet its purpose, and it truly made me gag. So over the last year, I have painstainkly search the net, contacted old friends, and dug out a weatherd copy of my own, and peiced together the original release of this album that changed the life of so many (humorously deep again.....). I used the tracks off of the extended version that remained unchanged, and edited together the Slegh Ride/12 Days of Christmas track to restore it to original. Just a few songs did not appear on the Extended Version, such as &quot;Silent Fart&quot;, and I have done my best to make them sound satisfatory with the sources I had.\n \nMany tracks here sound great, and some not so great. But i think I have accomplished the original feel of the album, I hope all who obtain this torrent, will feel the same.\n \nMP3's 192kbps 17 tracks. If the tags are abit screwed, I apologize. \n\nPlease click on the &quot;files&quot; bar above for track listings.\n\nTHIS TORRENT IS A RE-UPLOAD!!  \n\nPlease seed and enjoy! \n","torrent":{"xt":"urn:btih:e60d54ff6abbfab325d8cdf602c41983c43fbc14","amp;dn":"John+Valby+-+Herniated+Jingle+Balls+%28ORIGINAL%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e60d54ff6abbfab325d8cdf602c41983c43fbc14","infoHashBuffer":{"type":"Buffer","data":[230,13,84,255,106,187,250,179,37,216,205,246,2,196,25,131,196,63,188,20]},"announce":[],"urlList":[]}}