{"title":"Ahmad Jamal - Macanudo (1962) [Jazz][mp3 320][schon55]","uid":5442947,"size":63342355,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e6fb8576b642580d4a25829af6aad6afe5a08b66&amp;dn=Ahmad+Jamal+-+Macanudo+%281962%29+%5BJazz%5D%5Bmp3+320%5D%5Bschon55%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":13,"time":1268935064,"description":"Ahmad Jamal - Macanudo \nYear: 1962\nLabel: Argo Records\nRecorded: 20-21/12/1961 at Rudy Van Gelder's Studio,  Englewood Cliffs,  New Jersey.\nQuality: 320 kbps\n\nAhmad Jamal, the driving force behind this album, is at home in Brazil.  Coaxing great blocks of shimmering sound from the piano, the great pianist defends his reputation as the most rhythmic and creative artist working on the keyboard today.  Evans provides a colourful frame for the Jamal palette.  Using jazz greats and conservatory trained musicians from the New York Philharmonic and other symphony orchestras he paints brilliant impressionistic portraits with strings, french horns, flutes, harps and bells.  Darting in and out of the splashes of sound, Jamal rises to great heights as an artist by dominating this large and impressive orchestra.&quot;  Bogota is the stand out track on the lp for me closely followed by Haitian Market Place but its all good listening and another great example of Jazz Exotica.\n\nUK Pye Jazz label 8-track 'monaural' vinyl LP, recorded at the Rudy Van Gelder Studios in 1962, with orchestra directed by Richard Evans - a hip blend of the best rhythmic currents in Afro-Harlem and Afro-Latin Americanmusic!  Housed in a front laminate flipback picture sleeve.  From the vast personal archive collection of a former music reviewer and journalist,  this record has been locked away in storage for more than 30 years.\n\nA sorely underexposed figure and a major influence on Miles Davis, pianist Ahmad Jamal isn't generally ranked among the all-time giants of jazz, but he impressed fellow musicians and record buyers alike with his innovative, minimalist approach.  Jamal's manipulations of space and silence, tension and release, and dynamics all broke new ground, and had an impact far beyond Jamal's favored piano trio format. As an arranger, Jamal made the most of his small-group settings by thinking of them in orchestral terms: using his trademark devices to create contrast and dramatic effect, and allowing the rhythm section a great deal of independence in its interplay.  Nonetheless, his ensembles were always tightly focused as well,  following their leader through sudden changes in tempo or time signature, and often carrying the main riff of a tune.\n\nJamal's own playing was a model of economy; because he didn't overwhelm listeners with his technique, his flashes of virtuosity had significantly more impact.  His lines were spare and light, yet melodically and harmonically inventive, and driven by complex left-hand chord voicings that broke with Bud Powell's right-hand emphasis.  A chamber-like sensibility and a classical formality permeated much of his playing, yet he swung like a jazzman without fail.  Miles Davis greatly admired him, borrowing liberally from his repertoire and arrangements, and encouraging his pianist Red Garland to imitate Jamal's playing as closely as possible; additionally, Jamal's concepts of space and subtlety greatly affected Davis in his own right, both as a soloist and as a bandleader who (as it's often put) let the music breathe.\n\nAhmad Jamal - Macanudo tracks:\n01 Montevideo 2:57\n02 Bogota (4:00)\n03 Sugar Load At Twilight (3:14)\n04 Haitian Market Place (2:57)\n05 Buenos Aires (3:59)\n06 Bossa Nova Do Marilla (2:56)\n07 Carnival in Panama (3:29)\n08 Belo Horizonte (2:32)","torrent":{"xt":"urn:btih:e6fb8576b642580d4a25829af6aad6afe5a08b66","amp;dn":"Ahmad+Jamal+-+Macanudo+%281962%29+%5BJazz%5D%5Bmp3+320%5D%5Bschon55%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6fb8576b642580d4a25829af6aad6afe5a08b66","infoHashBuffer":{"type":"Buffer","data":[230,251,133,118,182,66,88,13,74,37,130,154,246,170,214,175,229,160,139,102]},"announce":[],"urlList":[]}}