{"title":"The Spiritual Sun - Thaddeus Music by Sanaya Roman","uid":4190086,"size":177789302,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e7ff2e53ddf181e3618c04799f8a899131a0802e&amp;dn=The+Spiritual+Sun+-+Thaddeus+Music+by+Sanaya+Roman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"iloveabrahamhicks","files":4,"time":1210897567,"description":"The Spiritual Sun http://www.orindaben.com/products/ms209d.php\n\nThis music lifts you to high, flowing, expanded states of consciousness as you listen. It is expansive and peaceful, and opens you to the consciousness of the Spiritual Sun, the light of beauty, perfection, and oneness.\n\nYou can play this music as background to help you sustain high, peaceful states, and to support feelings of joy and well-being. This music can also assist you in shifting into spiritual spaces, and to maintain those spaces throughout the day. This music can assist you in falling asleep at night, or at any time when you want to calm down or go at a slower pace, as it is very relaxing.\n\nYou can play it for group gatherings, a quiet dinner, peaceful times with friends, or use it to concentrate, focus, and be in higher states while you work. This is excellent background music for massage, or for using at the dentist or in a hospital to stay calm, and to set a healing space. You can play it while you teach or meditate, and to set a space of peace and flow while you do creative work of any kind.\n\nSide 1 Spiritual Sun Opening\nOpen to the Spiritual Sun as you bathe in its light. Thaddeus presents specific sounds and sequences of notes to assist you in expanding your consciousness in this great light of infinite awareness.\n\nSide 2 Spiritual Sun Lifting\nLet your spirit soar! Feel the expansion of your heart as you listen to these chords and sequences that lift you to the Central Spiritual Sun. Many shifts of consciousness as possible as you listen.\n\nSide 3 Spiritual Sun Vortex\nEnjoy traveling into a vortex of light and love as you move into the illumination of the Spiritual Sun. Relax and let this music take you on a journey into the light of higher consciousness. Every time you listen and journey to the Central Sun something will be transformed within you.\n\nSide 4 Illumination\nFeel the illumination of the Central Spiritual Sun as it pours into your spirit, soul, and mind. Let this set a space of illumination where you can see your higher path more clearly, recognize light in yourself, in others, and release any energy that does not serve you.\n\nThaddeus&amp;#039; music is composed on synthesizers using strings, angelic voices, and other sounds that will take you into the great Central Spiritual Sun, the light of synthesis, beauty, and love. Become an infinite, endless, eternal light as you journey to the Spiritual Sun.\n\nThis album has approximately 2 hours of music and is ideal for meditation, healing, relaxation, and for pure listening enjoyment. \n &lt;a href=&quot;\nhttp://www.orindaben.com/music/listenrm.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.orindaben.com/music/listenrm.php&lt;/a&gt;","torrent":{"xt":"urn:btih:e7ff2e53ddf181e3618c04799f8a899131a0802e","amp;dn":"The+Spiritual+Sun+-+Thaddeus+Music+by+Sanaya+Roman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7ff2e53ddf181e3618c04799f8a899131a0802e","infoHashBuffer":{"type":"Buffer","data":[231,255,46,83,221,241,129,227,97,140,4,121,159,138,137,145,49,160,128,46]},"announce":[],"urlList":[]}}