{"title":"Yo-Yo Ma, Edgar Meyer, Marc O'Connor - Appalachian Journey","uid":7905673,"size":169323612,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e80b6b62291ba363c9927d5ffb2f4bdff902eb4a&amp;dn=Yo-Yo+Ma%2C+Edgar+Meyer%2C+Marc+O%27Connor+-+Appalachian+Journey&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"jazznbluz","files":-1,"time":1355088255,"description":"The follow-up album to the highly successful Appalachia Waltz collaboration, Appalachian Journey continues the combination of classical music with Appalachian, bluegrass, and American roots music in general. Yo-Yo Ma, alongside violinist Mark O'Connor and bass player Edgar Meyer, runs through a number of original compositions fusing the traditions, as well as a few old standards from the genre repertoire. As stated by the artists, Appalachia Waltz explored the combination of the three artists' sounds put together, while Journey expands upon this theme, exploring the sound of the three artists as a singular group. Joining with the trio are James Taylor on a pair of works (on both guitar and vocals) and Alison Krauss on fiddle and vocals. The vocalists are added specifically on a pair of old Stephen Foster works, the songs themselves thematically bridging the gap between the classical and folk realms. The tone can change easily from cheerful jigging to outright nostalgic, depending largely on who's doing the soloing at any given time. There's an embracing down-home atmosphere set up by the artists, using warm tones and motives throughout the album. At the same time, the trio displays some remarkable virtuosity (as would be expected from this group), burning through some fiery sets of triplets on otherwise slow instruments (the cello and bass, specifically), but keeping up with the violin while avoiding the easily hit distortion sounds that usually come from high speed, low frequency playing. Reels fit easily with waltzes here, and also with traditional songs with virtuosic passages from original compositions. The old and the older are easily made compatible here largely on the strength of the performers involved. It's a worthwhile album for listeners curious about the newer directions being taken in the classical realm.","torrent":{"xt":"urn:btih:e80b6b62291ba363c9927d5ffb2f4bdff902eb4a","amp;dn":"Yo-Yo+Ma%2C+Edgar+Meyer%2C+Marc+O%27Connor+-+Appalachian+Journey","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e80b6b62291ba363c9927d5ffb2f4bdff902eb4a","infoHashBuffer":{"type":"Buffer","data":[232,11,107,98,41,27,163,99,201,146,125,95,251,47,75,223,249,2,235,74]},"announce":[],"urlList":[]}}