{"title":"Il Diario Di Una Tata [ITA - SatRip] {SirD}.avi","uid":4814468,"size":733478912,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e8f6bb298a248b0850e4d936809a0ae67b1b505a&amp;dn=Il+Diario+Di+Una+Tata+%5BITA+-+SatRip%5D+%7BSirD%7D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SirDexter","files":1,"time":1238496552,"description":"Annie Braddock (Scarlett Johansson) ÃƒÂ¨ una ragazza appena laureata in cerca di lavoro. Alcuni colloqui fallimentari presso importanti societÃƒÂ  newyorkesi le fanno perdere la fiducia in se stessa, ma un incontro imprevisto con un bambino dell'Upper East Side, le cambia la vita.\nIl rischio che il film si trasformi in una narrazione del rapporto fra una tata e le marachelle di una piccola peste, sono concrete. La divertente e realistica interpretazione della Johansson, nella figura di tata e soprattutto di osservatrice-antropologa delle abitudini malsane della borghesia della grande mela, mantengono perÃƒÂ² il tono intelligente della commedia. ÃƒË† quindi questo equilibrio fra ironia (Annie non ha esperienza coi bambini ed ÃƒÂ¨ impacciata e maldestra) e analisi sociale che, almeno per la prima metÃƒÂ  riesce, senza falsi sentimentalismi a sostenere un film che per molti versi ÃƒÂ¨ deludente. Le interpretazioni sono tutte notevoli, compreso il ricco padre di famiglia affidato a un sempre bravo Paul Giamatti, la messa in scena ÃƒÂ¨ invece classica e ricade nella seconda parte in alcune situazioni scontate e prevedibili, indotte dagli stereotipi del caso. La madre borghese che non si cura del figlio e pensa solo a se stessa e al suo esternarsi in una &quot;high society&quot; che impone alcune ritualitÃƒÂ  precise; il marito dedicato al puro business che coltiva relazioni extra coniugali con le segretarie del caso; la stessa tata di origini di provincia che si sfoga in critiche nei confronti di genitori inghiottiti dalla frenesia da metropoli.\nNe esce fuori un film che ÃƒÂ¨ un ibrido di socio-critica e commedia famigliare, che avrebbe potuto ambire a risultati migliori. Resta il fatto che non ci si puÃƒÂ² lamentare se i propri figli, oggigiorno, hanno rapporti conflittuali con i genitori.","torrent":{"xt":"urn:btih:e8f6bb298a248b0850e4d936809a0ae67b1b505a","amp;dn":"Il+Diario+Di+Una+Tata+%5BITA+-+SatRip%5D+%7BSirD%7D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8f6bb298a248b0850e4d936809a0ae67b1b505a","infoHashBuffer":{"type":"Buffer","data":[232,246,187,41,138,36,139,8,80,228,217,54,128,154,10,230,123,27,80,90]},"announce":[],"urlList":[]}}