{"title":"The Vault (Tyler Locke 2) By Boyd Morrison","uid":9165962,"size":1177924,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ebea244d694cd11414fa5f5fd763b43e9aba3c12&amp;dn=The+Vault+%28Tyler+Locke+2%29+By+Boyd+Morrison&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"maxdesolate","files":4,"time":1383981960,"description":"\nTyler Locke's routine commute on a Washington State ferry is interrupted by a chilling anonymous call claiming that his father has been kidnapped and that a truck bomb is set to detonate on board in twenty minutes. When Tyler reaches the bomb on the boat's car deck, he's stunned to find classical languages expert Stacy Benedict waiting for him. She's received the same threat and her sister has also been taken. In order to disarm the bomb, they must work together to solve an engineering puzzle--a puzzle written in ancient Greek. Preventing the explosion is only the first step. They soon learn the entire setup is a test created by a ruthless criminal who forces them to go on a seemingly impossible mission: uncover the legendary lost riches of King Midas.\n\nTyler and Stacy have just five days to track down the gold. Armed with an ancient manuscript penned by brilliant Greek inventor Archimedes, they begin a quest to unravel a 2,000-year-old mystery whose answer is hidden within the workings of a cryptic artifact: the Antikythera mechanism, a device designed by Archimedes himself.\n\nTo save their loved ones and prevent their captors from recovering a treasure that will finance unspeakable devastation, Tyler and Stacy head to Italy, Germany, Greece, and finally the streets of New York City in a race against the clock to find the truth behind the story of King Midas.\n\nthis book is also known as the midas code.\n\nepub and mobi. seed and enjoy. dont let the torrents die. buy the book if you love it to support the writers.","torrent":{"xt":"urn:btih:ebea244d694cd11414fa5f5fd763b43e9aba3c12","amp;dn":"The+Vault+%28Tyler+Locke+2%29+By+Boyd+Morrison","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebea244d694cd11414fa5f5fd763b43e9aba3c12","infoHashBuffer":{"type":"Buffer","data":[235,234,36,77,105,76,209,20,20,250,95,95,215,99,180,62,154,186,60,18]},"announce":[],"urlList":[]}}