{"title":"The Conundrum","uid":8363653,"size":310161,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ecc2342d625987f7374def26963270832adeece6&amp;dn=The+Conundrum&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1365705503,"description":" David Owen, &quot;The Conundrum&quot;\n2012 | ISBN-10: 1594485615 | EPUB\n\nThe Conundrum is a mind-changing manifesto about the environment, efficiency and the real path to sustainability.\n\nHybrid cars, fast trains, compact florescent light bulbs, solar panels, carbon offsets: Everything you've been told about living green is wrong. The quest for a breakthrough battery or a 100 mpg car are dangerous fantasies. We are consumers, and we like to consume green and efficiently. But David Owen argues that our best intentions are still at cross purposes to our true goal - living sustainably and caring for our environment and the future of the planet. Efficiency, once considered the holy grail of our environmental problems, turns out to be part of the problem. Efforts to improve efficiency and increase sustainable development only exacerbate the problems they are meant to solve, more than negating the environmental gains. We have little trouble turning increases in efficiency into increases in consumption.\n\nDavid Owen's The Conundrum is an elegant nonfiction narrative filled with fascinating information and anecdotes takes you through the history of energy and the quest for efficiency. This is a book about the environment that will change how you look at the world. We should not be waiting for some geniuses to invent our way out of the energy and economic crisis we're in. We already have the technology and knowledge we need to live sustainably. But will we do it?\n\nThat is the conundrum. ","torrent":{"xt":"urn:btih:ecc2342d625987f7374def26963270832adeece6","amp;dn":"The+Conundrum","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecc2342d625987f7374def26963270832adeece6","infoHashBuffer":{"type":"Buffer","data":[236,194,52,45,98,89,135,247,55,77,239,38,150,50,112,131,42,222,236,230]},"announce":[],"urlList":[]}}