{"title":"[Third Degree Fims] Pho King (2015) [1080p] ","uid":12359813,"size":11637912978,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ed00236050fa360fa813828b27627d0f64cb72fb&amp;dn=+%5BThird+Degree+Fims%5D+Pho+King+%282015%29+%5B1080p%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Chinu685","files":1,"time":1441518446,"description":"hat makes Asian women so hot? Find out from 3rd Degree in this tribute to the mysterious, sexy ladies of the Asian persuasion! Their beautiful porcelain skin, dark silky hair and sultry eyes are just the beginning! Once they draw you in, they will blow your mind with hardcore action guaranteed to keep you satisfied on any continent!\n\nScene 1 - Kalina Ryu\nOral &amp; Facial Cumshot\n\nScene 1 starts with a visual introduction to Kalina Ryu and her tight little body. She moves over to Mick Blue who was laying on his front, she massages him slowly before flipping him over onto his back. She takes a jar of lube and lubes up his dick before licking his balls and sucking his dick. She climbs on top of him and he fucks the life out of her in reverse cowgirl, cowgirl, doggy and the spoon positions. They end up fucking in the good old missionary position, he then straddles her chest and jerks himself off as she licks his balls. He shoots his load over her face and into her mouth to end the scene.\n\nScene 2 - Angelina Chung\nFacial Cumshot\n\nScene 2 starts with a visual introduction to Angelina Chung, she doesnt have the best body in the business but she hass got a pretty pussy and she has a very horny girl. She too takes out the lube and lubes up John Strongs dick and jerks him off before blowing him. She climbs on top in the cowgirl position and slides his dick into her pussy, the couple fuck in the same positions as the first scene with the added bonus of some great close up missionary position. He pulls out and she sucks him and jerks him off onto her face.\n\nScene 3 - Cindy Starfall\nOral Cumshot\n\nScene 3 stars one of my favourite Asian porn stars, Miss Cindy Starfall. We were treated to a visual introduction of her amazing body with that killer Vietnamese ass of hers. She takes Mick Blue to the bed and unleashes the lube on his dick. She jerks him off and gives him a great blowjob, then they enjoy some 69 action before she climbs on top to get her pussy fucked. The pair use some additional lube for the pussy fucking and enjoy multiple positions together. Cindy achieves orgasm in this scene and damn is she hot when she cums, Mick Blue is a very lucky guy. At the end of the scene she gives her all, jerking him off into her mouth to end the scene.\n\nScene 4 - Mia Li\nFacial &amp; Chest Cumshot\n\nwe get another visual introduction to a pretty Asian girl, this time it is Mia Li. She lubes up Karlo and massages his back before massaging his dick with her hands and then with her mouth. The pair stand up and start kissing while she jerks him off. He lays her down and licks her pussy before he starts destroying her with his dick. He kills her pussy in various positions before he stands in front of her, she takes his dick in her hand, jerks him off and sucks him until he pops over her face and onto her chest and tits.\n\nScene 5 - Bonus Scene\nInterview\n\nIn the final moments of the movie, Mick Blue interviews Angelina, Cindy and Mia after they have fucked. This ends with Mia playing a song for us.\n &lt;a href=&quot;\nhttp://sexyimage.org/img-55ebb79d3c0d1.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexyimage.org/img-55ebb79d3c0d1.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://milfimage.org/img-55ebb7a1b5c8a.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://milfimage.org/img-55ebb7a1b5c8a.html&lt;/a&gt;\n\n\n\nâ—†â—†â—†..:For more awesome stuff please click below:..â—†â—†â—†\n                                                        &lt;a href=&quot;\nhttps://thepiratebay.la/user/Chinu685/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.la/user/Chinu685/&lt;/a&gt;","torrent":{"xt":"urn:btih:ed00236050fa360fa813828b27627d0f64cb72fb","amp;dn":"+%5BThird+Degree+Fims%5D+Pho+King+%282015%29+%5B1080p%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed00236050fa360fa813828b27627d0f64cb72fb","infoHashBuffer":{"type":"Buffer","data":[237,0,35,96,80,250,54,15,168,19,130,139,39,98,125,15,100,203,114,251]},"announce":[],"urlList":[]}}