{"title":"James Alan Gardner - Hunted (League of Peoples #4)","uid":13112454,"size":206163206,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ed4a590b2c39eab61ed19ee2b6b10fd5a731bf29&amp;dn=James+Alan+Gardner+-+Hunted+%28League+of+Peoples+%234%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cybotage","files":1,"time":1451499384,"description":"\nFor the children of Admiral Alexader York, perfection wasn't just expected, it was guaranteed - written into their DNA before they were born.\r\n\r\nBut while Samantha grew into the physical and mental marvel their father had bought and paid for, her twin brother Edward proved a disappointment. Genetic tinkering had raised Sam above the common herd, but Edward's faultless body housed a faulty brain.\r\n\r\nIt took all the Admiral's influence to get Edward commissioned in the Outward Fleet Explorer Corps - a fiercely independent band of misfits who referred to themselves proudly as Expendables. Accompanying Sam on a mission to the troubled planet of Troyen, home to the alien Mandasar, Edward found himself in the midst of a civil war. There, in an instant of horrifying insanity, Sam was killed, along with the alien hive-queen.\r\n\r\nFor the next 20 years, Edward was exiled to a lonely outpost on one of Troyen's moons, blamed by the Admiral for Sam's death - and blaming himself as well. But when escalating violence forces the evacuation of the system, Edward embarks on a perilous journey home that will lead hin into a forgotten past - and, with the assistance of another ex-Expendable, the greatest Explorere of them all, the legendary Admiral Festina Ramos, into a future thick with conspiracy and betrayal. For there lurks a dark secret powerful enough to bury the hopes of human and Mandasar alike...or give them a new and brighter beginning.\r\n\r\n\r\nNarrated by: Adam Henderson\r\nLength: 13 hrs and 47 mins \r\nFormat: M4A\r\nBitrate: 32 Kbps\r\nUnabridged Audiobook\r\nRelease Date:10-01-12\r\nPublisher: Audible Studios","torrent":{"xt":"urn:btih:ed4a590b2c39eab61ed19ee2b6b10fd5a731bf29","amp;dn":"James+Alan+Gardner+-+Hunted+%28League+of+Peoples+%234%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed4a590b2c39eab61ed19ee2b6b10fd5a731bf29","infoHashBuffer":{"type":"Buffer","data":[237,74,89,11,44,57,234,182,30,209,158,226,182,177,15,213,167,49,191,41]},"announce":[],"urlList":[]}}