{"title":"Sexually Broken--Redheaded slut Daisy Ducati bound down and fuck","uid":10248074,"size":1246906762,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:edc6c8a0280f8dffc0a189e67cd3f65a11f38312&amp;dn=Sexually+Broken--Redheaded+slut+Daisy+Ducati+bound+down+and+fuck&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1401318884,"description":"Redheaded slut Daisy Ducati bound down and fucked hard by 2 big cocks, squirts everywhere! | Daisy Ducati | Matt Williams\n\nMay 28, 2014\n\n\niPod, High and Low MP4 + Pics.\n\n\nDaisy Ducati is a fit toned tall drink of water with a body built for sin and a pussy build for squirting. She has only been modeling for a few years but has already built up quite a name for herself with her eagerness and abandon. We like eager sluts around here at Sexuallybroken and know just what to do with them. Mainly, tie them up and fuck them from every which side until their brain melts and they are left twitching in a puddle of their own cum.\n\nBound with leather belts in a wooden custom made bondage device that keeps her long legs spread and her head tipped back, Daisy is in the perfect position for the dicking down she is about to receive. Her long thin neck dangles down, exposing her mouth hole. Her flawlessly shaved pussy makes a ripe target. Her oiled body gleams. We step right up and make full use of those waiting holes. First we try and loosen up that tight little throat. For a porn star, this slut needs practice. Lucky for her, Sexuallybroken specializes in throat training.\n\nWhile we have a dick in one end, we take a rock hard 10 inch BBC and sink it home balls deep on the other end. Daisy's eyes roll into the back of her skull as waves of pleasure wash over her bound body. Her muscles gleam as she strains and cums repeatedly. The drool flows out of her well used face pussy. The cocks own every inch of her tender flesh.\n\nTime to take this home. Daisy is fucked silly, dicked down hard and leaking out of all of her holes. We fingerblast her cunt, ripping squirting orgasm after squirting orgasm out of it. Daisy is dazed and confused, her squirt dripping down and puddling on the floor, coating her belly and breasts. THIS is what Sexuallybroken looks like. And it is a good look on little miss Daisy. \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/05_28dducati2/SexuallyBroken-Daisy-Ducati-Matt-Williams-Redheaded-slut-Daisy-Ducati-bound-down-and-fucked-hard-by-2-big-cocks-squirts-everywhere.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/05_28dducati2/SexuallyBroken-Daisy-Ducati-Matt-Williams-Redheaded-slut-Daisy-Ducati-bound-down-and-fucked-hard-by-2-big-cocks-squirts-everywhere.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:edc6c8a0280f8dffc0a189e67cd3f65a11f38312","amp;dn":"Sexually+Broken--Redheaded+slut+Daisy+Ducati+bound+down+and+fuck","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edc6c8a0280f8dffc0a189e67cd3f65a11f38312","infoHashBuffer":{"type":"Buffer","data":[237,198,200,160,40,15,141,255,192,161,137,230,124,211,246,90,17,243,131,18]},"announce":[],"urlList":[]}}