{"title":"Spike Milligan Reads Adolf Hitler - My Part In His Downfall","uid":4937865,"size":206973480,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:eef9024d92ce9228a386803869b6363f02424d80&amp;dn=Spike+Milligan+Reads+Adolf+Hitler+-+My+Part+In+His+Downfall&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Welshguy","files":-1,"time":1244324604,"description":"Before there was Python, there were the Goons. And before the Goons, there was Spike Milligan. \n\nIn the six-book series that begins with &quot;Adolf Hitler: My Part in His Downfall&quot;, Milligan charts his own odyssey through World War II. \nThere's plenty of Milliganesque lunacy here, many many laughs, and not a little pathos, all told in an unabashedly sentimental and frequently endearingly naive tone. \n\nFrom the first page, where &quot;a man named Chamberlain who did Prime Minister impressions got on the radio and said we were at war with Germany&quot; to induction, training and eventual departure for North Africa, Milligan captures the essential unpreparedness and paradoxically indomitable spirit that infused the British war effort. The results are touched both by Milligan's own manic humor and the black depression that was its counterpart, and against which he struggled for much of his life. \n\nA warning- Milligan's prose is addictive. You will not be able to stop with &quot;Hitler&quot;, but will be forced into the continuing story in &quot;Rommel? Gunner Who?&quot;, &quot;Monty: His Part in My Victory&quot; and &quot;Mussolini: His Part in My Downfall&quot;. It just gets more loony, but it's a must-read. \n &lt;a href=&quot;\nhttp://bayimg.com/eaaLpAAcJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/eaaLpAAcJ&lt;/a&gt;\n\nI downloaded this from radioarchive and all credit goes to slimoo for his hard work which he dose each and everyday!\n\n\nPlease seed this as long as your able so others can enjoy this.\n\nartwork inculded and recorded at 128kbs \n\n\n\n\nSorry guys I can't seed this overnight but stay with me and I will get you the whole thing this weekend!!\n","torrent":{"xt":"urn:btih:eef9024d92ce9228a386803869b6363f02424d80","amp;dn":"Spike+Milligan+Reads+Adolf+Hitler+-+My+Part+In+His+Downfall","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eef9024d92ce9228a386803869b6363f02424d80","infoHashBuffer":{"type":"Buffer","data":[238,249,2,77,146,206,146,40,163,134,128,56,105,182,54,63,2,66,77,128]},"announce":[],"urlList":[]}}