{"title":"Mysterious Ways S01E11-15 DIVX - Xenn99","uid":3597958,"size":1836027904,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ef7f25d47fd8012d1d9343a7f3fe4d52960b5dd4&amp;dn=Mysterious+Ways+S01E11-15+DIVX+-+Xenn99&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Xenn99","files":5,"time":1169076704,"description":"So looks like a lot of folks did like these eps,\ncause downloads of them went through the roof,\nToo bad not that many people stay seeding the files,\nif i have to upload 10gb per piece it&amp;#039;ll take longer to spread all eps..\n\nLet&amp;#039;s all help one another right ;-)\n\nSame as me helping you get these eps.\n\nLike to see more comments, for the ones i already had,\nthanks man you guys keep me going ;-)\n\nHere&amp;#039;s the eps list again:\n\n\n1011 - &quot;Stranger In the Mirror&quot; \nOriginal Airdate: PAX 11/14/2K \nWhen his student, a good-natured slacker, claims to experience memories of a stranger&amp;#039;s life, Declan thinks it&amp;#039;s a ruse to attract Miranda. But he discovers that his student may be channeling an urgent message from the victim of a twenty-year-old murder. \n\n1012 - ?Dead Dog Walking? \nOriginal Airdate: NBC 1/22/2001 \nWhile Peggy treats a patient who suffers a near death experience during surgery, Declan investigates a foreign cardiologist wooing Peggy and discovers he isn?t a doctor at all. Fearing that Peggy is being courted by a conman Declan checks into his background and unearths the mysterious disappearance of his last widowed conquest. \n\n1013 - ?Crystal Clear? \nOriginal Airdate: PAX 11/7/2K \nA window washer miraculously survives a fall from a high-rise building, landing in the car of a businesswoman. Declan is especially intrigued because of similarities to his own ?second chance? (surviving an avalanche). But when he tries to help the window washer, things start going wrong and Declan and Peggy begin to wonder if the person getting the second chance is the window washer or the businesswoman. \n\n1014 - ?19A? \nOriginal Airdate: PAX 1/9/2001 \nDeclan hears about a man who had a premonition of a recent plane crash. When Declan investigates whether or not the premonition was real or just a fabrication he makes a startling discovery which could alter the lives of two families forever. \n\n1015 - &quot;Reason to Cry&quot; \nOriginal Airdate: PAX 12/19/2K \nAs a funeral takes place in an inner city church from another gang related shooting, something unbelievable occurs - an image on a stained-glass window begins weeping tears of blood. In the midst of Declan&amp;#039;s investigation, another miracle occurs within the community - the people, taking the icon&amp;#039;s tears as a message to stop the violence, begin banding together, helping the gangs to resolve their differences. Declan is left with the moral dilemma of disproving this &amp;#039;miracle&amp;#039; to a community in desperate need of an answered prayer. \n\n\n\nSo Have fun, put some nice comments here, and of course keep seeding, so i can keep uploading ;-)","torrent":{"xt":"urn:btih:ef7f25d47fd8012d1d9343a7f3fe4d52960b5dd4","amp;dn":"Mysterious+Ways+S01E11-15+DIVX+-+Xenn99","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef7f25d47fd8012d1d9343a7f3fe4d52960b5dd4","infoHashBuffer":{"type":"Buffer","data":[239,127,37,212,127,216,1,45,29,147,67,167,243,254,77,82,150,11,93,212]},"announce":[],"urlList":[]}}