{"title":"Imtoo PodWorks Platinum 5.0.0.1330 BlackAngelDooms","uid":7120266,"size":31616670,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:eff34f9a9257857e0518da9887b263f113eb87a1&amp;dn=Imtoo+PodWorks+Platinum+5.0.0.1330+BlackAngelDooms&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BlackAngelDoom","files":1,"time":1332345915,"description":"\nBlackAngelDooms RE! Mean to be simple, clean and easy!\nBuy software, support developer\n\nImTOO PodWorks Platinum\n\nUltimate iPod Transfer Solutions\n\nHere's the solution to all your ripping, copying, converting and transferring problems on iPod, even iPhone! ImTOO PodWorks Platinum is the ultimate iTunes-alternative and upgrade - which can convert DVD, video, and audio files such as AVI, MPEG, WMV, WMA, etc. to iPod files and transfer them to iPod, backup iPod files to computer, download online videos from top online sites, create photo albums/iPhone ringtones, manage several devices at the same time and much more!\n\nBackup iPod Contents and Rebuild iTunes Library from iPod\n\niTunes library is empty? Build your iTunes library from iPod; synchronize iTunes with your iPod. Using ImTOO PodWorks Platinum, you can simply copy iPod songs, movies, videos to computer and to your iTunes library.\nDon't let iTunes limit your options, do more with ImTOO PodWorks Platinum!\n\n* Transfer, backup and manage iPod Music, Movies, eBooks, SMS and iPhone Ringtones.\n* Rip DVD/CD discs to iPod compatible video/audio formats and transfer directly to iPod or iTunes.\n* Transfer data via Wi-Fi\n* Convert video and audio in any format and transfer to iPod.\n* Download online videos for iPod from the top rated online video websites like YouTube.\n* Create personalized iPhone ringtones from audios and videos and transfer to iPhone or iTunes.\n* Transfer eBooks in PDF and EPUB formats between iPod touch/iPhone and PC directly without iTunes.\n\nNote:\n1. Continue seed coz my net so slow\n2. Run exe file\n3. Type any name and serial at registration form\n4. Enjoy and ready to work\n5. Support dev, buy software if used often\n6. :thumbsup: Seed more :thumbsup:\n\n\nVirus Issue\nCreated, Tested, scanned in Windows XP SP3 with KIS 2012, NETFX 2.0 and DeepFreeze\n\ndon't forget give comment, let we know work or not.\nPlease spare more time for seed, my upload very low.\n\nBlack Angel Doom\nJust call me ÂµBaDÂµ","torrent":{"xt":"urn:btih:eff34f9a9257857e0518da9887b263f113eb87a1","amp;dn":"Imtoo+PodWorks+Platinum+5.0.0.1330+BlackAngelDooms","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eff34f9a9257857e0518da9887b263f113eb87a1","infoHashBuffer":{"type":"Buffer","data":[239,243,79,154,146,87,133,126,5,24,218,152,135,178,99,241,19,235,135,161]},"announce":[],"urlList":[]}}