{"title":"Shakti Gawain, Meditations (Unabridged)","uid":5722499,"size":37344801,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:f0302d0907bcd8a5b83de4fe21ef2db9ecb7e35c&amp;dn=Shakti+Gawain%2C+Meditations+%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":1,"time":1280331973,"description":"Audiobook length 2:36:51.41 \n\n\nAbout the Author: Shakti Gawain \n\nShakti Gawain is a pioneer in the field of personal development. For over twenty-five years, she has been a best-selling author and internationally renowned teacher of consciousness. Shakti has facilitated thousands of individuals in developing greater awareness, balance and wholeness in their lives.\n\nShakti has written numerous books considered classics in her field. Her distinguished publishing history includes best sellers Creative Visualization, Living in the Light, The Path of Transformation, Four Levels of Healing, Creating True Prosperity, and Developing Intuition. Her books have sold over 10 million copies and have been translated into more than thirty languages. She is the co-founder, with Marc Allen, of New World Library Publishing Company. More...\n\nThe guided meditations found on this audio book (read by the author) offer easy-to-implement approaches to finding and following inner guidance, including creating an inner sanctuary, using relationships as mirrors, balancing male and female energies, discovering and creating true prosperity, and envisioning a better future. These meditations will benefit anyone needing to reconnect with the basic principles of living in harmony with oneself and others.\n\nHeal and enjoy LIFE!!!!! Good Luck","torrent":{"xt":"urn:btih:f0302d0907bcd8a5b83de4fe21ef2db9ecb7e35c","amp;dn":"Shakti+Gawain%2C+Meditations+%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0302d0907bcd8a5b83de4fe21ef2db9ecb7e35c","infoHashBuffer":{"type":"Buffer","data":[240,48,45,9,7,188,216,165,184,61,228,254,33,239,45,185,236,183,227,92]},"announce":[],"urlList":[]}}