{"title":"Osho_Bodhidharma The Greatest Zen Master-13.avi","uid":15771273,"size":244828346,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f03a3639a0bd1cc5dd871a8bc268963e104355d1&amp;dn=Osho_Bodhidharma+The+Greatest+Zen+Master-13.avi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drugarica","files":1,"time":1473205947,"description":"File size                                : 233 MiB\r\nDuration                                 : 2h 17mn\r\nOverall bit rate                         : 238 Kbps\r\nWidth                                    : 400 pixels\r\nHeight                                   : 304 pixels\r\nDisplay aspect ratio                     : 4:3\r\nFrame rate                               : 15.000 fps\r\n\r\nFormat                                   : MPEG Audio\r\nCodec ID/Hint                            : MP3\r\nBit rate                                 : 32.0 Kbps\r\nChannel(s)                               : 1 channel\r\nSampling rate                            : 32.0 KHz\r\n\r\nBodhidharma: The Greatest Zen Master\r\nChapter #13\r\nChapter title: Mind is the bondage\r\n11 July 1987 am in Gautam the Buddha Auditorium\r\n\r\nLength: \t129 mins\r\n\r\nBELOVED OSHO,\r\n\r\nWITHOUT THE MIND THERE'S NO BUDDHA MEANS THAT THE BUDDHA COMES FROM THE MIND .... WHOEVER WANTS TO SEE A BUDDHA SEES THE MIND BEFORE HE SEES THE BUDDHA ...ONCE YOU'VE SEEN THE BUDDHA, YOU FORGET ABOUT THE MIND. IF YOU DON'T FORGET ABOUT THE MIND, THE MIND WILL CONFUSE YOU ....\r\nMORTALITY AND BUDDHAHOOD ARE LIKE WATER AND ICE. TO BE AFFLICTED BY THE THREE POISONS IS MORTALITY. TO BE PURIFIED BY THE THREE RELEASES IS BUDDHAHOOD. THAT WHICH FREEZES INTO ICE IN WINTER MELTS INTO WATER IN SUMMER. ELIMINATE ICE, AND THERE'S NO MORE WATER. GET RID OF MORTALITY, AND THERE'S NO MORE BUDDHAHOOD. CLEARLY, THE NATURE OF ICE IS THE NATURE OF WATER ....\r\nMORTALS LIBERATE BUDDHAS AND BUDDHAS LIBERATE MORTALS. THIS IS WHAT'S MEANT BY IMPARTIALITY. MORTALS LIBERATE BUDDHAS BECAUSE AFFLICTION CREATES AWARENESS. AND BUDDHAS LIBERATE MORTALS BECAUSE AWARENESS NEGATES AFFLICTION. THERE CAN'T HELP BUT BE AFFLICTION. AND THERE CAN'T HELP BUT BE AWARENESS. IF NOT FOR AFFLICTION, THERE WOULD BE NOTHING TO CREATE AWARENESS. AND IF NOT FOR AWARENESS, THERE WOULD BE NOTHING TO NEGATE AFFLICTION. WHEN YOU'RE DELUDED, BUDDHAS LIBERATE MORTALS. WHEN YOU'RE AWARE, MORTALS LIBERATE BUDDHAS. BUDDHAS DON'T BECOME BUDDHAS ON THEIR OWN. THEY'RE LIBERATED BY MORTALS. BUDDHAS REGARD DELUSION AS THEIR FATHER AND GREED AS THEIR MOTHER. DELUSION AND GREED ARE DIFFERENT NAMES FOR MORTALITY ....\r\nWHEN YOU'RE DELUDED, YOU'RE ON THIS SHORE. WHEN YOU'RE AWARE, YOU'RE ON THE OTHER SHORE. BUT ONCE YOU KNOW YOUR MIND IS EMPTY AND YOU SEE NO APPEARANCES, YOU'RE BEYOND DELUSION AND AWARENESS. AND ONCE YOU'RE BEYOND DELUSION AND AWARENESS, THE OTHER SHORE DOESN'T EXIST. THE TATHAGATA ISN'T ON THIS SHORE OR THE OTHER SHORE. AND HE ISN'T IN MIDSTREAM. ARHATS ARE IN MIDSTREAM, AND MORTALS ARE ON THIS SHORE. ON THE OTHER SHORE IS BUDDHAHOOD.\r\n\r\nBodhidharma has insights which are unparalleled. There have been many disciples of Gautam Buddha who have attained to enlightenment, but nobody has shown such great insightfulness. Either they have remained silent or they have spoken, but neither their silence nor their speaking has reached to the heights and to the depths of","torrent":{"xt":"urn:btih:f03a3639a0bd1cc5dd871a8bc268963e104355d1","amp;dn":"Osho_Bodhidharma+The+Greatest+Zen+Master-13.avi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f03a3639a0bd1cc5dd871a8bc268963e104355d1","infoHashBuffer":{"type":"Buffer","data":[240,58,54,57,160,189,28,197,221,135,26,139,194,104,150,62,16,67,85,209]},"announce":[],"urlList":[]}}