{"title":"Nanosilicon - Properties, Synthesis, Applications, Methods of An","uid":15391362,"size":16371199,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f0a0b1f88b18cdcc7eec9f4727abae7ae70d66d3&amp;dn=Nanosilicon+-+Properties%2C+Synthesis%2C+Applications%2C+Methods+of+An&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1469347416,"description":"Nanosilicon - Properties, Synthesis, Applications, Methods of Analysis and Control - A.A. Ischenko et al. (CISP, 2015).pdf\r\n\r\nNanosilicon: Properties, Synthesis, Applications, Methods of Analysis and Control examines the latest developments on the physics and chemistry of nanosilicon. The book focuses on methods for producing nanosilicon, its electronic and optical properties, research methods to characterize its spectral and structural properties, and its possible applications.\r\n\r\nThe first part of the book covers the basic properties of semiconductors, including causes of the size dependence of the properties, structural and electronic properties, and physical characteristics of the various forms of silicon. It presents theoretical and experimental research results as well as examples of porous silicon and quantum dots.\r\n\r\nThe second part discusses the synthesis of nanosilicon, modification of the surface of nanoparticles, and properties of the resulting particles. The authors give special attention to the photoluminescence of silicon nanoparticles.\r\n\r\nThe third part describes methods used for studying and controlling the structure and properties of nanocrystalline silicon. These methods include standard ones, such as electron microscopy, spectroscopy, and diffraction, as well as novel techniques, such as femtosecond spectroscopy, ultrafast electron nanocrystallography, and dynamic transmission electron microscopy.\r\n\r\nThe fourth part details some of the practical applications of nanocrystalline silicon, including the use of nanoparticles as additives–absorbers of UV radiation in sunscreens.\r\n\r\nIncorporating much of the authors’ own extensive research results, this book provides a systematic account of the scientific problems of nanosilicon and its potential practical applications. It will help readers understand current and emerging applications and research methods of this unique material","torrent":{"xt":"urn:btih:f0a0b1f88b18cdcc7eec9f4727abae7ae70d66d3","amp;dn":"Nanosilicon+-+Properties%2C+Synthesis%2C+Applications%2C+Methods+of+An","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0a0b1f88b18cdcc7eec9f4727abae7ae70d66d3","infoHashBuffer":{"type":"Buffer","data":[240,160,177,248,139,24,205,204,126,236,159,71,39,171,174,122,231,13,102,211]},"announce":[],"urlList":[]}}