{"title":"Dean Koontz - Breathless (Unabridged) Audiobook","uid":6483081,"size":296608037,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f19987b3671b4e4a85ff22fd40759cd8e7d5b92a&amp;dn=Dean+Koontz+-+Breathless+%28Unabridged%29+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LittleBlkDress","files":7,"time":1308602947,"description":"80 kpbs\n\n8 hrs and 12 mins\n\nGrady Adams lives a simple, solitary life deep in the Colorado mountains. Here the 35-year-old carpenter works out of a converted barn, crafting exquisite one-of-a-kind furniture. There's little about this strong yet gentle man to suggest the experiences that have alienated him from the contemporary world. But that is about to change.\n\nOne day, while hiking, Grady spots a pair of stunningly beautiful furred animals unlike anything he's ever seen. They flee the instant they detect his presence, but the mystery of that brief encounter remains. In the days ahead, Grady will approach the creatures again, gaining their trust but coming no closer to solving their mystery. For this he enlists the help of an old friend, veterinarian Camellia &quot;Cammy&quot; Rivers, who, in turn, is stunned - and enchanted - by Grady's new &quot;pets.&quot; But while Grady and Cammy carefully observe these enigmatic animals for clues to their origin, they, too, are being watched.\n\nSoon Grady's home and hundreds of square miles of surrounding wilderness will be placed under quarantine by Homeland Security. And Grady, Cammy, and the two creatures they've come to feel they must protect at all costs find themselves virtual prisoners - and the unwilling focus of an army of biologists, naturalists, and research scientists. But it's a stunning event no one could have foreseen that convinces Grady and Cammy to do the unthinkable: to escape with the two creatures on a riveting race for freedom. ","torrent":{"xt":"urn:btih:f19987b3671b4e4a85ff22fd40759cd8e7d5b92a","amp;dn":"Dean+Koontz+-+Breathless+%28Unabridged%29+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f19987b3671b4e4a85ff22fd40759cd8e7d5b92a","infoHashBuffer":{"type":"Buffer","data":[241,153,135,179,103,27,78,74,133,255,34,253,64,117,156,216,231,213,185,42]},"announce":[],"urlList":[]}}