{"title":"Cerebus - Chuch &amp; State I","uid":8644491,"size":322373759,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f26d5f9b1c823e4c0e997bea83de0dad0d7ed708&amp;dn=Cerebus+-+Chuch+%26amp%3B+State+I&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fudoh101","files":29,"time":1372955079,"description":"Issue 52-80.\nThe first Church &amp; State story.\nPublished by Aardvark 1983-1985\n\nChurch and State is volume three of the Cerebus the Aardvark series and picks up right where High Society leaves off. To compound matters further, this reprint volume is part one of a two-part story that is self-contained within the larger framework.\nA face from Cerebus's past returns with an offer he can't refuse. But the gray one has learned a few lessons from the powers that be and turns the tables on the would-be puppet masters. This volume also marks the addition of Gerhard as a background artist, and the artwork begins to create a visual impact equal to the creative impact of the comic book's ideas and stories. The storytelling also becomes subtler, the beginning of a stylistic trademark in Cerebus that leads the reader to believe more action is taking place peripherally than in the actual pages. High points include a two-part dream sequence, which is visually unparalleled in the history of comic art; a pee-break which is unrivaled in length in the history of comic art; the return of Jaka; and &quot;the baby incident.&quot; Don't forget to pick up Church and State, Volume Two , as volume one ends with the cruelest of cliffhangers. This is the Ivan the Terrible of graphic novels, both in terms of its subject matter and the creative peak it represents for the author.","torrent":{"xt":"urn:btih:f26d5f9b1c823e4c0e997bea83de0dad0d7ed708","amp;dn":"Cerebus+-+Chuch+%26amp%3B+State+I","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f26d5f9b1c823e4c0e997bea83de0dad0d7ed708","infoHashBuffer":{"type":"Buffer","data":[242,109,95,155,28,130,62,76,14,153,123,234,131,222,13,173,13,126,215,8]},"announce":[],"urlList":[]}}