{"title":"Labuat.-.Labuat.(2009).Pop.","uid":4741003,"size":90126254,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f2c308a4e34112e12b676f903cc4b9444d77cb02&amp;dn=Labuat.-.Labuat.%282009%29.Pop.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LDivx","files":13,"time":1235560570,"description":"Fecha Lanzamiento: 24/02/2009 \n\nEstilo: Pop-Rock - Alternativa \n\nDescripcion:\nLabuat es un proyecto musical nacido de la imaginaciÃƒÂ³n que lleva aÃƒÂ±os gestÃƒÂ¡ndose. Producido por Risto Mejide, con The Pinker Tones (duo de mÃƒÂºsico electronica de enorme proyecciÃƒÂ³n internacional y productores de gran prestigio) en la coproducciÃƒÂ³n y los arreglos y la voz de Virginia Maestro, la mÃƒÂºsica de Labuat es una plataforma abierta donde convergen estilos, tendencias y mÃƒÂºsicos reunidos para crear una historia diferente y enriquecerse mutuamente. Es el sonido Labuat. \n\nLabuat llega avalado por el equipo de producciÃƒÂ³n mÃƒÂ¡s imaginativo y sorprendente (Risto Mejide y The Pinker Tones), con diez canciones que se mueven con soltura por estilos diversos, que degusta los sonidos analÃƒÂ³gicos, que huye de lo artificial y es tan diferente como cada uno de los pilares que sustentan a la banda. En Labuat pueden aparecer sonidos de los 70, trompetas cool, aires de bossa, influencias del pop britÃƒÂ¡nico de los 60 mezcladas con canciÃƒÂ³n melÃƒÂ³dica, sonidos vintage convertidos en contemporÃƒÂ¡neos, algo de funk, aromas de jazz, dance combinado con reggae-ska, pop y soul, referencias a Burt Bacharach o a los aÃƒÂ±os 20 del pasado siglo... Todo amparado por una producciÃƒÂ³n de gran potencia, capaz de descubrir el mejor groove y conservar la delicadeza y la fuerza con cierto velo naÃƒÂ¯f, sin perder la capacidad de sorpresa para crear una mÃƒÂºsica estimulante, abierta, estÃƒÂ¡ndar y contemporÃƒÂ¡nea al mismo tiempo. Siempre distinta. \n\nSoy tu aire es la canciÃƒÂ³n que presenta a Labuat, el primer single de un ÃƒÂ¡lbum que llega para enriquecer y alterar la escena musical espaÃƒÂ±ola. A ritmo de vals, con aroma Beatle, una melodÃƒÂ­a marcada por el clasicismo y un sorprendente final con orquestaciÃƒÂ³n de cuerda, es un buen ejemplo de la propuesta de Labuat. \n\nEn el disco han colaborado mÃƒÂºsicos como Polo OrtÃƒÂ­, Alberto PÃƒÂ©rez, Juzz Ubach o DJ NiÃƒÂ±o, la voz de Virginia Maestro vuela como nueva, original, envuelta en un proyecto que es de todos y que se enriquece con sus aportaciones. Labuat ha hecho la mÃƒÂºsica que le gustarÃƒÂ­a escuchar a los que han participado en su elaboraciÃƒÂ³n y garantiza imaginaciÃƒÂ³n, compromiso musical y buen hacer. \n\nEs Labuat, una fantasÃƒÂ­a musical, aire nuevo, canciones que caminan por senderos diferentes. La mÃƒÂºsica por descubrir.\n\nCanciones:\n1. De pequeÃƒÂ±o\n2. Ayer\n3. Mentiras a contraluz\n4. Soy tu aire\n5. Lo raro es vivir\n6. Defineme sin ti\n7. Carta de otoÃƒÂ±o\n8. Al margen\n9. Llueve mal\n10. Ya se verÃƒÂ¡","torrent":{"xt":"urn:btih:f2c308a4e34112e12b676f903cc4b9444d77cb02","amp;dn":"Labuat.-.Labuat.%282009%29.Pop.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2c308a4e34112e12b676f903cc4b9444d77cb02","infoHashBuffer":{"type":"Buffer","data":[242,195,8,164,227,65,18,225,43,103,111,144,60,196,185,68,77,119,203,2]},"announce":[],"urlList":[]}}