{"title":"HOLLYWOODiSM (DVD5, 1997)","uid":8436612,"size":4513454080,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f39df780606dd57c8a1f51cde144c45dd5c8f551&amp;dn=HOLLYWOODiSM+%28DVD5%2C+1997%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cockymountainoyster","files":-1,"time":1367659197,"description":"HOLLYWOODiSM (DVD5, 1997)\n\n&quot; A New Global Religion: HOLLYWOODiSM! &quot;\n\nTHEY FLED A NiGHTMARE, TO BUiLD A DREAM\nJEWS, MOViES, AND THE AMERiCAN DREAM\n\n&quot;Stunning...a lucid inviting work of social history...shrewdly on target&quot; ~ NYT\n\nIn the 1920's and 30's, movie houses became temples of the new Hollywood religion, Jewish values made kitsch. 75% of all Americans went to the movies at least once a week. Actors became the gods and godesses of the new American religion, and where there are new gods, there must be new idols, so the studio heads began a movie guild with the lofty title of 'The Academy of Motion Picture Arts &amp; Sciences', it was Mayer's brilliant idea to create the Oscars, where the movie moguls could honor themselves, by giving themselves awards..\n\n&quot;In the White House, President Eisenhower signs a bill authorizing a gold medal for composer Irving Berlin, it honors him for writing 'God bless America', and other patriotic songs. For Irving Berlin, this marks another milestone in his rise from humble beginnings, to a place of highest esteem, the world over.&quot;\n\n&quot;The movies were a tremendous propaganda tool during ww2. They setup camps for the soldiers to come back in, where movies were shown 24 hours a day, because that impressed the soldiers with what they were fighting for.&quot; ~ Prof. Les Friedman, Author/Historian\n\n&quot;All of the these men who founded Hollywood were born within a 500-mile radius of each-other, and all of them wound up roughly within 15 miles of one-another, in Los Angeles. One could say that the the American dream was really born in eastern Europe.&quot; ~ Neal Gabler, Author/Critic\n\n&quot;From Poland to polo in just one generation. They had left the old-world penniless, and in less than 20 years, they had become the highest paid executives in America. In fact for almost a decade, Mayer was the highest salaried man in the world.&quot;\n\n&quot;...I didn't even know what his real name was, I didn't know the little village that he came from, I knew nothing about his life, and I realized that the name Warner was probably not correct, but I thought being Polish, it might have been Verner. To this day I really don't know what our original name was.&quot; ~ Betty Warner Sheinbaum, daughter of Harry Warner\n\nOften the first thing to go was the Jewish name..\n Issur Danielovitch Demsky became Kirk Douglas, etc, etc..\nThe Bolsheviks used the same tactic to infiltrate Russia, using war-names.\n\n&quot;...Moviegoing was religious, because it had to with worship, it had to do with the screen being larger than you were, and you being in awe of what you were looking at, and feeling a certain reverence for it; maybe you could say a bogus spirituality, but it was a spirituality still that was believed in.&quot; ~ Jonathan Rosenbaum, Author/Critic\n\nThis film documents the reinvention of America through the life experiences of Hollywood's future movie moguls. Hollywoodism follows these men as they immigrated to America, their success in nickelodeons, and their journey to Hollywood, where they ruled the movie industry for more than three decades.\n\nFirst hand accounts of the moguls are told through a series of original interviews with their children and grandchildren, in addition to comments by film historians, critics, actors, producers and contemporary moguls.\n\nUsing never before seen home movies, behind the scenes studio films, rare archive footage, and golden-era movie clips, Hollywoodism presents the history of Hollywood as it has never been seen before.\n\n&quot;They created their own America, an America which is not the real America, it's their own version of the real America, but ultimately, this shadow America becomes so popular, and so widely disseminated, that it's images and it's values come to devour the real America.&quot; ~ Neal Gabler, Author/Critic\n\nAs usual, stories are taken out of context, and rosy pictures of the media moguls and their empires are presented in this film. The Hollywood moguls went west, to escape the rift between Gentiles and Jews, in 1912. Just look at what happened in 1913, with the creation of the ADL by the B'nai B'rith (allegedly because of Leo Frank the rapist being lynched), and then the creation of the Federal Reserve coincidentally, only two months later. There was very good reason for Christians, Americans, English, Europeans, and Russians to fear Jewish power. Ask a Palestinian how he is treated today, and how he is portrayed by the Jewish media empire.\n\n&quot;We have almost no testimony from these Hollywood Jews on their reaction to what they saw, we have no idea really, of how deeply it impacted them. All we know is when they returned to the United States, one might think that someone there might have been moved, to make some film, or at least some gesture that would memorialize the 'six' million who died. And what is interesting, is the absence of any such film, or any such gesture.&quot; ~ Neal Gabler, Author/Critic\n\nPerhaps that's because they just finished making war-propaganda in Europe for the postwar-machine and zionism, including 'nazi-shrunken heads', lampshades made of human skin, and homicidal gas-chambers (etc), and didn't want to blow their cover, and be blamed for such heinous lies against the German people, who had just lost a genocidal war, where at least 60 million people died worldwide.\n\nalleged humanskin lampshade lie - http://postimg.org/image/4ltgnmuyr\nBilly Wilder, Buchenwald propaganda - http://postimg.org/image/i1ghd33gj\n\n&quot;Many immigrants in fact talked about their last moment in Russia, where they turned around and spit.&quot; ~ Prof. Hasia Diner, Author/Historian\n\nSome spit on Christians in israel too. \n\nFaith is much more powerful than you know; and coupled with the ring of truth, and with understanding, that power is exponential, enough to set you free.\n\nRuntime: 98m\n\nScreens: &lt;a href=&quot;\nhttp://postimg.org/image/qwt4idxav&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/qwt4idxav&lt;/a&gt; &lt;a href=&quot;\nhttp://postimg.org/image/5ok1ep87r&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/5ok1ep87r&lt;/a&gt; &lt;a href=&quot;\nhttp://postimg.org/image/nnepbx97b&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/nnepbx97b&lt;/a&gt; &lt;a href=&quot;\nhttp://postimg.org/image/oyr1y4u6v&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/oyr1y4u6v&lt;/a&gt; &lt;a href=&quot;\nhttp://postimg.org/image/aohhmnduf&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/aohhmnduf&lt;/a&gt; &lt;a href=&quot;\nhttp://postimg.org/image/4tswexazb&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/4tswexazb&lt;/a&gt; &lt;a href=&quot;\nhttp://postimg.org/image/55acrorfb&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/55acrorfb&lt;/a&gt; &lt;a href=&quot;\nhttp://postimg.org/image/rl1z1bw0n&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/rl1z1bw0n&lt;/a&gt; &lt;a href=&quot;\nhttp://postimg.org/image/3zay6msif&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/3zay6msif&lt;/a&gt; &lt;a href=&quot;\nhttp://postimg.org/image/s6vjb6ggn&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/s6vjb6ggn&lt;/a&gt; &lt;a href=&quot;\nhttp://postimg.org/image/d8d4gr1ef&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/d8d4gr1ef&lt;/a&gt;\n\nThe DVD *is* being seeded, despite what the counter says.\n\nTo all good people who seed the DVDs they like, thank you very much! \n\nReel Bad Arabs (DVD5, 2006) &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8430478/Reel_Bad_Arabs_%28DVD5__2006%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8430478/Reel_Bad_Arabs_%28DVD5__2006%29&lt;/a&gt;\n\nGODS OF ENTERTAiNMENT (DVD5) &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8413130/GODS_OF_ENTERTAiNMENT&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8413130/GODS_OF_ENTERTAiNMENT&lt;/a&gt;\n\nOCCUPATiON 101 (DVD9, 2006)  &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8428209/OCCUPATiON_101_%28DVD9__2006%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8428209/OCCUPATiON_101_%28DVD9__2006%29&lt;/a&gt;\n\nThe Other Israel: The Whole Zionist Conspiracy (DVD5) &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/7422633/The_Other_Israel__The_Whole_Zionist_Conspiracy&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/7422633/The_Other_Israel__The_Whole_Zionist_Conspiracy&lt;/a&gt;\n\nHOLOCAUST BUCHENWALD_Dumb_Dumb_Portrayal_of_Evil_DVD &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/6547002/HOLOCAUST_BUCHENWALD_Dumb_Dumb_Portrayal_of_Evil_DVD&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/6547002/HOLOCAUST_BUCHENWALD_Dumb_Dumb_Portrayal_of_Evil_DVD&lt;/a&gt;\n\nThe Truth Behind the Gates of Auschwitz - by David Cole\nvimeo dawt com/24438331\n\nThe Last Days of the Big Lie\nvimeo dawt com/42876437\n\nMore DVD movies: &lt;a href=&quot;\nhttp://thepiratebay.se/user/cockymountainoyster&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/cockymountainoyster&lt;/a&gt;","torrent":{"xt":"urn:btih:f39df780606dd57c8a1f51cde144c45dd5c8f551","amp;dn":"HOLLYWOODiSM+%28DVD5%2C+1997%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f39df780606dd57c8a1f51cde144c45dd5c8f551","infoHashBuffer":{"type":"Buffer","data":[243,157,247,128,96,109,213,124,138,31,81,205,225,68,196,93,213,200,245,81]},"announce":[],"urlList":[]}}