{"title":"African Virtuosos - The Classic Guinean Guitar Group TQMP","uid":4748674,"size":363369629,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f57d3421d947a868aa9fb82cf8e006223df9a96b&amp;dn=African+Virtuosos+-+The+Classic+Guinean+Guitar+Group+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Breezin","files":17,"time":1236075551,"description":"Quote from amazon (avg. 5 star rating :)\n\n&quot;An amazing acoustic CD. This is the best album/cd to come since Talking Timbuktu with Ry Cooder and Ali Farka Toure. While it is a re-release it should be considered for album of the year or re-release of the year if you may. Tracks 1 and 3 are simplistic in thier beauty and beautiful in thier simplicity. This album/cd will quickly be rediscovered and be considered a classic. I hope they plan on printing enough...Martin Sinnock of The Beat Magazine and The Afro Beat on Totallyradio considers the album one of the best accoustic albums of all time...&quot; \n\nExcerpt from CD Cover \n\n&quot;When it comes to African Guitar music, Guinea holds a very special place. And when it comes to Guinean guitar music, it doesn't get better than the African Virtuoses. Their story goes to the very heart of the emergence of the guitar as a bona fide African instument in the early era of independence in the 1960's and 1970's, and is inextricably linked with one of the most illustrious guitar playing famlies in Africa, the four Diabate brother heard here. These wonderful, rare recordings of various formations of the African Virtuoses, made in Conakry and Abidjan between 1970 and 1983, showcase acoustic African guitar playing at its most intimate and virtuosic.&quot; \n\nComments from Sterns: \n\nOne moment you think it's Spanish, the next you are convinced it is from Peru, until, hearing echoes of Django Reinhardt, you decide on Paris. But each time you are wrong! The group of acoustic guitars featured on this album is 100% African, with roots firmly embedded in Guinean folklore. These tracks reveal acoustic African guitar playing at its most intimate and beguiling. Classis instrumental recordings that showcase the gorgeous acoustic guitars of the legendary Guinean group: African Virtuoses. Beautifully re-mastered editions of hard-to-obtain tracks, long-prized by collectors. Historic music - yet one that is as valid and relevant today as when first recorded in the 70s and early 80s&quot; \n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project me and my fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:   &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project! Since all TQMP torrents are tracked by countless other trackers by now, the lifetime of your uploads will increase by a BIG margin ;)\n\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless FLAC format AND include artwork. Include .cue, .m3u and logfiles in the torrent and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nYou can find all TQMP uploads at: www.thepiratebay.se/tag/tqmp\n\nContact: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;30524255554a595e705c5946551e5e5c&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nGreetings to ya'all from the Breezin Dutchman! d:)","torrent":{"xt":"urn:btih:f57d3421d947a868aa9fb82cf8e006223df9a96b","amp;dn":"African+Virtuosos+-+The+Classic+Guinean+Guitar+Group+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f57d3421d947a868aa9fb82cf8e006223df9a96b","infoHashBuffer":{"type":"Buffer","data":[245,125,52,33,217,71,168,104,170,159,184,44,248,224,6,34,61,249,169,107]},"announce":[],"urlList":[]}}