{"title":"Cursive - Discography (1998-2003) [FLAC] politux","uid":5725573,"size":941337812,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:f609e098301e81a2f24b6d54955a298657e8b492&amp;dn=Cursive+-+Discography+%281998-2003%29+%5BFLAC%5D+politux&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":42,"time":1280452832,"description":"As early as 1995, the original members of Cursive -- Tim Kasher on guitar and vocals, Clint Schnase on drums, Matt Maginn on bass, and Stephen Pederson on guitar -- began work on their newly christened project, experimenting with elements of indie rock and eclectic post-hardcore to fashion a unique sound. The Omaha, NE-based four-piece came out of existing friendships and some of the members' previous work together in Slowdown Virginia, making the musical partnership a logical idea from the start. They debuted with the Disruption 7&quot; on the local friend-run label Saddle Creek and shortly released a second 7&quot;, Sucker and Dry, on New York-based Zero Hour. Both recordings spotlighted Kasher's uniquely powerful voice along with the group's consistently thundering rhythm section and jagged guitars. Cursive went even further on their debut full-length, Such Blinding Stars for Starving Eyes. Split-released by Crank! A Record Company and New York's Interplanetary Truckers Union in 1997, the LP received high acclaim and put the band on the musical map. \n\nOver the next year, Cursive released both a split 10&quot; with Austin's Silver Scooter (also on Crank!) and yet another 7&quot; entitled Disruption. The latter record began the band's extensive future with Saddle Creek, and in November of 1998, the label released the group's second full-length, The Storms of Early Summer: Semantics of Song. The LP saw the band's first real attempt at incorporating linked lyrical concepts, as Kasher's lyrics told the tale of a man's complete breakdown over the aggressive song structures. Unfortunately for their growing fan base, the record didn't even yield a tour and instead saw the members disband to work on other projects, with no mention of a reunion at some later date. \n\nAfter the temporary split, the members of Cursive explored a number of different outlets (including Commander Venus and Bright Eyes). After a failed marriage and some real introspection, however, the group decided to give things another shot, a fortunate conclusion that in June of 2000 resulted in the realization of Domestica. Full of fractured rhythms and lyrical examinations of a couple's crumbling relationship, the album spun a story that carried an odd familiarity to the real life experiences of Kasher. Domestica also introduced a new Cursive member, vocalist/guitarist/songwriter Ted Stevens, formerly of Lullaby for the Working Class. (Pederson bowed out of the group to continue his education at Duke University; he later formed White Octave.) \n\nNovena on a Nocturn, the debut of Kasher's solo project, the Good Life, was released in 2001. Also notable was the release of another Cursive EP, Burst and Bloom, which added cellist Gretta Cohn to the band's lineup. Meanwhile, Cursive were featured on the first 7&quot; in Makato Recordings' yearlong monthly 7&quot; series, and the quintet returned in 2003 with The Ugly Organ. Their most ambitious album to date, The Ugly Organ was hailed for its challenging songwriting, obtuse conceptual scope, and serious lyrical turns\n\n\nSource: CD\nLabel: Saddle Creek Records\nGenre: Rock\nStyle: Indie \nQuality: FLAC\n\nAlbums:\n\nThe Storms of Early Summer (1998) \n\nDomestica (2000)\n\nBurst and Bloom EP (2002) \n\nThe Ugly Organ (2003)","torrent":{"xt":"urn:btih:f609e098301e81a2f24b6d54955a298657e8b492","amp;dn":"Cursive+-+Discography+%281998-2003%29+%5BFLAC%5D+politux","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f609e098301e81a2f24b6d54955a298657e8b492","infoHashBuffer":{"type":"Buffer","data":[246,9,224,152,48,30,129,162,242,75,109,84,149,90,41,134,87,232,180,146]},"announce":[],"urlList":[]}}