{"title":"Brian Hicks - When The Dancing Stopped","uid":9712259,"size":362092390,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f74cf40dca6039b7a50b3ab0915757c363264e8e&amp;dn=Brian+Hicks+-+When+The+Dancing+Stopped&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sidmal","files":-1,"time":1394123417,"description":"\nWhen the Dancing Stopped: The Real Story of the Morro Castle Disaster and Its Deadly Wake (Audiobook) By Brian Hicks, read by Dick Hill\n Unabridged edition 2006 | 12 hours and 34 mins | ISBN: 1400153271 | MP3 64 kbps | 363 MB\n\n\n\n\n During the dark days of the Great Depression, thousands of weary souls escaped their bleak lives for a week of paradise aboard the Ward Line's glamorous cruise ship, the Morro Castle. It was the most famous passenger liner of its day, lightning fast, elegantly appointed. It was also a ticking time bomb. It was the summer of 1934. Two sailors joined the Morro Castle crew, one a teenager on his first job away from home, the other a dangerous psychopath. Within two months, they would witness the end of the party in a single night of death, killer storms, and catastrophic fire. And that was only the beginning of a twenty-year-long story. In When the Dancing Stopped, we too walk up the gangplank to that art-deco liner and, at first, enjoy the glamour and the sultry Havana nights. With mounting suspense, we also witness the launch of a mystery that mesmerized the nation and then, in the midst of troubled times, faded away. Award-winning author Brian Hicks, using newly declassified FBI files, thousands of pages of investigation notes, testimony, and new interviews, takes the reader on a mid-century cruise through history, revealing a cold-case file that had been, until now, left unsolved for history. And, as he relates in this work of masterful storytelling, it all began with the last cruise of the Morro Castle.\n","torrent":{"xt":"urn:btih:f74cf40dca6039b7a50b3ab0915757c363264e8e","amp;dn":"Brian+Hicks+-+When+The+Dancing+Stopped","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f74cf40dca6039b7a50b3ab0915757c363264e8e","infoHashBuffer":{"type":"Buffer","data":[247,76,244,13,202,96,57,183,165,11,58,176,145,87,87,195,99,38,78,142]},"announce":[],"urlList":[]}}