{"title":"Osho_The Last Testament_vol-2 #15_about AIDS.mp4","uid":15139207,"size":902456666,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f865404888440b69afe2e4bf9b2bb3b1b902d4b3&amp;dn=Osho_The+Last+Testament_vol-2+%2315_about+AIDS.mp4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drugarica","files":1,"time":1467190037,"description":"The Last Testament, Vol 2,Chapter #15\r\n4 September 1985 pm in Jesus Grove\r\nLength: \t103 mins\r\nINTERVIEW WITH KGW TV, PORTLAND, OREGON\r\nQUESTION:* BHAGWAN, HELLO. YOU MUST BE EXHAUSTED AFTER THE ENTRANCE.\r\nA:* No.\r\nQ:* I'M COME TO ASK YOU A SERIES OF QUESTIONS ABOUT AIDS. WE SAW YOUR FORECAST A YEAR AND A HALF A GO, IN MARCH OF 1984, AT A TIME WHEN YOU SAID THAT TWO-THIRDS OF THE WORLD'S POPULATION WOULD EVENTUALLY DIE OF THE DISEASE. I'M CURIOUS WHERE THAT NUMBER CAME FROM, AND WHY YOU BELIEVE THIS IS TRUE.Q:* AT THE NEWS CONFERENCE THERE WAS TALK OF A GUN IN THE AUDIENCE. AND THE QUESTION OF YOUR BEING KILLED CAME UP AT THAT TIME TOO. IS THIS SOMETHING THAT YOU CAN THINK ABOUT A LOT? IS THIS SOMETHING THAT IS IN THE MINDS OF YOUR PEOPLE? OR ...\r\nQ:* THE CITY THAT YOU BUILT, IS IT COMPLETE NOW, OR WHAT IS THE NEXT STEP OR STAGE OF ITS DEVELOPMENT? WHAT HAPPENS NEXT HERE?\r\n\r\nQ:* IT SOUNDS LIKE WHAT YOU'RE ESTABLISHING HERE IS AN ATTEMPT FOR AN OASIS THAT WILL SURVIVE ALL THE DIRE THINGS THAT YOU PREDICT WITHIN THE NEXT DECADE, THE NEXT TWENTY YEARS. THE GOAL THEN WOULD BE FOR BHAGWAN AND THE SANNYASINS TO LEAD HUMANITY OUT OF ALL OF THIS THROUGH THE COMMUNES, AND THAT WOULD BE THE GOAL OF RAJNEESHPURAM AND THE OTHERS?\r\n\r\nA:* No, it is not the goal. The goal is to become for the whole humanity a new type of school of training, a model for the future. But it depends on them. \r\nQ:* WHAT YOU'RE SAYING SOUNDS LIKE IT'S FROM THE HEAD AND NOT THE HEART. PEOPLE WANT FAMILIES, CHILDREN, COMFORT, AND THE LOVE THAT THESE PROVIDE. THEY WANT THE TRADITION OF THESE THINGS. (INAUDIBLE) WHAT YOU'RE SAYING IS FROM THE HEAD.\r\n\r\nA:* What I am saying is of the heart, but the heart cannot say it. It has to use the head to say it. \r\nQ:* ABOUT SIX, EIGHT MONTHS AGO, THERE WAS A PROGRAM SPONSORED BY THE CHURCH, CALLED &quot;TO THE HEART OF AMERICA,&quot; WHICH SENT SANNYASINS OUT TO FOUR CITIES. THIS LOOKED VERY MUCH LIKE A MISSIONARY EFFORT. WOULD YOU APPROVE OF SUCH A THING?\r\n\r\nA: What are you saying?\r\n\r\n(A sannyasin explains that the university, RIMU, arranged a program to send sannyasins to different cities.)\r\n\r\nA:* I have not even heard about it. These people must have been done something...\r\nBut I have not heard about it, that's why I could not understand your question. These people from the university may have gone to other universities or other cities where people were asking to understand what is going on here, and what is my basic philosophy. So few people had gone on invitation.\r\nWe are not missionaries. We will never go anywhere uninvited. ..\r\nPlease, seed, download free audios and books from oshoworld(dot)com. Thank you","torrent":{"xt":"urn:btih:f865404888440b69afe2e4bf9b2bb3b1b902d4b3","amp;dn":"Osho_The+Last+Testament_vol-2+%2315_about+AIDS.mp4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f865404888440b69afe2e4bf9b2bb3b1b902d4b3","infoHashBuffer":{"type":"Buffer","data":[248,101,64,72,136,68,11,105,175,226,228,191,155,43,179,177,185,2,212,179]},"announce":[],"urlList":[]}}