{"title":"Red Dwarf - Last Human","uid":4174215,"size":58096712,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f911357e596ac925956066d35ee7cc43e76fd83c&amp;dn=Red+Dwarf+-+Last+Human&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alfifre","files":4,"time":1210031733,"description":"&quot;Last Human&quot; is the third instalment in the Red Dwarf saga, picking up from where &quot;Better Than Life&quot; left off. While the first two books were collaborative efforts, this novel is a &quot;solo&quot; work by the Naylor half of that writing gestalt known as &quot;Grant Naylor&quot;.\n\nWhen the book begins Dave Lister, or rather &quot;a version&quot; of Dave Lister, has been sentenced to eighteen years Hard Thought in the penal colony Cyberia: eighteen years imprisoned in his own virtual hell. Hard Thought is a punishment where the prisoner&amp;#039;s most dreaded fantasies are made real. In Lister&amp;#039;s case, being trapped in a world where neighbours play Neil Diamond records full blast. That, and a whole lot of other nasty tortures.\n\nMeanwhile the Lister we know, along with Rimmer, Kryten, Cat and a recently resurrected Kristine Kochanski, are flying in Starbug towards the Omni-zone, the point in space where all the different realities converge. They are diverted from their course back to Red Dwarf when they come across a derelict craft: another Starbug. One where the crew have been slaughtered and Lister is missing.\n\nA dying version of Kochanski tells the others that someone took Lister. They take it upon themselves to find this other Lister and rescue him. This marks the beginning of a series of hilarious misadventures, wrong turnings and bad, bad choices, as we travel across a galaxy populated by genitically engineered lifeforms, broken down &amp;#039;droids and homicidal villains.\n\n&quot;Last Human&quot; makes you think about what it would be like to meet another version of yourself. Decisions are made that could produce a personality completely different from your own. This is by no means a new idea, but in this case the writer treats it with great wit and humour. Certain ideas and scenes in the novel are based on things that happened in the TV series, but it has all been rearranged and augmented. This is where print can achieve what a limited TV budget can&amp;#039;t.\n\nThis is science fiction writing at its most humorous. Irreverent, zany and wild. ","torrent":{"xt":"urn:btih:f911357e596ac925956066d35ee7cc43e76fd83c","amp;dn":"Red+Dwarf+-+Last+Human","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f911357e596ac925956066d35ee7cc43e76fd83c","infoHashBuffer":{"type":"Buffer","data":[249,17,53,126,89,106,201,37,149,96,102,211,94,231,204,67,231,111,216,60]},"announce":[],"urlList":[]}}