{"title":"THE NEW AGE MOVEMENT - NEW AGE OR OLD OCCULT","uid":4982149,"size":127464138,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f9638891b3aa41d29fe9f2685acb6a4d7ea2adc0&amp;dn=THE+NEW+AGE+MOVEMENT+-+NEW+AGE+OR+OLD+OCCULT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mardu33","files":5,"time":1246386107,"description":"----------------------------------------------------------------------\n          THE NEW AGE MOVEMENT - NEW AGE OR OLD OCCULT ? :\n----------------------------------------------------------------------\nType.................: Interwiev / Audio Book\nYear.................: 2009\nFile Format..........: MP3\nAudio................: MP3 / English\nAudio Bitrate........: 128kbps \nGenre................: Audio Book\nDuration.............: 78mins\n\n\nDescription..........: \nTHE NEW AGE MOVEMENT - NEW AGE OR OLD OCCULT ? :\n \n\nAbout The Audio:\n\nThe New Age Movement (NAM) is both a religious and a social movement. In fact, \nWestern culture is currently experiencing a phenomenal, spiritual, ideological, \nand sociological shift. It is a religious world view that is alien and hostile \nto Christianity. It's a multi-focused, multi-faceted synthesis, in varying \negrees, of the Far Eastern, mystical religions, mainly Hinduism, Buddhism, \nTaoism, and Western Occultism, adapted to and influenced by Western, \nmaterialistic culture. It sometimes appears in secularized forms.\n\nThe New Age Movement consists of an incredibly huge and well \norganized network consisting of thousands of groups, trusts, foundations, \nclubs, lodges, and religious groups whose goal and purpose is to prepare \nthe world to enter the coming &quot;Age Of Aquarius.&quot;\n\nThe New Age movement is not a unified, traditional cult system of beliefs and \npractices, even though its roots derive from Eastern religions and the occult. \nIt has no official leader, headquarters, nor membership list, but instead is \na network of groups working toward specific goals. One of its main goals is \nto bring to the forefront a one-world leader who is called &quot;The Christ&quot; \nor &quot;Maitreya.&quot; Nevertheless, it is estimated that there are millions of \nworldwide followers of various New Age practices and/or holders of one or \nmore of the major beliefs of the New Age.\n\nBottom line: The term &quot;New Age&quot; is an informal term derived from astrology, \nwhich indicates that this earth, if not the cosmos, is on the verge of \nan evolutionary transition from the Piscean Age (rationality) to the \nAquarian Age of spirituality, bliss, and harmony of all things. \nEven though it is undergoing a significant revival, the &quot;New Age&quot; is \nhardly new. In fact, it is very old. A better term would be the &quot;Old Occult. &quot; \n\nWARNING FOR PARENTS......THE SCHOOLS ARE INTRODUCING NEW AGE PRACTICES...BEWARE!\nJim and Shirley Mae Fry\nJun 23, 2007\n\nDear ones.......below is a site to click or paste into your browser.  \nALL those who have children or grandchildren need to read this message and hear this alert.\n\nRemember, satan as a ROARING LION, seeks to devour men, women and children.......satan's \nwork on earth is to kill, steal and destroy......and the dark force is busy coming \ninto the midst of The Church, trying to move &quot;off path&quot; those who are IN Christ Jesus......\n\n.....and right now we see the children becoming satan's primary target.......satan for \nthe most part has the adults in this world eating at his table, delicacies pleasant to \nthe eye, but when taken into the body, in time, will cause eternal separation from God, \nsealing their eternal destiny in hell.","torrent":{"xt":"urn:btih:f9638891b3aa41d29fe9f2685acb6a4d7ea2adc0","amp;dn":"THE+NEW+AGE+MOVEMENT+-+NEW+AGE+OR+OLD+OCCULT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9638891b3aa41d29fe9f2685acb6a4d7ea2adc0","infoHashBuffer":{"type":"Buffer","data":[249,99,136,145,179,170,65,210,159,233,242,104,90,203,106,77,126,162,173,192]},"announce":[],"urlList":[]}}