{"title":"DC52 - Lantern Corps Chronology - part 1","uid":8811403,"size":6323688442,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:fb03459605167f71e75ee2d1181985aa3f7da7ef&amp;dn=DC52+-+Lantern+Corps+Chronology+-+part+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"catapiller","files":217,"time":1376465814,"description":"Welcome to a Lantern Corps Chronology.  This should be all of \nthe appearances of the various members of the Lantern Corps in \nthe DC new 52 up to date.  This will take care of everything up \nthrough the First Lantern War, plus a bit more.  The Off \nContinuity stuff is presented at the end in separate folders.\n\nNone of these scans are mine, just collected and collated.  \nThanks to those responsible.  The spice must flow!\n\nYou will the find the following Authors and more:  Mark Waid, \nPeter J. Tomasi, Peter Milligan, Geoff Johns, Grant Morrison, \nDan Jurgens, Joe Harris, Judd Winick, Dan Didio, Tony Bedard, \nJeff Lemire, Keith Giffen, Justin Jordan, Robert Venditti, \nCharles Soule, Brian Buccellato, J.M. Dematteis, Jimmy Palmiotti, \nTom Taylor, Derek Fridolfs, dustin nguyen, JT Krul\n\nYou will the find the following Artists and more:  Ivan Reis, \nFernando Pasarin, Ardian Syaf, Jim Lee, Gene Ha, Rags Morales, \nAaron Lopresti, Mark Castiello, Yildiray Cinar, Marcus To, \nJason Fabok, Ed Benes, Geraldo Borges, Tyler Kirkham, \nDoug Mahnke, Claude St. Aubin, Mike Choi, Marcio Takara, \nAndres Guinaldo, Jorge Jimenez, Miguel Sepulveda, Tomas Giorello, \nRenato Guedes, Aaron Kuder, Ethan VanSciver, Cafu, Andrei Bressan, \nChriscross, Steve Pugh, Will Conrad, Scott Kolins, Tom Raney, \nPhil Winslade, David Finch, Bret Booth, Brad Walker, Van Jensen, \nBilly Tan, Alessandro Vitti, Sami Basri, Justin Gray, \nJheremy Raapack, Axel Gimenez, Mike Miller, Howard Porter\n\nThe Comics will be in either .cbr or .cbz format.\n\nAll titles are from the DC Universe.\n\nThe language is English.\n\nEnjoy!","torrent":{"xt":"urn:btih:fb03459605167f71e75ee2d1181985aa3f7da7ef","amp;dn":"DC52+-+Lantern+Corps+Chronology+-+part+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb03459605167f71e75ee2d1181985aa3f7da7ef","infoHashBuffer":{"type":"Buffer","data":[251,3,69,150,5,22,127,113,231,94,226,209,24,25,133,170,63,125,167,239]},"announce":[],"urlList":[]}}