{"title":"James Carnac - Autobiografia Kuby Rozpruwacza [PL]","uid":13418890,"size":319182555,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:fb4988fe6b4c31d3506a1219ea4972196d3e1a15&amp;dn=James+Carnac+-+Autobiografia+Kuby+Rozpruwacza+%5BPL%5D+MP3%4064&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"everdarksoul","files":69,"time":1454528599,"description":"Audiobook PL - 67 części /   \r\nrozmiar: 304 MB / czas: 10:58:57\r\nczyta: Stanislaw Biczysko\r\n\r\nSensacyjne wspomnienia niejakiego Jamesa Willoughby Carnac’a - podajacego sie za seryjnego mordercę, zwanego Kubą Rozpruwaczem! Spisane w 1920 roku, dopiero niedawno ujrzaly swiatlo dzienne... Kim byl sprawca nigdy nierozwiklanych zabójstw prostytutek w Whitechapel w 1888 roku..? Poznaj motywy, które sprowadzily Carnaca na droge zbrodni, które przez ponad sto lat stanowily zagadkę...\r\n\r\nOpowieść ta zainteresuje przede wszystkim tych, których postać Kuby Rozpruwacza nadal fascynuje. Nie chodzi, oczywiście, o ewentualne naśladownictwo - ale raczej o zaintrygowanie osobą, która z jednej strony weszła do historii kryminalistyki, z drugiej natomiast stała się inspiracją do wielu kulturowych nawiązań. Książka ta okazuje się również ciekawą okazją do refleksji, na temat fenomenu odnalezionych zapisków, kwestii udostępniania ich przez osoby do tego upoważnione oraz autentyczności tego, co pretenduje do roli oryginału. Dodatkowym smaczkiem dla znawców postaci Kuby Rozpruwacza może się okazać zamieszczony w publikacji komentarz autorstwa Paula Begga. Badacz ten jest jednym z ekspertów, jeśli mowa o tematyce związane ze słynnym mordercą prostytutek. Polski czytelnik może znać już jego dzieło, zatytułowane &quot;Kuba Rozpruwacz. Historia kompletna&quot;. Analiza rzekomej autobiografii okazuje się równie interesująca jak tekst właściwy - o ile Carnac (vel Kuba Rozpruwacz) zgodnie z regułami logiki, rekonstruuje swoje losy od dzieciństwa do dorosłości, o tyle w komentarzu znajdziemy liczne porównania do innych tekstów, odsłaniające w istocie nierozwiązywalność sekretu tożsamości mordercy. Autobiografia więc nie wymazuje samej tajemnicy - a wręcz jeszcze bardziej ją komplikuje... Ale w żaden sposób nie można też podważyć jej autentyczności, gdyż nie da się nie zauważyć znacznego prawdopodobieństwa biograficznego. Tak naprawdę jednak w przypadku tej publikacji najważniejsze wydaje się nie tyle potwierdzenie lub zaprzeczenie autentyczności maszynopisu - ale fakt jego zadziwiającej wprost sugestywności, wiarygodnego umocowania w faktach, przekonującego uzasadnienia narodzin zła i postępującej rozkoszy zabijania. W efekcie więc mamy do czynienia nie tylko z kolejnymi dopiskami do wielotomowej historii badań nad Kubą Rozpruwaczem, lecz również z inspiracją do refleksji na temat światów alternatywnych oraz pisarstwa apokryficznego","torrent":{"xt":"urn:btih:fb4988fe6b4c31d3506a1219ea4972196d3e1a15","amp;dn":"James+Carnac+-+Autobiografia+Kuby+Rozpruwacza+%5BPL%5D+MP3%4064","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb4988fe6b4c31d3506a1219ea4972196d3e1a15","infoHashBuffer":{"type":"Buffer","data":[251,73,136,254,107,76,49,211,80,106,18,25,234,73,114,25,109,62,26,21]},"announce":[],"urlList":[]}}