{"title":"Johansson et al. - Self-organizing Flow Technology - In Viktor S","uid":3494278,"size":3005672,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb5cf64e7ce956dfc748a3ca6d5712d0988533e7&amp;dn=Johansson+et+al.+-+Self-organizing+Flow+Technology+-+In+Viktor+S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1149938455,"description":"This is the fascinating book Self-organizing Flow Technology - In Viktor Schauberger&amp;#039;s Footsteps (2002), published by several authors from Institute of Ecological Technology in Sweden, which tries to evolve a new perspective on the ideas of the Austrian naturalist Viktor Schauberger, with the aid of concepts from modern research into chaotic and self-organizing systems. Schauberger, a famous austrian natural philosopher, predicted the ecological catastrophes which are occuring all around us and proposed the solution - return to the principles of mother nature. The focus of the report is on modelling. With the aid of concepts like self-organization, free and forced vortex flow, chaotic pulsation, mathematical bifurcations and minimal surfaces, and with flow images like ?handkerchief dynamics? and ?toroidal vortex flow?, the authors try to sketch a natural sciences perspective that comes close to Schauberger&amp;#039;s. They replicate the Stuttgart experiments with vortex generation and particle separation, and give an overview of existing research in the area. The report also covers applications such as oxygenation of water, e.g. in fish ponds, bathing facilities, and sewage plants, and particle separation, e.g. in laundry plants, the food industry, and paper-mill industry. Some perspectives are also given on restoration of natural waterways and minor lakes or bays. Find out how the ideas of Viktor Schauberger are being rediscovered again and what are the modern trends concerning their application in our everyday lives. 50 pages, many pictures. A must read from everyone.\n\nMore info: http://www.iet-community.org/bookshop/report-01.html\n","torrent":{"xt":"urn:btih:fb5cf64e7ce956dfc748a3ca6d5712d0988533e7","amp;dn":"Johansson+et+al.+-+Self-organizing+Flow+Technology+-+In+Viktor+S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb5cf64e7ce956dfc748a3ca6d5712d0988533e7","infoHashBuffer":{"type":"Buffer","data":[251,92,246,78,124,233,86,223,199,72,163,202,109,87,18,208,152,133,51,231]},"announce":[],"urlList":[]}}