{"title":"Drowningman - Still Loves You (EP) (2001) [FLAC]","uid":9378184,"size":143098591,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fd870705cc9bb0365d708e75c651e2afbdc00c9c&amp;dn=Drowningman+-+Still+Loves+You+%28EP%29+%282001%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"boogybot","files":-1,"time":1387657754,"description":"5 song EP ripped from CD in FLAC\n\nTrack Listings\n1. The More I Get To Know You The Less I Like You\n2. The Unbearable Burden Of Always Being Right\n3. Weighted And Weighed Down\n4. Living With The Awful Truth That We're Not As Cool As We'd Like Other People To Think We Are\n5. Surveillance Footage Highlights\n\n\n\n5.0 out of 5 stars Fresh direction, September 30, 2008\n\nBy Jeffrey M. (Redwood City, CA)\nThis review is from: Still Loves You (Audio CD)\n\nDman already had 2 structurally/technically wild releases under their belt: 'How They Light Cigarettes in Prison' and 'Rock and Roll Killing Machine.' 'Drowningman Still Loves You' drives more straightforward, exploring their melodic side further than previous works did. The closing track has a very inventive spoken-word bridge. Feels all John Clancy.\n\n\nDrowningman\nStill Loves You (2001)\nEqual Vision Records\n\nReviewer Rating: 4.5/5 User Rating: 4.5/5\n\nContributed by: coldjuly \n\nPublished on July 18th 2001\n\nD-man is back!! This time with &quot;still loves you&quot; This has become one of my favorite hardcore bands in the past year or so, This EP still has those long, cynical as fuckin shit song titles I mean lots of hardcore bands have the long drwin out song titles but D-man has to have the longest ever. For example, &quot;last weeks minutes from the secret society of friends who actually hate you&quot; or something like that....I dont know all the song title names from the new EP yet because i dont actually own an original version. In fact, It dosent hit the streets until July 24th. But, I swindled it off one of my friends who works in a record store and they get all the promos and demo versions in a few weeks early. Anyway, Back to the record...This is a typical drowningman album, Full of sarcasm, If youve heard D-man's previous efforts you know what i mean, lots of good healthy screaming and a good bit of melody from the boys from burlington VT. If your just getting in to modern hardcore i suggest you check out this band, And if your already a fan of D-man you will love this EP as well. Also check out &quot;busy signal at the suicide hotline&quot; and &quot;rock n roll killing machine&quot; both in stores now. Fuckin awesome.\n\n\n\nDrowningman - Still Loves You2001 Revelation Records\n\nOUR SCORE 9/10\n\nReviewed by: Alex   //   Published: 1/2/2002\n\nThe most consistent Drowningman release to date, this five song EP is a must-own for any hardcore listener. Some fans of the group have compared this one to the group's earlier EP, 'Busy Signal At The Suicide Hotline', and it would be hard to disagree. Either way you slice it though, 'Still Loves You' is a cut above their previous full-length ('Rock &amp; Roll Killing Machine ') which was a great record in its own right.\n\nAlthough Drowningman has always found a nice balance between restrained technicality and unpredictable chaos, they truly seem to have their niche, adding an extra dimension of melody to their tongue-in-cheek material. Simon Brody really displays his versatility on this one, comfortably belting out his forceful screams, but also providing some solid rock-styled singing, which he's done before, but with less effectiveness. A lot of hardcore bands have been applying emo to their music lately, but it still sounds a bit contrived in most cases. I wouldn't call anything Drowningman does emo, but there is a healthy dose of mellow stuff here. If you listen to &quot;The Unbearable Burden of Always Being Right,&quot; an amazing track, you'll find that Drowningman has actually become quite skilled at adding non-hardcore ingredients to their material, without sounding desperate or cliched.\n\nMore importantly, they still know how to rock out. From the killer bridge in &quot;Weighted And Weighed Down,&quot; a track which appeared on their first 7&quot; in 1997, to the blistering opener, &quot;The More I Get To Know You The Less I Like You,&quot; there is still plenty of heavy stuff on here.\n\nThe song titles aren't quite as clever as they've been in the past, but then again, how many amazing song titles can one man think of We'll get over it. The fact is, Drowningman is at the top of their game right now. I'm anxious to hear if they can pull this off again for an entire full-length, so we'll see what happens. Unfortunately, one of the pitfalls of being at the top of one's game is that there's no where to go but down. Hopefully, Drowningman will hang around the &quot;top&quot; for a few more records.\n\n","torrent":{"xt":"urn:btih:fd870705cc9bb0365d708e75c651e2afbdc00c9c","amp;dn":"Drowningman+-+Still+Loves+You+%28EP%29+%282001%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd870705cc9bb0365d708e75c651e2afbdc00c9c","infoHashBuffer":{"type":"Buffer","data":[253,135,7,5,204,155,176,54,93,112,142,117,198,81,226,175,189,192,12,156]},"announce":[],"urlList":[]}}