{"title":"Womens Health books Zoe Brown Endometriosis Bible - PMS - Pregna","uid":6379396,"size":79764279,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fe4190f84fefcc3456d4edc51b23502327fe4790&amp;dn=Womens+Health+books+Zoe+Brown+Endometriosis+Bible+-+PMS+-+Pregna&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"freakyglas","files":8,"time":1304976313,"description":"Womens Health book\n\nBooks Mainly about a common health problem among women that is very unknown to most people.\n\nMany women have endometriosis, knowlingly or unknowlingly. There are different states of this condition. One can be calm and the other can be devestating, the pain is among the top 5 worst types of pain a human being can suffer from.\n\n\nOther books are abour PMS and pregnancy + much more.\n\n\nPlease, if you're a woman and have constant pain or pain that occasinally come at random times. Yet doctors say you are &quot;okay&quot; please download this book and read.\n\nThe Endometriosis Bible -  Violet Project file is called: \n\n\ngg3F9A.pdf and is around 35 mb\n\n\nWe must spread the word about this condition and make people more aware of this condition that affect the women population.\n\nThe majority of doctors are unaware of this condition! Only specific specialists know about it. We need to spread the word about this condition so more pressure is put on our health departments, scientists and doctors. So that we can boost up the progress of finding a cure.\n\nTodays only way to handle this condition today is...\n\nMorphine, yes, M O R P H I N E. I'm not kidding. The pain is devestating and can put women into chock and/or cause unconsiousness.\n\nCan you imagine your own daugther or sister taking morphine to kill the pain that regulary sneaks up on her?\n\n\nThere is no real cure yet, but I am hoping that by sharing this information, we can make more people aware of this condition and boost up the progress for finding a cure.\n\n\nPlease share these files with other people, post a link on your facebook so people can download it. Tell your friends to share the link with their friends etc...\n","torrent":{"xt":"urn:btih:fe4190f84fefcc3456d4edc51b23502327fe4790","amp;dn":"Womens+Health+books+Zoe+Brown+Endometriosis+Bible+-+PMS+-+Pregna","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe4190f84fefcc3456d4edc51b23502327fe4790","infoHashBuffer":{"type":"Buffer","data":[254,65,144,248,79,239,204,52,86,212,237,197,27,35,80,35,39,254,71,144]},"announce":[],"urlList":[]}}