{"title":"DIY SOS The Big Buid","uid":8379785,"size":1527702836,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ff0f0d029129cab4c664577aa49ccb275fcf1fa0&amp;dn=DIY+SOS+The+Big+Buid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"morritos","files":1,"time":1366131358,"description":"Launched in 1999, after audience figures showed interest in other home make-over shows such as Changing Rooms, DIY SOS is a weekly full builder and designer level renovation of a section of a viewers home, taken on by a team of professionals after a viewers DIY project has gone wrong and not been finished. It is the longest running show of its format having been shown for over 10 years. Some believe it has cult status and even has an active dedicated forum.\n\nLaunched with presenter Nick Knowles, the format consisted of a main project, and a small project initially headed by Lowri Turner (but after Lowri left the show, a number of subsequent presenters were used for the smaller segment), and a viewer call-in vote format voting for one of three families who have made short video pitches for their projects to be addressed in the following programme.\n\nAn episode filmed in June 2009 was not broadcast after a domestic incident where a man held his wife hostage at gunpoint before shooting himself, the week before the intended broadcast. The episode is believed to have contained fitting the couple's semi-detached home with a new kitchen.[1]\n","torrent":{"xt":"urn:btih:ff0f0d029129cab4c664577aa49ccb275fcf1fa0","amp;dn":"DIY+SOS+The+Big+Buid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff0f0d029129cab4c664577aa49ccb275fcf1fa0","infoHashBuffer":{"type":"Buffer","data":[255,15,13,2,145,41,202,180,198,100,87,122,164,156,203,39,95,207,31,160]},"announce":[],"urlList":[]}}