{"title":"A Hell for Heroes","uid":8919685,"size":1155710,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ff56728ef44fa05bcfa4e4937d36ff3c3ff3ac14&amp;dn=A+Hell+for+Heroes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"livhre","files":-1,"time":1379223153,"description":"Theodore Knell went through hell in the SAS - but his biggest battle began when he left. A Hell for Heroes is a searingly honest autobiography about what life in the military service is really like.\nThis is my life story and the story of my time in the SAS. I hope that any soldier who reads it will find some sort of connection with their own. I have tried to share my experiences honestly, and as such all of the incidents portrayed within this book are true, some so dark and painful that I often questioned whether I wanted to remain part of the human race.\n\nI hope it will provide you an insight into the life and mind of a soldier - what makes us the way we are, what drives us on when other men would fold, what binds us together like no other brotherhood on earth, what makes us laugh and what scares us shitless.\n\nWatching men die violently for the first time is not something I would wish on any young man. Yes, many who have not served will say 'It will make a man out of you son'. but what do they know? In reality it will destroy far more men than it makes, leaving many dead or crippled for life, some with wounds you can see, but far more with wounds which you cannot.","torrent":{"xt":"urn:btih:ff56728ef44fa05bcfa4e4937d36ff3c3ff3ac14","amp;dn":"A+Hell+for+Heroes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff56728ef44fa05bcfa4e4937d36ff3c3ff3ac14","infoHashBuffer":{"type":"Buffer","data":[255,86,114,142,244,79,160,91,207,164,228,147,125,54,255,60,63,243,172,20]},"announce":[],"urlList":[]}}