{"title":"MICROSOFT.SHAREPOINT.PORTAL.SERVER.V2003-ISO.tar","uid":3245698,"size":380323840,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fff3cf5c655215577861303ca6ece13f8037c298&amp;dn=MICROSOFT.SHAREPOINT.PORTAL.SERVER.V2003-ISO.tar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bushi","files":1,"time":1097188158,"description":"SharePoint Portal Server 2003 is a secure, scalable, enterprise portal server built upon Windows SharePoint Services that you can use to aggregate SharePoint sites, information, and applications into a single portal. All features of Windows SharePoint Services are available in SharePoint Portal Server 2003. .... c&quot;)\n\nMicrosoft SharePointÂ® Portal Server 2003 enables enterprises to develop an intelligent portal that seamlessly connects users, teams, and knowledge so that people can take advantage of relevant information across business processes to help them work more efficiently. SharePoint Portal Server 2003 provides an enterprise business solution that integrates information from various systems into one solution through single sign-on and enterprise application integration capabilities, with flexible deployment options and management tools. The portal facilitates end-to-end collaboration by enabling aggregation, organization, and search capabilities for people, teams, and information. Users can find relevant information quickly through customization and personalization of portal content and layout, as well as by audience targeting. Organizations can target information, programs, and updates to audiences based on their organizational role, team membership, interest, security group, or any other membership criteria that can be defined.\n&lt;a href=&quot;http://www.microsoft.com/office/sharepoint/prodinfo/overview.mspx&gt;More here&lt;/a&gt;\n","torrent":{"xt":"urn:btih:fff3cf5c655215577861303ca6ece13f8037c298","amp;dn":"MICROSOFT.SHAREPOINT.PORTAL.SERVER.V2003-ISO.tar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fff3cf5c655215577861303ca6ece13f8037c298","infoHashBuffer":{"type":"Buffer","data":[255,243,207,92,101,82,21,87,120,97,48,60,166,236,225,63,128,55,194,152]},"announce":[],"urlList":[]}}